{
    "SKOS_CONCEPT": [
        {
            "definition": "Minimal - symptoms or pathological characteristics include minimal hepatic encephalopathy, lack of detectable changes in personality or behavior, minimal changes in memory, concentration and intellectual function, and absence of coordination asterixis. (Adapted from: Hepatic Encephalopathy. David C Wolf. http://emedicine.medscape.com/article/186101-overview)",
            "identifier": "C117824",
            "notation": "GRADE 0",
            "pref_label": "West Haven Hepatic Encephalopathy Grade 0",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C117746-C117824"
        },
        {
            "definition": "Mild - symptoms or pathological characteristics include trivial lack of awareness, shortened attention span, impaired ability to perform addition or subtraction, hypersomnia, insomnia, or inversion of sleep pattern, euphoria, depression or irritability, mild confusion, slowing of ability to perform mental tasks. (Adapted from: Hepatic Encephalopathy. David C Wolf. http://emedicine.medscape.com/article/186101-overview.)",
            "identifier": "C117825",
            "notation": "GRADE 1",
            "pref_label": "West Haven Hepatic Encephalopathy Grade 1",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C117746-C117825"
        },
        {
            "definition": "Moderate - symptoms or pathological characteristics include lethargy or apathy, disorientation, inappropriate behavior, slurred speech, obvious asterixis, drowsiness, lethargy, gross deficits in ability to perform mental tasks, obvious personality changes, inappropriate behavior, and intermittent disorientation, unsurely regarding time. (Adapted from: Hepatic Encephalopathy. David C Wolf. http://emedicine.medscape.com/article/186101-overview.)",
            "identifier": "C117826",
            "notation": "GRADE 2",
            "pref_label": "West Haven Hepatic Encephalopathy Grade 2",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C117746-C117826"
        },
        {
            "definition": "Severe - symptoms or pathological characteristics include somnolence with some arousability, inability to perform mental tasks, disorientation about time and place, marked confusion, amnesia, occasional fits of rage, present but incomprehensible speech. (Adapted from: Hepatic Encephalopathy. David C Wolf. http://emedicine.medscape.com/article/186101-overview.)",
            "identifier": "C117827",
            "notation": "GRADE 3",
            "pref_label": "West Haven Hepatic Encephalopathy Grade 3",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C117746-C117827"
        },
        {
            "definition": "Coma - symptoms or pathological characteristics include coma with or without response to painful stimuli. (Adapted from: Hepatic Encephalopathy. David C Wolf. http://emedicine.medscape.com/article/186101-overview.)",
            "identifier": "C117828",
            "notation": "GRADE 4",
            "pref_label": "West Haven Hepatic Encephalopathy Grade 4",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C117746-C117828"
        }
    ]
}