{
    "SKOS_CONCEPT": [
        {
            "alt_label": "FAC100-Limit: Carry 10-20 Lbs",
            "definition": "Functional Assessment of Chronic Illness Therapy-Dyspnea Scale 33 Item Bank - Functional Limitation: Considering your shortness of breath over the past 7 days, rate the amount of difficulty you had when doing the following activities: Carrying something weighing 10-20 lbs (about 4.5-9kg, like a large bag of groceries) from one room to another.",
            "identifier": "C155556",
            "notation": "FAC100-Limit: Carry 10-20 Lbs",
            "pref_label": "FACIT-Dyspnea Scale 33 Item Bank Version - Limit: Carry 10-20 Lbs",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C154450-C155556"
        },
        {
            "alt_label": "FAC100-Limit: Carrying 5-10 Lbs",
            "definition": "Functional Assessment of Chronic Illness Therapy-Dyspnea Scale 33 Item Bank - Functional Limitation: Considering your shortness of breath over the past 7 days, rate the amount of difficulty you had when doing the following activities: Carrying something weighing 5-10 lbs (about 2-4.5 kg, like a basket of clothes) from one room to another.",
            "identifier": "C155572",
            "notation": "FAC100-Limit: Carrying 5-10 Lbs",
            "pref_label": "FACIT-Dyspnea Scale 33 Item Bank Version - Limit: Carrying 5-10 Lbs",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C154450-C155572"
        },
        {
            "alt_label": "FAC100-Limit: Carrying Less Than 5 Lbs",
            "definition": "Functional Assessment of Chronic Illness Therapy-Dyspnea Scale 33 Item Bank - Functional Limitation: Considering your shortness of breath over the past 7 days, rate the amount of difficulty you had when doing the following activities: Carrying something weighing less than 5 lbs (about 2 kg, like a houseplant) from one room to another.",
            "identifier": "C155571",
            "notation": "FAC100-Limit: Carrying Less Than 5 Lbs",
            "pref_label": "FACIT-Dyspnea Scale 33 Item Bank Version - Limit: Carrying Less Than 5 Lbs",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C154450-C155571"
        },
        {
            "alt_label": "FAC100-Limit: Dining Out",
            "definition": "Functional Assessment of Chronic Illness Therapy-Dyspnea Scale 33 Item Bank - Functional Limitation: Considering your shortness of breath over the past 7 days, rate the amount of difficulty you had when doing the following activities: Dining out.",
            "identifier": "C155574",
            "notation": "FAC100-Limit: Dining Out",
            "pref_label": "FACIT-Dyspnea Scale 33 Item Bank Version - Limit: Dining Out",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C154450-C155574"
        },
        {
            "alt_label": "FAC100-Limit: Dressing Without Help",
            "definition": "Functional Assessment of Chronic Illness Therapy-Dyspnea Scale 33 Item Bank - Functional Limitation: Considering your shortness of breath over the past 7 days, rate the amount of difficulty you had when doing the following activities: Dressing yourself without help.",
            "identifier": "C155548",
            "notation": "FAC100-Limit: Dressing Without Help",
            "pref_label": "FACIT-Dyspnea Scale 33 Item Bank Version - Limit: Dressing Without Help",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C154450-C155548"
        },
        {
            "alt_label": "FAC100-Limit: Get In/Out of a Car",
            "definition": "Functional Assessment of Chronic Illness Therapy-Dyspnea Scale 33 Item Bank - Functional Limitation: Considering your shortness of breath over the past 7 days, rate the amount of difficulty you had when doing the following activities: Getting in or out of a car.",
            "identifier": "C155573",
            "notation": "FAC100-Limit: Get In/Out of a Car",
            "pref_label": "FACIT-Dyspnea Scale 33 Item Bank Version - Limit: Get In/Out of a Car",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C154450-C155573"
        },
        {
            "alt_label": "FAC100-Limit: Lifting 10-20 Lbs",
            "definition": "Functional Assessment of Chronic Illness Therapy-Dyspnea Scale 33 Item Bank - Functional Limitation: Considering your shortness of breath over the past 7 days, rate the amount of difficulty you had when doing the following activities: Lifting something weighing 10-20 lbs (about 4.5-9kg, like a large bag of groceries).",
            "identifier": "C155555",
            "notation": "FAC100-Limit: Lifting 10-20 Lbs",
            "pref_label": "FACIT-Dyspnea Scale 33 Item Bank Version - Limit: Lifting 10-20 Lbs",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C154450-C155555"
        },
        {
            "alt_label": "FAC100-Limit: Lifting 5-10 Lbs",
            "definition": "Functional Assessment of Chronic Illness Therapy-Dyspnea Scale 33 Item Bank - Functional Limitation: Considering your shortness of breath over the past 7 days, rate the amount of difficulty you had when doing the following activities: Lifting something weighing 5-10 lbs (about 2-4.5 kg, like a basket of clothes).",
            "identifier": "C155569",
            "notation": "FAC100-Limit: Lifting 5-10 Lbs",
            "pref_label": "FACIT-Dyspnea Scale 33 Item Bank Version - Limit: Lifting 5-10 Lbs",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C154450-C155569"
        },
        {
            "alt_label": "FAC100-Limit: Lifting Less Than 5 Lbs",
            "definition": "Functional Assessment of Chronic Illness Therapy-Dyspnea Scale 33 Item Bank - Functional Limitation: Considering your shortness of breath over the past 7 days, rate the amount of difficulty you had when doing the following activities: Lifting something weighing less than 5 lbs (about 2 kg, like a houseplant).",
            "identifier": "C155568",
            "notation": "FAC100-Limit: Lifting Less Than 5 Lbs",
            "pref_label": "FACIT-Dyspnea Scale 33 Item Bank Version - Limit: Lifting Less Than 5 Lbs",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C154450-C155568"
        },
        {
            "alt_label": "FAC100-Limit: Lifting More Than 20 Lbs",
            "definition": "Functional Assessment of Chronic Illness Therapy-Dyspnea Scale 33 Item Bank - Functional Limitation: Considering your shortness of breath over the past 7 days, rate the amount of difficulty you had when doing the following activities: Lifting something weighing more than 20 lbs (about 9 kg, like a medium-sized suitcase).",
            "identifier": "C155570",
            "notation": "FAC100-Limit: Lifting More Than 20 Lbs",
            "pref_label": "FACIT-Dyspnea Scale 33 Item Bank Version - Limit: Lifting More Than 20 Lbs",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C154450-C155570"
        },
        {
            "alt_label": "FAC100-Limit: Low-intensity Activity",
            "definition": "Functional Assessment of Chronic Illness Therapy-Dyspnea Scale 33 Item Bank - Functional Limitation: Considering your shortness of breath over the past 7 days, rate the amount of difficulty you had when doing the following activities: Low-intensity leisure activity (gardening, etc.).",
            "identifier": "C155575",
            "notation": "FAC100-Limit: Low-intensity Activity",
            "pref_label": "FACIT-Dyspnea Scale 33 Item Bank Version - Limit: Low-intensity Activity",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C154450-C155575"
        },
        {
            "alt_label": "FAC100-Limit: Making a Bed",
            "definition": "Functional Assessment of Chronic Illness Therapy-Dyspnea Scale 33 Item Bank - Functional Limitation: Considering your shortness of breath over the past 7 days, rate the amount of difficulty you had when doing the following activities: Making a bed.",
            "identifier": "C155554",
            "notation": "FAC100-Limit: Making a Bed",
            "pref_label": "FACIT-Dyspnea Scale 33 Item Bank Version - Limit: Making a Bed",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C154450-C155554"
        },
        {
            "alt_label": "FAC100-Limit: Moderate Activity",
            "definition": "Functional Assessment of Chronic Illness Therapy-Dyspnea Scale 33 Item Bank - Functional Limitation: Considering your shortness of breath over the past 7 days, rate the amount of difficulty you had when doing the following activities: Moderate-intensity leisure activity (bicycling on level terrain, etc.).",
            "identifier": "C155576",
            "notation": "FAC100-Limit: Moderate Activity",
            "pref_label": "FACIT-Dyspnea Scale 33 Item Bank Version - Limit: Moderate Activity",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C154450-C155576"
        },
        {
            "alt_label": "FAC100-Limit: Preparing Meals",
            "definition": "Functional Assessment of Chronic Illness Therapy-Dyspnea Scale 33 Item Bank - Functional Limitation: Considering your shortness of breath over the past 7 days, rate the amount of difficulty you had when doing the following activities: Preparing meals.",
            "identifier": "C155551",
            "notation": "FAC100-Limit: Preparing Meals",
            "pref_label": "FACIT-Dyspnea Scale 33 Item Bank Version - Limit: Preparing Meals",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C154450-C155551"
        },
        {
            "alt_label": "FAC100-Limit: Putting on Socks",
            "definition": "Functional Assessment of Chronic Illness Therapy-Dyspnea Scale 33 Item Bank - Functional Limitation: Considering your shortness of breath over the past 7 days, rate the amount of difficulty you had when doing the following activities: Putting on socks or stockings.",
            "identifier": "C155560",
            "notation": "FAC100-Limit: Putting on Socks",
            "pref_label": "FACIT-Dyspnea Scale 33 Item Bank Version - Limit: Putting on Socks",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C154450-C155560"
        },
        {
            "alt_label": "FAC100-Limit: Scrubbing the Floor",
            "definition": "Functional Assessment of Chronic Illness Therapy-Dyspnea Scale 33 Item Bank - Functional Limitation: Considering your shortness of breath over the past 7 days, rate the amount of difficulty you had when doing the following activities: Scrubbing the floor or counter.",
            "identifier": "C155567",
            "notation": "FAC100-Limit: Scrubbing the Floor",
            "pref_label": "FACIT-Dyspnea Scale 33 Item Bank Version - Limit: Scrubbing the Floor",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C154450-C155567"
        },
        {
            "alt_label": "FAC100-Limit: Singing or Humming",
            "definition": "Functional Assessment of Chronic Illness Therapy-Dyspnea Scale 33 Item Bank - Functional Limitation: Considering your shortness of breath over the past 7 days, rate the amount of difficulty you had when doing the following activities: Singing or humming.",
            "identifier": "C155579",
            "notation": "FAC100-Limit: Singing or Humming",
            "pref_label": "FACIT-Dyspnea Scale 33 Item Bank Version - Limit: Singing or Humming",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C154450-C155579"
        },
        {
            "alt_label": "FAC100-Limit: Standing 5 Minutes",
            "definition": "Functional Assessment of Chronic Illness Therapy-Dyspnea Scale 33 Item Bank - Functional Limitation: Considering your shortness of breath over the past 7 days, rate the amount of difficulty you had when doing the following activities: Standing for at least 5 minutes.",
            "identifier": "C155561",
            "notation": "FAC100-Limit: Standing 5 Minutes",
            "pref_label": "FACIT-Dyspnea Scale 33 Item Bank Version - Limit: Standing 5 Minutes",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C154450-C155561"
        },
        {
            "alt_label": "FAC100-Limit: Sweeping/Mopping",
            "definition": "Functional Assessment of Chronic Illness Therapy-Dyspnea Scale 33 Item Bank - Functional Limitation: Considering your shortness of breath over the past 7 days, rate the amount of difficulty you had when doing the following activities: Sweeping or mopping.",
            "identifier": "C155553",
            "notation": "FAC100-Limit: Sweeping/Mopping",
            "pref_label": "FACIT-Dyspnea Scale 33 Item Bank Version - Limit: Sweeping/Mopping",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C154450-C155553"
        },
        {
            "alt_label": "FAC100-Limit: Taking a Bath Without Help",
            "definition": "Functional Assessment of Chronic Illness Therapy-Dyspnea Scale 33 Item Bank - Functional Limitation: Considering your shortness of breath over the past 7 days, rate the amount of difficulty you had when doing the following activities: Taking a bath without help.",
            "identifier": "C155558",
            "notation": "FAC100-Limit: Taking a Bath Without Help",
            "pref_label": "FACIT-Dyspnea Scale 33 Item Bank Version - Limit: Taking a Bath Without Help",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C154450-C155558"
        },
        {
            "alt_label": "FAC100-Limit: Taking a Shower",
            "definition": "Functional Assessment of Chronic Illness Therapy-Dyspnea Scale 33 Item Bank - Functional Limitation: Considering your shortness of breath over the past 7 days, rate the amount of difficulty you had when doing the following activities: Taking a shower.",
            "identifier": "C155559",
            "notation": "FAC100-Limit: Taking a Shower",
            "pref_label": "FACIT-Dyspnea Scale 33 Item Bank Version - Limit: Taking a Shower",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C154450-C155559"
        },
        {
            "alt_label": "FAC100-Limit: Talking While Walking",
            "definition": "Functional Assessment of Chronic Illness Therapy-Dyspnea Scale 33 Item Bank - Functional Limitation: Considering your shortness of breath over the past 7 days, rate the amount of difficulty you had when doing the following activities: Talking while walking.",
            "identifier": "C155580",
            "notation": "FAC100-Limit: Talking While Walking",
            "pref_label": "FACIT-Dyspnea Scale 33 Item Bank Version - Limit: Talking While Walking",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C154450-C155580"
        },
        {
            "alt_label": "FAC100-Limit: Walk 50 Steps",
            "definition": "Functional Assessment of Chronic Illness Therapy-Dyspnea Scale 33 Item Bank - Functional Limitation: Considering your shortness of breath over the past 7 days, rate the amount of difficulty you had when doing the following activities: Walking 50 steps/paces on flat ground at a normal speed without stopping.",
            "identifier": "C155549",
            "notation": "FAC100-Limit: Walk 50 Steps",
            "pref_label": "FACIT-Dyspnea Scale 33 Item Bank Version - Limit: Walk 50 Steps",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C154450-C155549"
        },
        {
            "alt_label": "FAC100-Limit: Walk Fast 50 Steps",
            "definition": "Functional Assessment of Chronic Illness Therapy-Dyspnea Scale 33 Item Bank - Functional Limitation: Considering your shortness of breath over the past 7 days, rate the amount of difficulty you had when doing the following activities: Walking (faster than your usual speed) for 50 steps without stopping.",
            "identifier": "C155577",
            "notation": "FAC100-Limit: Walk Fast 50 Steps",
            "pref_label": "FACIT-Dyspnea Scale 33 Item Bank Version - Limit: Walk Fast 50 Steps",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C154450-C155577"
        },
        {
            "alt_label": "FAC100-Limit: Walk for 1/2 Mile",
            "definition": "Functional Assessment of Chronic Illness Therapy-Dyspnea Scale 33 Item Bank - Functional Limitation: Considering your shortness of breath over the past 7 days, rate the amount of difficulty you had when doing the following activities: Walking (faster than your usual speed) for 1/2 mile (almost 1 km) without stopping.",
            "identifier": "C155557",
            "notation": "FAC100-Limit: Walk for 1/2 Mile",
            "pref_label": "FACIT-Dyspnea Scale 33 Item Bank Version - Limit: Walk for 1/2 Mile",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C154450-C155557"
        },
        {
            "alt_label": "FAC100-Limit: Walk Up 20 Stairs",
            "definition": "Functional Assessment of Chronic Illness Therapy-Dyspnea Scale 33 Item Bank - Functional Limitation: Considering your shortness of breath over the past 7 days, rate the amount of difficulty you had when doing the following activities: Walking up 20 stairs (2 flights) without stopping.",
            "identifier": "C155550",
            "notation": "FAC100-Limit: Walk Up 20 Stairs",
            "pref_label": "FACIT-Dyspnea Scale 33 Item Bank Version - Limit: Walk Up 20 Stairs",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C154450-C155550"
        },
        {
            "alt_label": "FAC100-Limit: Walking 1/2 Mile",
            "definition": "Functional Assessment of Chronic Illness Therapy-Dyspnea Scale 33 Item Bank - Functional Limitation: Considering your shortness of breath over the past 7 days, rate the amount of difficulty you had when doing the following activities: Walking 1/2 mile (almost 1 km) on flat ground at a normal speed without stopping.",
            "identifier": "C155563",
            "notation": "FAC100-Limit: Walking 1/2 Mile",
            "pref_label": "FACIT-Dyspnea Scale 33 Item Bank Version - Limit: Walking 1/2 Mile",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C154450-C155563"
        },
        {
            "alt_label": "FAC100-Limit: Walking 10 Steps",
            "definition": "Functional Assessment of Chronic Illness Therapy-Dyspnea Scale 33 Item Bank - Functional Limitation: Considering your shortness of breath over the past 7 days, rate the amount of difficulty you had when doing the following activities: Walking 10 steps/paces on flat ground at a normal speed without stopping.",
            "identifier": "C155562",
            "notation": "FAC100-Limit: Walking 10 Steps",
            "pref_label": "FACIT-Dyspnea Scale 33 Item Bank Version - Limit: Walking 10 Steps",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C154450-C155562"
        },
        {
            "alt_label": "FAC100-Limit: Walking Fast 1 Mile",
            "definition": "Functional Assessment of Chronic Illness Therapy-Dyspnea Scale 33 Item Bank - Functional Limitation: Considering your shortness of breath over the past 7 days, rate the amount of difficulty you had when doing the following activities: Walking (faster than your usual speed) for at least 1 mile (a little more than 1.5 km) without stopping.",
            "identifier": "C155578",
            "notation": "FAC100-Limit: Walking Fast 1 Mile",
            "pref_label": "FACIT-Dyspnea Scale 33 Item Bank Version - Limit: Walking Fast 1 Mile",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C154450-C155578"
        },
        {
            "alt_label": "FAC100-Limit: Walking Up 10 Stairs",
            "definition": "Functional Assessment of Chronic Illness Therapy-Dyspnea Scale 33 Item Bank - Functional Limitation: Considering your shortness of breath over the past 7 days, rate the amount of difficulty you had when doing the following activities: Walking up 10 stairs (1 flight) without stopping.",
            "identifier": "C155565",
            "notation": "FAC100-Limit: Walking Up 10 Stairs",
            "pref_label": "FACIT-Dyspnea Scale 33 Item Bank Version - Limit: Walking Up 10 Stairs",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C154450-C155565"
        },
        {
            "alt_label": "FAC100-Limit: Walking Up 30 Stairs",
            "definition": "Functional Assessment of Chronic Illness Therapy-Dyspnea Scale 33 Item Bank - Functional Limitation: Considering your shortness of breath over the past 7 days, rate the amount of difficulty you had when doing the following activities: Walking up 30 stairs (3 flights) without stopping.",
            "identifier": "C155566",
            "notation": "FAC100-Limit: Walking Up 30 Stairs",
            "pref_label": "FACIT-Dyspnea Scale 33 Item Bank Version - Limit: Walking Up 30 Stairs",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C154450-C155566"
        },
        {
            "alt_label": "FAC100-Limit: Walking Up 5 Stairs",
            "definition": "Functional Assessment of Chronic Illness Therapy-Dyspnea Scale 33 Item Bank - Functional Limitation: Considering your shortness of breath over the past 7 days, rate the amount of difficulty you had when doing the following activities: Walking up 5 stairs without stopping.",
            "identifier": "C155564",
            "notation": "FAC100-Limit: Walking Up 5 Stairs",
            "pref_label": "FACIT-Dyspnea Scale 33 Item Bank Version - Limit: Walking Up 5 Stairs",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C154450-C155564"
        },
        {
            "alt_label": "FAC100-Limit: Washing Dishes",
            "definition": "Functional Assessment of Chronic Illness Therapy-Dyspnea Scale 33 Item Bank - Functional Limitation: Considering your shortness of breath over the past 7 days, rate the amount of difficulty you had when doing the following activities: Washing dishes.",
            "identifier": "C155552",
            "notation": "FAC100-Limit: Washing Dishes",
            "pref_label": "FACIT-Dyspnea Scale 33 Item Bank Version - Limit: Washing Dishes",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C154450-C155552"
        },
        {
            "alt_label": "FAC100-Sev: Bath Without Help Why Not",
            "definition": "Functional Assessment of Chronic Illness Therapy-Dyspnea Scale 33 Item Bank - Dyspnea Severity: Over the past 7 days, how short of breath did you get with each of these activities?: Taking a bath without help. Please indicate why you did not do this in the past 7 days.",
            "identifier": "C155503",
            "notation": "FAC100-Sev: Bath Without Help Why Not",
            "pref_label": "FACIT-Dyspnea Scale 33 Item Bank Version - Severity: Bath Without Help Why Not",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C154450-C155503"
        },
        {
            "alt_label": "FAC100-Sev: Bath Without Help",
            "definition": "Functional Assessment of Chronic Illness Therapy-Dyspnea Scale 33 Item Bank - Dyspnea Severity: Over the past 7 days, how short of breath did you get with each of these activities?: Taking a bath without help.",
            "identifier": "C155502",
            "notation": "FAC100-Sev: Bath Without Help",
            "pref_label": "FACIT-Dyspnea Scale 33 Item Bank Version - Severity: Bath Without Help",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C154450-C155502"
        },
        {
            "alt_label": "FAC100-Sev: Carry 10-20 Lbs Why Not",
            "definition": "Functional Assessment of Chronic Illness Therapy-Dyspnea Scale 33 Item Bank - Dyspnea Severity: Over the past 7 days, how short of breath did you get with each of these activities?: Carrying something weighing 10-20 lbs (about 4.5-9kg, like a large bag of groceries) from one room to another. Please indicate why you did not do this in the past 7 days.",
            "identifier": "C155499",
            "notation": "FAC100-Sev: Carry 10-20 Lbs Why Not",
            "pref_label": "FACIT-Dyspnea Scale 33 Item Bank Version - Severity: Carry 10-20 Lbs Why Not",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C154450-C155499"
        },
        {
            "alt_label": "FAC100-Sev: Carry 10-20 Lbs",
            "definition": "Functional Assessment of Chronic Illness Therapy-Dyspnea Scale 33 Item Bank - Dyspnea Severity: Over the past 7 days, how short of breath did you get with each of these activities?: Carrying something weighing 10-20 lbs (about 4.5-9kg, like a large bag of groceries) from one room to another.",
            "identifier": "C155498",
            "notation": "FAC100-Sev: Carry 10-20 Lbs",
            "pref_label": "FACIT-Dyspnea Scale 33 Item Bank Version - Severity: Carry 10-20 Lbs",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C154450-C155498"
        },
        {
            "alt_label": "FAC100-Sev: Carrying 5-10 Lbs Why Not",
            "definition": "Functional Assessment of Chronic Illness Therapy-Dyspnea Scale 33 Item Bank - Dyspnea Severity: Over the past 7 days, how short of breath did you get with each of these activities?: Carrying something weighing 5-10 lbs (about 2-4.5 kg, like a basket of clothes) from one room to another. Please indicate why you did not do this in the past 7 days.",
            "identifier": "C155529",
            "notation": "FAC100-Sev: Carrying 5-10 Lbs Why Not",
            "pref_label": "FACIT-Dyspnea Scale 33 Item Bank Version - Severity: Carrying 5-10 Lbs Why Not",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C154450-C155529"
        },
        {
            "alt_label": "FAC100-Sev: Carrying 5-10 Lbs",
            "definition": "Functional Assessment of Chronic Illness Therapy-Dyspnea Scale 33 Item Bank - Dyspnea Severity: Over the past 7 days, how short of breath did you get with each of these activities?: Carrying something weighing 5-10 lbs (about 2-4.5 kg, like a basket of clothes) from one room to another.",
            "identifier": "C155528",
            "notation": "FAC100-Sev: Carrying 5-10 Lbs",
            "pref_label": "FACIT-Dyspnea Scale 33 Item Bank Version - Severity: Carrying 5-10 Lbs",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C154450-C155528"
        },
        {
            "alt_label": "FAC100-Sev: Carrying Less Than 5 Lbs",
            "definition": "Functional Assessment of Chronic Illness Therapy-Dyspnea Scale 33 Item Bank - Dyspnea Severity: Over the past 7 days, how short of breath did you get with each of these activities?: Carrying something weighing less than 5 lbs (about 2 kg, like a houseplant) from one room to another.",
            "identifier": "C155526",
            "notation": "FAC100-Sev: Carrying Less Than 5 Lbs",
            "pref_label": "FACIT-Dyspnea Scale 33 Item Bank Version - Severity: Carrying Less Than 5 Lbs",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C154450-C155526"
        },
        {
            "alt_label": "FAC100-Sev: Carrying Less Than 5 Why Not",
            "definition": "Functional Assessment of Chronic Illness Therapy-Dyspnea Scale 33 Item Bank - Dyspnea Severity: Over the past 7 days, how short of breath did you get with each of these activities?: Carrying something weighing less than 5 lbs (about 2 kg, like a houseplant) from one room to another. Please indicate why you did not do this in the past 7 days.",
            "identifier": "C155527",
            "notation": "FAC100-Sev: Carrying Less Than 5 Why Not",
            "pref_label": "FACIT-Dyspnea Scale 33 Item Bank Version - Severity: Carrying Less Than 5 Why Not",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C154450-C155527"
        },
        {
            "alt_label": "FAC100-Sev: Dining Out Why Not",
            "definition": "Functional Assessment of Chronic Illness Therapy-Dyspnea Scale 33 Item Bank - Dyspnea Severity: Over the past 7 days, how short of breath did you get with each of these activities?: Dining out. Please indicate why you did not do this in the past 7 days.",
            "identifier": "C155533",
            "notation": "FAC100-Sev: Dining Out Why Not",
            "pref_label": "FACIT-Dyspnea Scale 33 Item Bank Version - Severity: Dining Out Why Not",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C154450-C155533"
        },
        {
            "alt_label": "FAC100-Sev: Dining Out",
            "definition": "Functional Assessment of Chronic Illness Therapy-Dyspnea Scale 33 Item Bank - Dyspnea Severity: Over the past 7 days, how short of breath did you get with each of these activities?: Dining out.",
            "identifier": "C155532",
            "notation": "FAC100-Sev: Dining Out",
            "pref_label": "FACIT-Dyspnea Scale 33 Item Bank Version - Severity: Dining Out",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C154450-C155532"
        },
        {
            "alt_label": "FAC100-Sev: Dressing Why Not",
            "definition": "Functional Assessment of Chronic Illness Therapy-Dyspnea Scale 33 Item Bank - Dyspnea Severity: Over the past 7 days, how short of breath did you get with each of these activities?: Dressing yourself without help. Please indicate why you did not do this in the past 7 days.",
            "identifier": "C155483",
            "notation": "FAC100-Sev: Dressing Why Not",
            "pref_label": "FACIT-Dyspnea Scale 33 Item Bank Version - Severity: Dressing Why Not",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C154450-C155483"
        },
        {
            "alt_label": "FAC100-Sev: Dressing Without Help",
            "definition": "Functional Assessment of Chronic Illness Therapy-Dyspnea Scale 33 Item Bank - Dyspnea Severity: Over the past 7 days, how short of breath did you get with each of these activities?: Dressing yourself without help.",
            "identifier": "C155482",
            "notation": "FAC100-Sev: Dressing Without Help",
            "pref_label": "FACIT-Dyspnea Scale 33 Item Bank Version - Severity: Dressing Without Help",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C154450-C155482"
        },
        {
            "alt_label": "FAC100-Sev: Get In/Out of a Car Why Not",
            "definition": "Functional Assessment of Chronic Illness Therapy-Dyspnea Scale 33 Item Bank - Dyspnea Severity: Over the past 7 days, how short of breath did you get with each of these activities?: Getting in or out of a car. Please indicate why you did not do this in the past 7 days.",
            "identifier": "C155531",
            "notation": "FAC100-Sev: Get In/Out of a Car Why Not",
            "pref_label": "FACIT-Dyspnea Scale 33 Item Bank Version - Severity: Get In/Out of a Car Why Not",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C154450-C155531"
        },
        {
            "alt_label": "FAC100-Sev: Get In/Out of a Car",
            "definition": "Functional Assessment of Chronic Illness Therapy-Dyspnea Scale 33 Item Bank - Dyspnea Severity: Over the past 7 days, how short of breath did you get with each of these activities?: Getting in or out of a car.",
            "identifier": "C155530",
            "notation": "FAC100-Sev: Get In/Out of a Car",
            "pref_label": "FACIT-Dyspnea Scale 33 Item Bank Version - Severity: Get In/Out of a Car",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C154450-C155530"
        },
        {
            "alt_label": "FAC100-Sev: Lift Less Than 5 Lbs Why Not",
            "definition": "Functional Assessment of Chronic Illness Therapy-Dyspnea Scale 33 Item Bank - Dyspnea Severity: Over the past 7 days, how short of breath did you get with each of these activities?: Lifting something weighing less than 5 lbs (about 2 kg, like a houseplant). Please indicate why you did not do this in the past 7 days.",
            "identifier": "C155521",
            "notation": "FAC100-Sev: Lift Less Than 5 Lbs Why Not",
            "pref_label": "FACIT-Dyspnea Scale 33 Item Bank Version - Severity: Lift Less Than 5 Lbs Why Not",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C154450-C155521"
        },
        {
            "alt_label": "FAC100-Sev: Lift Less Than 5 Lbs",
            "definition": "Functional Assessment of Chronic Illness Therapy-Dyspnea Scale 33 Item Bank - Dyspnea Severity: Over the past 7 days, how short of breath did you get with each of these activities?: Lifting something weighing less than 5 lbs (about 2 kg, like a houseplant).",
            "identifier": "C155520",
            "notation": "FAC100-Sev: Lift Less Than 5 Lbs",
            "pref_label": "FACIT-Dyspnea Scale 33 Item Bank Version - Severity: Lift Less Than 5 Lbs",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C154450-C155520"
        },
        {
            "alt_label": "FAC100-Sev: Lift More Than 20 Lb Why Not",
            "definition": "Functional Assessment of Chronic Illness Therapy-Dyspnea Scale 33 Item Bank - Dyspnea Severity: Over the past 7 days, how short of breath did you get with each of these activities?: Lifting something weighing more than 20 lbs (about 9 kg, like a medium-sized suitcase). Please indicate why you did not do this in the past 7 days.",
            "identifier": "C155525",
            "notation": "FAC100-Sev: Lift More Than 20 Lb Why Not",
            "pref_label": "FACIT-Dyspnea Scale 33 Item Bank Version - Severity: Lift More Than 20 Lbs Why Not",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C154450-C155525"
        },
        {
            "alt_label": "FAC100-Sev: Lift More Than 20 Lbs",
            "definition": "Functional Assessment of Chronic Illness Therapy-Dyspnea Scale 33 Item Bank - Dyspnea Severity: Over the past 7 days, how short of breath did you get with each of these activities?: Lifting something weighing more than 20 lbs (about 9 kg, like a medium-sized suitcase).",
            "identifier": "C155524",
            "notation": "FAC100-Sev: Lift More Than 20 Lbs",
            "pref_label": "FACIT-Dyspnea Scale 33 Item Bank Version - Severity: Lift More Than 20 Lbs",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C154450-C155524"
        },
        {
            "alt_label": "FAC100-Sev: Lifting 10-20 Lbs Why Not",
            "definition": "Functional Assessment of Chronic Illness Therapy-Dyspnea Scale 33 Item Bank - Dyspnea Severity: Over the past 7 days, how short of breath did you get with each of these activities?: Lifting something weighing 10-20 lbs (about 4.5-9kg, like a large bag of groceries). Please indicate why you did not do this in the past 7 days.",
            "identifier": "C155497",
            "notation": "FAC100-Sev: Lifting 10-20 Lbs Why Not",
            "pref_label": "FACIT-Dyspnea Scale 33 Item Bank Version - Severity: Lifting 10-20 Lbs Why Not",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C154450-C155497"
        },
        {
            "alt_label": "FAC100-Sev: Lifting 10-20 Lbs",
            "definition": "Functional Assessment of Chronic Illness Therapy-Dyspnea Scale 33 Item Bank - Dyspnea Severity: Over the past 7 days, how short of breath did you get with each of these activities?: Lifting something weighing 10-20 lbs (about 4.5-9kg, like a large bag of groceries).",
            "identifier": "C155496",
            "notation": "FAC100-Sev: Lifting 10-20 Lbs",
            "pref_label": "FACIT-Dyspnea Scale 33 Item Bank Version - Severity: Lifting 10-20 Lbs",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C154450-C155496"
        },
        {
            "alt_label": "FAC100-Sev: Lifting 5-10 Lbs Why Not",
            "definition": "Functional Assessment of Chronic Illness Therapy-Dyspnea Scale 33 Item Bank - Dyspnea Severity: Over the past 7 days, how short of breath did you get with each of these activities?: Lifting something weighing 5-10 lbs (about 2-4.5 kg, like a basket of clothes). Please indicate why you did not do this in the past 7 days.",
            "identifier": "C155523",
            "notation": "FAC100-Sev: Lifting 5-10 Lbs Why Not",
            "pref_label": "FACIT-Dyspnea Scale 33 Item Bank Version - Severity: Lifting 5-10 Lbs Why Not",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C154450-C155523"
        },
        {
            "alt_label": "FAC100-Sev: Lifting 5-10 Lbs",
            "definition": "Functional Assessment of Chronic Illness Therapy-Dyspnea Scale 33 Item Bank - Dyspnea Severity: Over the past 7 days, how short of breath did you get with each of these activities?: Lifting something weighing 5-10 lbs (about 2-4.5 kg, like a basket of clothes).",
            "identifier": "C155522",
            "notation": "FAC100-Sev: Lifting 5-10 Lbs",
            "pref_label": "FACIT-Dyspnea Scale 33 Item Bank Version - Severity: Lifting 5-10 Lbs",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C154450-C155522"
        },
        {
            "alt_label": "FAC100-Sev: Low-intensity Activ Why Not",
            "definition": "Functional Assessment of Chronic Illness Therapy-Dyspnea Scale 33 Item Bank - Dyspnea Severity: Over the past 7 days, how short of breath did you get with each of these activities?: Low-intensity leisure activity (gardening, etc.). Please indicate why you did not do this in the past 7 days.",
            "identifier": "C155535",
            "notation": "FAC100-Sev: Low-intensity Activ Why Not",
            "pref_label": "FACIT-Dyspnea Scale 33 Item Bank Version - Severity: Low-intensity Activity Why Not",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C154450-C155535"
        },
        {
            "alt_label": "FAC100-Sev: Low-intensity Activ",
            "definition": "Functional Assessment of Chronic Illness Therapy-Dyspnea Scale 33 Item Bank - Dyspnea Severity: Over the past 7 days, how short of breath did you get with each of these activities?: Low-intensity leisure activity (gardening, etc.).",
            "identifier": "C155534",
            "notation": "FAC100-Sev: Low-intensity Activ",
            "pref_label": "FACIT-Dyspnea Scale 33 Item Bank Version - Severity: Low-intensity Activity",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C154450-C155534"
        },
        {
            "alt_label": "FAC100-Sev: Making a Bed Why Not",
            "definition": "Functional Assessment of Chronic Illness Therapy-Dyspnea Scale 33 Item Bank - Dyspnea Severity: Over the past 7 days, how short of breath did you get with each of these activities?: Making a bed. Please indicate why you did not do this in the past 7 days.",
            "identifier": "C155495",
            "notation": "FAC100-Sev: Making a Bed Why Not",
            "pref_label": "FACIT-Dyspnea Scale 33 Item Bank Version - Severity: Making a Bed Why Not",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C154450-C155495"
        },
        {
            "alt_label": "FAC100-Sev: Making a Bed",
            "definition": "Functional Assessment of Chronic Illness Therapy-Dyspnea Scale 33 Item Bank - Dyspnea Severity: Over the past 7 days, how short of breath did you get with each of these activities?: Making a bed.",
            "identifier": "C155494",
            "notation": "FAC100-Sev: Making a Bed",
            "pref_label": "FACIT-Dyspnea Scale 33 Item Bank Version - Severity: Making a Bed",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C154450-C155494"
        },
        {
            "alt_label": "FAC100-Sev: Moderate Activity Why Not",
            "definition": "Functional Assessment of Chronic Illness Therapy-Dyspnea Scale 33 Item Bank - Dyspnea Severity: Over the past 7 days, how short of breath did you get with each of these activities?: Moderate-intensity leisure activity (bicycling on level terrain, etc.). Please indicate why you did not do this in the past 7 days.",
            "identifier": "C155537",
            "notation": "FAC100-Sev: Moderate Activity Why Not",
            "pref_label": "FACIT-Dyspnea Scale 33 Item Bank Version - Severity: Moderate Activity Why Not",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C154450-C155537"
        },
        {
            "alt_label": "FAC100-Sev: Moderate Activity",
            "definition": "Functional Assessment of Chronic Illness Therapy-Dyspnea Scale 33 Item Bank - Dyspnea Severity: Over the past 7 days, how short of breath did you get with each of these activities?: Moderate-intensity leisure activity (bicycling on level terrain, etc.).",
            "identifier": "C155536",
            "notation": "FAC100-Sev: Moderate Activity",
            "pref_label": "FACIT-Dyspnea Scale 33 Item Bank Version - Severity: Moderate Activity",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C154450-C155536"
        },
        {
            "alt_label": "FAC100-Sev: Preparing Meals Why Not",
            "definition": "Functional Assessment of Chronic Illness Therapy-Dyspnea Scale 33 Item Bank - Dyspnea Severity: Over the past 7 days, how short of breath did you get with each of these activities?: Preparing meals. Please indicate why you did not do this in the past 7 days.",
            "identifier": "C155489",
            "notation": "FAC100-Sev: Preparing Meals Why Not",
            "pref_label": "FACIT-Dyspnea Scale 33 Item Bank Version - Severity: Preparing Meals Why Not",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C154450-C155489"
        },
        {
            "alt_label": "FAC100-Sev: Preparing Meals",
            "definition": "Functional Assessment of Chronic Illness Therapy-Dyspnea Scale 33 Item Bank - Dyspnea Severity: Over the past 7 days, how short of breath did you get with each of these activities?: Preparing meals.",
            "identifier": "C155488",
            "notation": "FAC100-Sev: Preparing Meals",
            "pref_label": "FACIT-Dyspnea Scale 33 Item Bank Version - Severity: Preparing Meals",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C154450-C155488"
        },
        {
            "alt_label": "FAC100-Sev: Putting on Socks Why Not",
            "definition": "Functional Assessment of Chronic Illness Therapy-Dyspnea Scale 33 Item Bank - Dyspnea Severity: Over the past 7 days, how short of breath did you get with each of these activities?: Putting on socks or stockings. Please indicate why you did not do this in the past 7 days.",
            "identifier": "C155507",
            "notation": "FAC100-Sev: Putting on Socks Why Not",
            "pref_label": "FACIT-Dyspnea Scale 33 Item Bank Version - Severity: Putting on Socks Why Not",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C154450-C155507"
        },
        {
            "alt_label": "FAC100-Sev: Putting on Socks",
            "definition": "Functional Assessment of Chronic Illness Therapy-Dyspnea Scale 33 Item Bank - Dyspnea Severity: Over the past 7 days, how short of breath did you get with each of these activities?: Putting on socks or stockings.",
            "identifier": "C155506",
            "notation": "FAC100-Sev: Putting on Socks",
            "pref_label": "FACIT-Dyspnea Scale 33 Item Bank Version - Severity: Putting on Socks",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C154450-C155506"
        },
        {
            "alt_label": "FAC100-Sev: Scrubbing the Floor Why Not",
            "definition": "Functional Assessment of Chronic Illness Therapy-Dyspnea Scale 33 Item Bank - Dyspnea Severity: Over the past 7 days, how short of breath did you get with each of these activities?: Scrubbing the floor or counter. Please indicate why you did not do this in the past 7 days.",
            "identifier": "C155547",
            "notation": "FAC100-Sev: Scrubbing the Floor Why Not",
            "pref_label": "FACIT-Dyspnea Scale 33 Item Bank Version - Severity: Scrubbing the Floor Why Not",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C154450-C155547"
        },
        {
            "alt_label": "FAC100-Sev: Scrubbing the Floor",
            "definition": "Functional Assessment of Chronic Illness Therapy-Dyspnea Scale 33 Item Bank - Dyspnea Severity: Over the past 7 days, how short of breath did you get with each of these activities?: Scrubbing the floor or counter.",
            "identifier": "C155546",
            "notation": "FAC100-Sev: Scrubbing the Floor",
            "pref_label": "FACIT-Dyspnea Scale 33 Item Bank Version - Severity: Scrubbing the Floor",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C154450-C155546"
        },
        {
            "alt_label": "FAC100-Sev: Singing or Humming Why Not",
            "definition": "Functional Assessment of Chronic Illness Therapy-Dyspnea Scale 33 Item Bank - Dyspnea Severity: Over the past 7 days, how short of breath did you get with each of these activities?: Singing or humming. Please indicate why you did not do this in the past 7 days.",
            "identifier": "C155543",
            "notation": "FAC100-Sev: Singing or Humming Why Not",
            "pref_label": "FACIT-Dyspnea Scale 33 Item Bank Version - Severity: Singing or Humming Why Not",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C154450-C155543"
        },
        {
            "alt_label": "FAC100-Sev: Singing or Humming",
            "definition": "Functional Assessment of Chronic Illness Therapy-Dyspnea Scale 33 Item Bank - Dyspnea Severity: Over the past 7 days, how short of breath did you get with each of these activities?: Singing or humming.",
            "identifier": "C155542",
            "notation": "FAC100-Sev: Singing or Humming",
            "pref_label": "FACIT-Dyspnea Scale 33 Item Bank Version - Severity: Singing or Humming",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C154450-C155542"
        },
        {
            "alt_label": "FAC100-Sev: Standing 5 Minutes Why Not",
            "definition": "Functional Assessment of Chronic Illness Therapy-Dyspnea Scale 33 Item Bank - Dyspnea Severity: Over the past 7 days, how short of breath did you get with each of these activities?: Standing for at least 5 minutes. Please indicate why you did not do this in the past 7 days.",
            "identifier": "C155509",
            "notation": "FAC100-Sev: Standing 5 Minutes Why Not",
            "pref_label": "FACIT-Dyspnea Scale 33 Item Bank Version - Severity: Standing 5 Minutes Why Not",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C154450-C155509"
        },
        {
            "alt_label": "FAC100-Sev: Standing 5 Minutes",
            "definition": "Functional Assessment of Chronic Illness Therapy-Dyspnea Scale 33 Item Bank - Dyspnea Severity: Over the past 7 days, how short of breath did you get with each of these activities?: Standing for at least 5 minutes.",
            "identifier": "C155508",
            "notation": "FAC100-Sev: Standing 5 Minutes",
            "pref_label": "FACIT-Dyspnea Scale 33 Item Bank Version - Severity: Standing 5 Minutes",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C154450-C155508"
        },
        {
            "alt_label": "FAC100-Sev: Sweeping/Mopping Why Not",
            "definition": "Functional Assessment of Chronic Illness Therapy-Dyspnea Scale 33 Item Bank - Dyspnea Severity: Over the past 7 days, how short of breath did you get with each of these activities?: Sweeping or mopping. Please indicate why you did not do this in the past 7 days.",
            "identifier": "C155493",
            "notation": "FAC100-Sev: Sweeping/Mopping Why Not",
            "pref_label": "FACIT-Dyspnea Scale 33 Item Bank Version - Severity: Sweeping/Mopping Why Not",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C154450-C155493"
        },
        {
            "alt_label": "FAC100-Sev: Sweeping/Mopping",
            "definition": "Functional Assessment of Chronic Illness Therapy-Dyspnea Scale 33 Item Bank - Dyspnea Severity: Over the past 7 days, how short of breath did you get with each of these activities?: Sweeping or mopping.",
            "identifier": "C155492",
            "notation": "FAC100-Sev: Sweeping/Mopping",
            "pref_label": "FACIT-Dyspnea Scale 33 Item Bank Version - Severity: Sweeping/Mopping",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C154450-C155492"
        },
        {
            "alt_label": "FAC100-Sev: Taking a Shower Why Not",
            "definition": "Functional Assessment of Chronic Illness Therapy-Dyspnea Scale 33 Item Bank - Dyspnea Severity: Over the past 7 days, how short of breath did you get with each of these activities?: Taking a shower. Please indicate why you did not do this in the past 7 days.",
            "identifier": "C155505",
            "notation": "FAC100-Sev: Taking a Shower Why Not",
            "pref_label": "FACIT-Dyspnea Scale 33 Item Bank Version - Severity: Taking a Shower Why Not",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C154450-C155505"
        },
        {
            "alt_label": "FAC100-Sev: Taking a Shower",
            "definition": "Functional Assessment of Chronic Illness Therapy-Dyspnea Scale 33 Item Bank - Dyspnea Severity: Over the past 7 days, how short of breath did you get with each of these activities?: Taking a shower.",
            "identifier": "C155504",
            "notation": "FAC100-Sev: Taking a Shower",
            "pref_label": "FACIT-Dyspnea Scale 33 Item Bank Version - Severity: Taking a Shower",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C154450-C155504"
        },
        {
            "alt_label": "FAC100-Sev: Talking While Walk Why Not",
            "definition": "Functional Assessment of Chronic Illness Therapy-Dyspnea Scale 33 Item Bank - Dyspnea Severity: Over the past 7 days, how short of breath did you get with each of these activities?: Talking while walking. Please indicate why you did not do this in the past 7 days.",
            "identifier": "C155545",
            "notation": "FAC100-Sev: Talking While Walk Why Not",
            "pref_label": "FACIT-Dyspnea Scale 33 Item Bank Version - Severity: Talking While Walk Why Not",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C154450-C155545"
        },
        {
            "alt_label": "FAC100-Sev: Talking While Walking",
            "definition": "Functional Assessment of Chronic Illness Therapy-Dyspnea Scale 33 Item Bank - Dyspnea Severity: Over the past 7 days, how short of breath did you get with each of these activities?: Talking while walking.",
            "identifier": "C155544",
            "notation": "FAC100-Sev: Talking While Walking",
            "pref_label": "FACIT-Dyspnea Scale 33 Item Bank Version - Severity: Talking While Walking",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C154450-C155544"
        },
        {
            "alt_label": "FAC100-Sev: Walk 50 Steps Why Not",
            "definition": "Functional Assessment of Chronic Illness Therapy-Dyspnea Scale 33 Item Bank - Dyspnea Severity: Over the past 7 days, how short of breath did you get with each of these activities?: Walking 50 steps/paces on flat ground at a normal speed without stopping. Please indicate why you did not do this in the past 7 days.",
            "identifier": "C155485",
            "notation": "FAC100-Sev: Walk 50 Steps Why Not",
            "pref_label": "FACIT-Dyspnea Scale 33 Item Bank Version - Severity: Walk 50 Steps Why Not",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C154450-C155485"
        },
        {
            "alt_label": "FAC100-Sev: Walk 50 Steps",
            "definition": "Functional Assessment of Chronic Illness Therapy-Dyspnea Scale 33 Item Bank - Dyspnea Severity: Over the past 7 days, how short of breath did you get with each of these activities?: Walking 50 steps/paces on flat ground at a normal speed without stopping.",
            "identifier": "C155484",
            "notation": "FAC100-Sev: Walk 50 Steps",
            "pref_label": "FACIT-Dyspnea Scale 33 Item Bank Version - Severity: Walk 50 Steps",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C154450-C155484"
        },
        {
            "alt_label": "FAC100-Sev: Walk Fast 50 Steps Why Not",
            "definition": "Functional Assessment of Chronic Illness Therapy-Dyspnea Scale 33 Item Bank - Dyspnea Severity: Over the past 7 days, how short of breath did you get with each of these activities?: Walking (faster than your usual speed) for 50 steps without stopping. Please indicate why you did not do this in the past 7 days.",
            "identifier": "C155539",
            "notation": "FAC100-Sev: Walk Fast 50 Steps Why Not",
            "pref_label": "FACIT-Dyspnea Scale 33 Item Bank Version - Severity: Walk Fast 50 Steps Why Not",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C154450-C155539"
        },
        {
            "alt_label": "FAC100-Sev: Walk Fast 50 Steps",
            "definition": "Functional Assessment of Chronic Illness Therapy-Dyspnea Scale 33 Item Bank - Dyspnea Severity: Over the past 7 days, how short of breath did you get with each of these activities?: Walking (faster than your usual speed) for 50 steps without stopping.",
            "identifier": "C155538",
            "notation": "FAC100-Sev: Walk Fast 50 Steps",
            "pref_label": "FACIT-Dyspnea Scale 33 Item Bank Version - Severity: Walk Fast 50 Steps",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C154450-C155538"
        },
        {
            "alt_label": "FAC100-Sev: Walk for 1/2 Mile Why Not",
            "definition": "Functional Assessment of Chronic Illness Therapy-Dyspnea Scale 33 Item Bank - Dyspnea Severity: Over the past 7 days, how short of breath did you get with each of these activities?: Walking (faster than your usual speed) for 1/2 mile (almost 1 km) without stopping. Please indicate why you did not do this in the past 7 days.",
            "identifier": "C155501",
            "notation": "FAC100-Sev: Walk for 1/2 Mile Why Not",
            "pref_label": "FACIT-Dyspnea Scale 33 Item Bank Version - Severity: Walk for 1/2 Mile Why Not",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C154450-C155501"
        },
        {
            "alt_label": "FAC100-Sev: Walk for 1/2 Mile",
            "definition": "Functional Assessment of Chronic Illness Therapy-Dyspnea Scale 33 Item Bank - Dyspnea Severity: Over the past 7 days, how short of breath did you get with each of these activities?: Walking (faster than your usual speed) for 1/2 mile (almost 1 km) without stopping.",
            "identifier": "C155500",
            "notation": "FAC100-Sev: Walk for 1/2 Mile",
            "pref_label": "FACIT-Dyspnea Scale 33 Item Bank Version - Severity: Walk for 1/2 Mile",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C154450-C155500"
        },
        {
            "alt_label": "FAC100-Sev: Walk Up 20 Stairs Why Not",
            "definition": "Functional Assessment of Chronic Illness Therapy-Dyspnea Scale 33 Item Bank - Dyspnea Severity: Over the past 7 days, how short of breath did you get with each of these activities?: Walking up 20 stairs (2 flights) without stopping. Please indicate why you did not do this in the past 7 days.",
            "identifier": "C155487",
            "notation": "FAC100-Sev: Walk Up 20 Stairs Why Not",
            "pref_label": "FACIT-Dyspnea Scale 33 Item Bank Version - Severity: Walk Up 20 Stairs Why Not",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C154450-C155487"
        },
        {
            "alt_label": "FAC100-Sev: Walk Up 20 Stairs",
            "definition": "Functional Assessment of Chronic Illness Therapy-Dyspnea Scale 33 Item Bank - Dyspnea Severity: Over the past 7 days, how short of breath did you get with each of these activities?: Walking up 20 stairs (2 flights) without stopping.",
            "identifier": "C155486",
            "notation": "FAC100-Sev: Walk Up 20 Stairs",
            "pref_label": "FACIT-Dyspnea Scale 33 Item Bank Version - Severity: Walk Up 20 Stairs",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C154450-C155486"
        },
        {
            "alt_label": "FAC100-Sev: Walking 1/2 Mile Why Not",
            "definition": "Functional Assessment of Chronic Illness Therapy-Dyspnea Scale 33 Item Bank - Dyspnea Severity: Over the past 7 days, how short of breath did you get with each of these activities?: Walking 1/2 mile (almost 1 km) on flat ground at a normal speed without stopping. Please indicate why you did not do this in the past 7 days.",
            "identifier": "C155513",
            "notation": "FAC100-Sev: Walking 1/2 Mile Why Not",
            "pref_label": "FACIT-Dyspnea Scale 33 Item Bank Version - Severity: Walking 1/2 Mile Why Not",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C154450-C155513"
        },
        {
            "alt_label": "FAC100-Sev: Walking 1/2 Mile",
            "definition": "Functional Assessment of Chronic Illness Therapy-Dyspnea Scale 33 Item Bank - Dyspnea Severity: Over the past 7 days, how short of breath did you get with each of these activities?: Walking 1/2 mile (almost 1 km) on flat ground at a normal speed without stopping.",
            "identifier": "C155512",
            "notation": "FAC100-Sev: Walking 1/2 Mile",
            "pref_label": "FACIT-Dyspnea Scale 33 Item Bank Version - Severity: Walking 1/2 Mile",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C154450-C155512"
        },
        {
            "alt_label": "FAC100-Sev: Walking 10 Steps Why Not",
            "definition": "Functional Assessment of Chronic Illness Therapy-Dyspnea Scale 33 Item Bank - Dyspnea Severity: Over the past 7 days, how short of breath did you get with each of these activities?: Walking 10 steps/paces on flat ground at a normal speed without stopping. Please indicate why you did not do this in the past 7 days.",
            "identifier": "C155511",
            "notation": "FAC100-Sev: Walking 10 Steps Why Not",
            "pref_label": "FACIT-Dyspnea Scale 33 Item Bank Version - Severity: Walking 10 Steps Why Not",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C154450-C155511"
        },
        {
            "alt_label": "FAC100-Sev: Walking 10 Steps",
            "definition": "Functional Assessment of Chronic Illness Therapy-Dyspnea Scale 33 Item Bank - Dyspnea Severity: Over the past 7 days, how short of breath did you get with each of these activities?: Walking 10 steps/paces on flat ground at a normal speed without stopping.",
            "identifier": "C155510",
            "notation": "FAC100-Sev: Walking 10 Steps",
            "pref_label": "FACIT-Dyspnea Scale 33 Item Bank Version - Severity: Walking 10 Steps",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C154450-C155510"
        },
        {
            "alt_label": "FAC100-Sev: Walking Fast 1 Mile Why Not",
            "definition": "Functional Assessment of Chronic Illness Therapy-Dyspnea Scale 33 Item Bank - Dyspnea Severity: Over the past 7 days, how short of breath did you get with each of these activities?: Walking (faster than your usual speed) for at least 1 mile ( a little more than 1.5 km) without stopping. Please indicate why you did not do this in the past 7 days.",
            "identifier": "C155541",
            "notation": "FAC100-Sev: Walking Fast 1 Mile Why Not",
            "pref_label": "FACIT-Dyspnea Scale 33 Item Bank Version - Severity: Walking Fast 1 Mile Why Not",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C154450-C155541"
        },
        {
            "alt_label": "FAC100-Sev: Walking Fast 1 Mile",
            "definition": "Functional Assessment of Chronic Illness Therapy-Dyspnea Scale 33 Item Bank - Dyspnea Severity: Over the past 7 days, how short of breath did you get with each of these activities?: Walking (faster than your usual speed) for at least 1 mile ( a little more than 1.5 km) without stopping.",
            "identifier": "C155540",
            "notation": "FAC100-Sev: Walking Fast 1 Mile",
            "pref_label": "FACIT-Dyspnea Scale 33 Item Bank Version - Severity: Walking Fast 1 Mile",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C154450-C155540"
        },
        {
            "alt_label": "FAC100-Sev: Walking Up 10 Stairs Why Not",
            "definition": "Functional Assessment of Chronic Illness Therapy-Dyspnea Scale 33 Item Bank - Dyspnea Severity: Over the past 7 days, how short of breath did you get with each of these activities?: Walking up 10 stairs (1 flight) without stopping. Please indicate why you did not do this in the past 7 days.",
            "identifier": "C155517",
            "notation": "FAC100-Sev: Walking Up 10 Stairs Why Not",
            "pref_label": "FACIT-Dyspnea Scale 33 Item Bank Version - Severity: Walking Up 10 Stairs Why Not",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C154450-C155517"
        },
        {
            "alt_label": "FAC100-Sev: Walking Up 10 Stairs",
            "definition": "Functional Assessment of Chronic Illness Therapy-Dyspnea Scale 33 Item Bank - Dyspnea Severity: Over the past 7 days, how short of breath did you get with each of these activities?: Walking up 10 stairs (1 flight) without stopping.",
            "identifier": "C155516",
            "notation": "FAC100-Sev: Walking Up 10 Stairs",
            "pref_label": "FACIT-Dyspnea Scale 33 Item Bank Version - Severity: Walking Up 10 Stairs",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C154450-C155516"
        },
        {
            "alt_label": "FAC100-Sev: Walking Up 30 Stairs Why Not",
            "definition": "Functional Assessment of Chronic Illness Therapy-Dyspnea Scale 33 Item Bank - Dyspnea Severity: Over the past 7 days, how short of breath did you get with each of these activities?: Walking up 30 stairs (3 flights) without stopping. Please indicate why you did not do this in the past 7 days.",
            "identifier": "C155519",
            "notation": "FAC100-Sev: Walking Up 30 Stairs Why Not",
            "pref_label": "FACIT-Dyspnea Scale 33 Item Bank Version - Severity: Walking Up 30 Stairs Why Not",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C154450-C155519"
        },
        {
            "alt_label": "FAC100-Sev: Walking Up 30 Stairs",
            "definition": "Functional Assessment of Chronic Illness Therapy-Dyspnea Scale 33 Item Bank - Dyspnea Severity: Over the past 7 days, how short of breath did you get with each of these activities?: Walking up 30 stairs (3 flights) without stopping.",
            "identifier": "C155518",
            "notation": "FAC100-Sev: Walking Up 30 Stairs",
            "pref_label": "FACIT-Dyspnea Scale 33 Item Bank Version - Severity: Walking Up 30 Stairs",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C154450-C155518"
        },
        {
            "alt_label": "FAC100-Sev: Walking Up 5 Stairs Why Not",
            "definition": "Functional Assessment of Chronic Illness Therapy-Dyspnea Scale 33 Item Bank - Dyspnea Severity: Over the past 7 days, how short of breath did you get with each of these activities?: Walking up 5 stairs without stopping. Please indicate why you did not do this in the past 7 days.",
            "identifier": "C155515",
            "notation": "FAC100-Sev: Walking Up 5 Stairs Why Not",
            "pref_label": "FACIT-Dyspnea Scale 33 Item Bank Version - Severity: Walking Up 5 Stairs Why Not",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C154450-C155515"
        },
        {
            "alt_label": "FAC100-Sev: Walking Up 5 Stairs",
            "definition": "Functional Assessment of Chronic Illness Therapy-Dyspnea Scale 33 Item Bank - Dyspnea Severity: Over the past 7 days, how short of breath did you get with each of these activities?: Walking up 5 stairs without stopping.",
            "identifier": "C155514",
            "notation": "FAC100-Sev: Walking Up 5 Stairs",
            "pref_label": "FACIT-Dyspnea Scale 33 Item Bank Version - Severity: Walking Up 5 Stairs",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C154450-C155514"
        },
        {
            "alt_label": "FAC100-Sev: Washing Dishes Why Not",
            "definition": "Functional Assessment of Chronic Illness Therapy-Dyspnea Scale 33 Item Bank - Dyspnea Severity: Over the past 7 days, how short of breath did you get with each of these activities?: Washing dishes. Please indicate why you did not do this in the past 7 days.",
            "identifier": "C155491",
            "notation": "FAC100-Sev: Washing Dishes Why Not",
            "pref_label": "FACIT-Dyspnea Scale 33 Item Bank Version - Severity: Washing Dishes Why Not",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C154450-C155491"
        },
        {
            "alt_label": "FAC100-Sev: Washing Dishes",
            "definition": "Functional Assessment of Chronic Illness Therapy-Dyspnea Scale 33 Item Bank - Dyspnea Severity: Over the past 7 days, how short of breath did you get with each of these activities?: Washing dishes.",
            "identifier": "C155490",
            "notation": "FAC100-Sev: Washing Dishes",
            "pref_label": "FACIT-Dyspnea Scale 33 Item Bank Version - Severity: Washing Dishes",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C154450-C155490"
        }
    ]
}