{
    "SKOS_CONCEPT": [
        {
            "alt_label": "RSSS01-Advice You Really Want",
            "definition": "RAND Social Support Survey Instrument - How often is each of the following kinds of support available to you if you need it: Someone whose advice you really want.",
            "identifier": "C136219",
            "notation": "RSSS01-Advice You Really Want",
            "pref_label": "RAND Social Support Survey - Advice You Really Want",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C135699-C136219"
        },
        {
            "alt_label": "RSSS01-Confide in/Talk to About Yourself",
            "definition": "RAND Social Support Survey Instrument - How often is each of the following kinds of support available to you if you need it: Someone to confide in or talk to about yourself or your problems.",
            "identifier": "C136218",
            "notation": "RSSS01-Confide in/Talk to About Yourself",
            "pref_label": "RAND Social Support Survey - Confide in or Talk to About Yourself",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C135699-C136218"
        },
        {
            "alt_label": "RSSS01-Count on to Listen to You",
            "definition": "RAND Social Support Survey Instrument - How often is each of the following kinds of support available to you if you need it: Someone you can count on to listen to you when you need to talk.",
            "identifier": "C136215",
            "notation": "RSSS01-Count on to Listen to You",
            "pref_label": "RAND Social Support Survey - Count on to Listen to You",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C135699-C136215"
        },
        {
            "alt_label": "RSSS01-Do Something Enjoyable With",
            "definition": "RAND Social Support Survey Instrument - How often is each of the following kinds of support available to you if you need it: Someone to do something enjoyable with.",
            "identifier": "C136232",
            "notation": "RSSS01-Do Something Enjoyable With",
            "pref_label": "RAND Social Support Survey - Do Something Enjoyable With",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C135699-C136232"
        },
        {
            "alt_label": "RSSS01-Get Together With for Relaxation",
            "definition": "RAND Social Support Survey Instrument - How often is each of the following kinds of support available to you if you need it: Someone to get together with for relaxation.",
            "identifier": "C136231",
            "notation": "RSSS01-Get Together With for Relaxation",
            "pref_label": "RAND Social Support Survey - Get Together With for Relaxation",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C135699-C136231"
        },
        {
            "alt_label": "RSSS01-Give You Advice About a Crisis",
            "definition": "RAND Social Support Survey Instrument - How often is each of the following kinds of support available to you if you need it: Someone to give you good advice about a crisis.",
            "identifier": "C136217",
            "notation": "RSSS01-Give You Advice About a Crisis",
            "pref_label": "RAND Social Support Survey - Give You Advice About a Crisis",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C135699-C136217"
        },
        {
            "alt_label": "RSSS01-Give You Info to Help Understand",
            "definition": "RAND Social Support Survey Instrument - How often is each of the following kinds of support available to you if you need it: Someone to give you information to help you understand a situation.",
            "identifier": "C136216",
            "notation": "RSSS01-Give You Info to Help Understand",
            "pref_label": "RAND Social Support Survey - Give You Info to Help Understand",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C135699-C136216"
        },
        {
            "alt_label": "RSSS01-Have a Good Time With",
            "definition": "RAND Social Support Survey Instrument - How often is each of the following kinds of support available to you if you need it: Someone to have a good time with.",
            "identifier": "C136230",
            "notation": "RSSS01-Have a Good Time With",
            "pref_label": "RAND Social Support Survey - Have a Good Time With",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C135699-C136230"
        },
        {
            "alt_label": "RSSS01-Help If You Were Confined to Bed",
            "definition": "RAND Social Support Survey Instrument - How often is each of the following kinds of support available to you if you need it: Someone to help you if you were confined to bed.",
            "identifier": "C136223",
            "notation": "RSSS01-Help If You Were Confined to Bed",
            "pref_label": "RAND Social Support Survey - Help If You Were Confined to Bed",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C135699-C136223"
        },
        {
            "alt_label": "RSSS01-Help With Daily Chores If Sick",
            "definition": "RAND Social Support Survey Instrument - How often is each of the following kinds of support available to you if you need it: Someone to help with daily chores if you were sick.",
            "identifier": "C136226",
            "notation": "RSSS01-Help With Daily Chores If Sick",
            "pref_label": "RAND Social Support Survey - Help With Daily Chores If Sick",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C135699-C136226"
        },
        {
            "alt_label": "RSSS01-Help You Get Your Mind Off Things",
            "definition": "RAND Social Support Survey Instrument - How often is each of the following kinds of support available to you if you need it: Someone to do things with to help you get your mind off things.",
            "identifier": "C136233",
            "notation": "RSSS01-Help You Get Your Mind Off Things",
            "pref_label": "RAND Social Support Survey - Help You Get Your Mind Off Things",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C135699-C136233"
        },
        {
            "alt_label": "RSSS01-Hugs You",
            "definition": "RAND Social Support Survey Instrument - How often is each of the following kinds of support available to you if you need it: Someone who hugs you.",
            "identifier": "C136229",
            "notation": "RSSS01-Hugs You",
            "pref_label": "RAND Social Support Survey - Hugs You",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C135699-C136229"
        },
        {
            "alt_label": "RSSS01-Love and Make You Feel Wanted",
            "definition": "RAND Social Support Survey Instrument - How often is each of the following kinds of support available to you if you need it: Someone to love and make you feel wanted.",
            "identifier": "C136228",
            "notation": "RSSS01-Love and Make You Feel Wanted",
            "pref_label": "RAND Social Support Survey - Love and Make You Feel Wanted",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C135699-C136228"
        },
        {
            "alt_label": "RSSS01-Prepare Your Meals If Unable",
            "definition": "RAND Social Support Survey Instrument - How often is each of the following kinds of support available to you if you need it: Someone to prepare your meals if you were unable to do it yourself.",
            "identifier": "C136225",
            "notation": "RSSS01-Prepare Your Meals If Unable",
            "pref_label": "RAND Social Support Survey - Prepare Your Meals If Unable",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C135699-C136225"
        },
        {
            "alt_label": "RSSS01-Share Your Private Worries/Fears",
            "definition": "RAND Social Support Survey Instrument - How often is each of the following kinds of support available to you if you need it: Someone to share your most private worries and fears with.",
            "identifier": "C136220",
            "notation": "RSSS01-Share Your Private Worries/Fears",
            "pref_label": "RAND Social Support Survey - Share Your Private Worries and Fears",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C135699-C136220"
        },
        {
            "alt_label": "RSSS01-Shows You Love and Affection",
            "definition": "RAND Social Support Survey Instrument - How often is each of the following kinds of support available to you if you need it: Someone who shows you love and affection.",
            "identifier": "C136227",
            "notation": "RSSS01-Shows You Love and Affection",
            "pref_label": "RAND Social Support Survey - Shows You Love and Affection",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C135699-C136227"
        },
        {
            "alt_label": "RSSS01-Take You to the Doctor If Needed",
            "definition": "RAND Social Support Survey Instrument - How often is each of the following kinds of support available to you if you need it: Someone to take you to the doctor if you needed it.",
            "identifier": "C136224",
            "notation": "RSSS01-Take You to the Doctor If Needed",
            "pref_label": "RAND Social Support Survey - Take You to the Doctor If Needed",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C135699-C136224"
        },
        {
            "alt_label": "RSSS01-Turn to Suggestions Personal Prob",
            "definition": "RAND Social Support Survey Instrument - How often is each of the following kinds of support available to you if you need it: Someone to turn to for suggestions about how to deal with a personal problem.",
            "identifier": "C136221",
            "notation": "RSSS01-Turn to Suggestions Personal Prob",
            "pref_label": "RAND Social Support Survey - Suggestions to Deal With Personal Problem",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C135699-C136221"
        },
        {
            "alt_label": "RSSS01-Understands Your Problems",
            "definition": "RAND Social Support Survey Instrument - How often is each of the following kinds of support available to you if you need it: Someone who understands your problems.",
            "identifier": "C136222",
            "notation": "RSSS01-Understands Your Problems",
            "pref_label": "RAND Social Support Survey - Understands Your Problems",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C135699-C136222"
        }
    ]
}