{
    "SKOS_CONCEPT": [
        {
            "definition": "A new 123I-MIBG whole body scan scoring method--application to the prediction of the response of metastases to induction chemotherapy in stage IV neuroblastoma. (N Ady, J M Zucker, B Asselain, V Edeline, F Bonnin, J Michon, R Gongora, L Manil. A new 123I-MIBG whole body scan scoring method--application to the prediction of the response of metastases to induction chemotherapy in stage IV neuroblastoma. Eur J Cancer. 1995;31A(2):256-61.)",
            "identifier": "C179778",
            "notation": "ADY NEUROBLASTOMA 1995",
            "pref_label": "Ady Neuroblastoma 1995 Oncology Response Criteria",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C124298-C179778"
        },
        {
            "alt_label": "AJCC1",
            "definition": "AJCC TNM Staging System 7th Edition (AJCC V7) (Edge SB, Byrd DR, Compton CC, Fritz AG, Greene FL, Trotti A, editors. AJCC cancer staging manual (7th ed). New York, NY: Springer; 2010). No part of the AJCC V7 may be reproduced, distributed, or transmitted in any form or by any means, including photocopying, recording, or other electronic or mechanical methods, without the prior written permission of Springer and payment of any applicable fees. Copyright Springer 2010. All rights reserved.",
            "identifier": "C125755",
            "notation": "AJCC V7",
            "pref_label": "AJCC Cancer Staging Manual 7th Edition",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C124298-C125755"
        },
        {
            "alt_label": "AJCC2",
            "definition": "AJCC TNM Staging System 8th Edition (AJCC V8) (Amin, M.B., Edge, S.B., Greene, F.L., et al. (Eds.) AJCC Cancer Staging Manual. 8th Ed. New York: Springer; 2017. AJCC Cancer Staging Manual, Eighth Edition. Copyright 2017 American College of Surgeons. All rights reserved). No part of the AJCC V8 may be reproduced, distributed, or transmitted in any form or by any means, including photocopying, recording, or other electronic or mechanical methods, without the prior written permission of Springer and payment of any applicable fees. Copyright American College of Surgeons 2017. All rights reserved.",
            "identifier": "C146985",
            "notation": "AJCC V8",
            "pref_label": "AJCC Cancer Staging Manual 8th Edition",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C124298-C146985"
        },
        {
            "definition": "Pathologic Response to Preoperative Chemotherapy: A New Outcome End Point After Resection of Hepatic Colorectal Metastases. (Blazer DG 3rd, Kishi Y, Maru DM, Kopetz S, Chun YS, Overman MJ, Fogelman D, Eng C, Chang DZ, Wang H, Zorzi D, Ribero D, Ellis LM, Glover KY, Wolff RA, Curley SA, Abdalla EK, Vauthey JN. Pathologic Response to Preoperative Chemotherapy: A New Outcome End Point After Resection of Hepatic Colorectal Metastases. J Clin Oncol. 2008 Nov 20;26(33):5344-51.)",
            "identifier": "C125990",
            "notation": "BLAZER COLORECTAL CANCER 2008",
            "pref_label": "Blazer Colorectal Cancer 2008 Oncology Response Criteria",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C124298-C125990"
        },
        {
            "definition": "CT findings of response and recurrence, independent of change in tumor size, in colorectal liver metastasis treated with bevacizumab. (Boonsirikamchai P, Asran MA, Maru DM, Vauthey JN, Kaur H, Kopetz S, Loyer EM. CT findings of response and recurrence, independent of change in tumor size, in colorectal liver metastasis treated with bevacizumab. AJR Am J Roentgenol. 2011 Dec;197(6):W1060-6.)",
            "identifier": "C125991",
            "notation": "BOONSIRIKAMCHAI COLORECTAL CANCER 2011",
            "pref_label": "Boonsirikamchai Colorectal Cancer 2011 Oncology Response Criteria",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C124298-C125991"
        },
        {
            "definition": "Standardized MRD quantification in European ALL trials: Proceedings of the Second International Symposium on MRD assessment in Kiel, Germany, 18-20 September 2008. (Bruggemann M, Schrauder A, Raff T, Pfeifer H, Dworzak M, Ottmann OG, Asnafi V, Baruchel A, Bassan R, Benoit Y, Biondi A, Cave H, Dombret H, Fielding AK, Foa R, Gokbuget N, Goldstone AH, Goulden N, Henze G, Hoelzer D, Janka-Schaub GE, Macintyre EA, Pieters R, Rambaldi A, Ribera JM, Schmiegelow K, Spinelli O, Stary J, von Stackelberg A, Kneba M, Schrappe M, van Dongen JJ; European Working Group for Adult Acute Lymphoblastic Leukemia (EWALL); International Berlin-Frankfurt-Munster Study Group (I-BFM-SG). Standardized MRD quantification in European ALL trials: Proceedings of the Second International Symposium on MRD assessment in Kiel, Germany, 18-20 September 2008. Leukemia. 2010 Mar;24(3):521-35.)",
            "identifier": "C125992",
            "notation": "BRUGGEMANN MRD 2010",
            "pref_label": "Bruggemann MRD 2010 Oncology Response Criteria",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C124298-C125992"
        },
        {
            "definition": "Evaluation of ER, PgR, HER-2 and Ki-67 as predictors of response to neoadjuvant anthracycline chemotherapy for operable breast cancer. (Burcombe RJ, Makris A, Richman PI, Daley FM, Noble S, Pittam M, Wright D, Allen SA, Dove J, Wilson GD. Evaluation of ER, PgR, HER-2 and Ki-67 as predictors of response to neoadjuvant anthracycline chemotherapy for operable breast cancer. Br J Cancer. 2005 Jan 17;92(1):147-55.)",
            "identifier": "C125993",
            "notation": "BURCOMBE BREAST CANCER 2005",
            "pref_label": "Burcombe Breast Cancer 2005 Oncology Response Criteria",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C124298-C125993"
        },
        {
            "definition": "CLL response criteria. (Cheson BD. CLL response criteria.Clin Adv Hematol Oncol. 2006 May;4(5):4-5; discussion 10; suppl 12.)",
            "identifier": "C125994",
            "notation": "CHESON CLL 2006",
            "pref_label": "Cheson CLL 2006 Oncology Response Criteria",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C124298-C125994"
        },
        {
            "definition": "Novel targeted agents and the need to refine clinical end points in chronic lymphocytic leukemia. (Cheson BD, Byrd JC, Rai KR, Kay NE, O'Brien SM, Flinn IW, Wiestner A, Kipps TJ. Novel targeted agents and the need to refine clinical end points in chronic lymphocytic leukemia. J Clin Oncol. 2012 Aug 10;30(23):2820-2.)",
            "identifier": "C125995",
            "notation": "CHESON CLL 2012",
            "pref_label": "Cheson CLL 2012 Oncology Response Criteria",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C124298-C125995"
        },
        {
            "definition": "New staging and response criteria for non-Hodgkin lymphoma and Hodgkin lymphoma. (Cheson BD. New staging and response criteria for non-Hodgkin lymphoma and Hodgkin lymphoma. Radiol Clin North Am. 2008 Mar;46(2):213-23, vii.)",
            "identifier": "C125996",
            "notation": "CHESON HODGKINS NON-HODGKINS LYMPHOMA 2008",
            "pref_label": "Cheson Hodgkins Non-Hodgkins Lymphoma 2008 Oncology Response Criteria",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C124298-C125996"
        },
        {
            "definition": "New response criteria for lymphomas in clinical trials. (Cheson BD. New response criteria for lymphomas in clinical trials. Ann Oncol. 2008 Jun;19 Suppl 4:iv35-8.)",
            "identifier": "C125997",
            "notation": "CHESON LYMPHOMA 2008",
            "pref_label": "Cheson Lymphoma 2008 Oncology Response Criteria",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C124298-C125997"
        },
        {
            "definition": "Revised response criteria for malignant lymphoma. (Cheson BD, Pfistner B, Juweid ME, Gascoyne RD, Specht L, Horning SJ, Coiffier B, Fisher RI, Hagenbeek A, Zucca E, Rosen ST, Stroobants S, Lister TA, Hoppe RT, Dreyling M, Tobinai K, Vose JM, Connors JM, Federico M, Diehl V; International Harmonization Project on Lymphoma. Revised response criteria for malignant lymphoma. J Clin Oncol. 2007 Feb 10;25(5):579-86. Epub 2007 Jan 22.)",
            "identifier": "C125998",
            "notation": "CHESON MALIGNANT LYMPHOMA 2007",
            "pref_label": "Cheson Malignant Lymphoma 2007 Oncology Response Criteria",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C124298-C125998"
        },
        {
            "definition": "Inflammatory breast cancer. Pilot study of intensive induction chemotherapy (FEC-HD) results in a high histologic response rate. (Chevallier B, Roche H, Olivier JP, Chollet P, Hurteloup P. Inflammatory breast cancer. Pilot study of intensive induction chemotherapy (FEC-HD) results in a high histologic response rate. Am J Clin Oncol. 1993 Jun;16(3):223-8.)",
            "identifier": "C125999",
            "notation": "CHESON NON-HODGKINS HODGKINS LYMPHOMA 1993",
            "pref_label": "Cheson Non-Hodgkins Hodgkins Lymphoma 1993 Oncology Response Criteria",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C124298-C125999"
        },
        {
            "definition": "Report of an International Workshop to Standardize Response Criteria for Non-Hodgkin's Lymphomas. (Cheson BD, Horning SJ, Coiffier B, Shipp MA, Fisher RI, Connors JM, Lister TA, Vose J, Grillo-Lopez A, Hagenbeek A, Cabanillas F, Klippensten D, Hiddemann W, Castellino R, Harris NL, Armitage JO, Carter W, Hoppe R, Canellos GP. Report of an International Workshop to Standardize Response Criteria for Non-Hodgkin's Lymphomas. J Clin Oncol. 1999 Apr;17(4):1244.)",
            "identifier": "C126000",
            "notation": "CHESON NON-HODGKINS LYMPHOMA 1999",
            "pref_label": "Cheson Non-Hodgkins Lymphoma 1999 Oncology Response Criteria",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C124298-C126000"
        },
        {
            "definition": "Response Evaluation of Gastrointestinal Stromal Tumors. (Choi H, Charnsangavej C, Faria SC, Macapinlac HA, Burgess MA, Patel SR, Chen LL, Podoloff DA, Benjamin RS. Response Evaluation of Gastrointestinal Stromal Tumors. Oncologist. 2008;13 Suppl 2:4-7.)",
            "identifier": "C122394",
            "notation": "CHOI GIST 2008",
            "pref_label": "Choi Response Criteria in the Evaluation of Gastrointestinal Stromal Tumors",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C124298-C122394"
        },
        {
            "definition": "Prognostic significance of a complete pathological response after induction chemotherapy in operable breast cancer. (Chollet P, Amat S, Cure H, de Latour M, Le Bouedec G, Mouret-Reynier MA, Ferriere JP, Achard JL, Dauplat J, Penault-Llorca F. Prognostic significance of a complete pathological response after induction chemotherapy in operable breast cancer. Br J Cancer. 2002 Apr 8;86(7):1041-6.)",
            "identifier": "C126001",
            "notation": "CHOLLET BREAST CANCER 2002",
            "pref_label": "Chollet Breast Cancer 2002 Oncology Response Criteria",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C124298-C126001"
        },
        {
            "definition": "Phase 3 Trial of Ibrutinib plus Rituximab in Waldenstrom's Macroglobulinemia. (Dimopoulos MA, Tedeschi A, Trotman J, Garcia Sanz R, Macdonald D, Leblond V, Mahe B, Herbaux C, Tam C, Orsucci L, Palomba ML, Matous JV, Shustik C, Kastritis E, Treon SP, Li J, Salman Z, Graef T, Buske C. Phase 3 Trial of Ibrutinib plus Rituximab in Waldenstrom's Macroglobulinemia for the iNNOVATE Study Group and the European Consortium for Waldenstrom's Macroglobulinemia. N Engl J Med 2018;378:2399-410.)",
            "identifier": "C178056",
            "notation": "DIMOPOULOS WALDENSTROMS MACROGLOBULINEMIA 2018",
            "pref_label": "Dimopoulos Waldenstroms Macroglobulinemia 2018 Oncology Response Criteria",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C124298-C178056"
        },
        {
            "definition": "Diagnosis and management of acute myeloid leukemia in adults: recommendations from an international expert panel, on behalf of the European LeukemiaNet. (Dohner H, Estey EH, Amadori S, Appelbaum FR, Buchner T, Burnett AK, Dombret H, Fenaux P, Grimwade D, Larson RA, Lo-Coco F, Naoe T, Niederwieser D, Ossenkoppele GJ, Sanz MA, Sierra J, Tallman MS, Lowenberg B, Bloomfield CD; European LeukemiaNet Diagnosis and management of acute myeloid leukemia in adults: recommendations from an international expert panel, on behalf of the European LeukemiaNet. Blood. 2010 Jan 21;115(3):453-74.)",
            "identifier": "C126002",
            "notation": "DOHNER AML 2010",
            "pref_label": "Dohner AML 2010 Oncology Response Criteria",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C124298-C126002"
        },
        {
            "definition": "International uniform response criteria for multiple myeloma. (Durie BG, Harousseau JL, Miguel JS, Blade J, Barlogie B, Anderson K, Gertz M, Dimopoulos M, Westin J, Sonneveld P, Ludwig H, Gahrton G, Beksac M, Crowley J, Belch A, Boccadaro M, Cavo M, Turesson I, Joshua D, Vesole D, Kyle R, Alexanian R, Tricot G, Attal M, Merlini G, Powles R, Richardson P, Shimizu K, Tosi P, Morgan G, Rajkumar SV; International Myeloma Working Group. International uniform response criteria for multiple myeloma. Leukemia. 2006 Sep;20(9):1467-73. Epub 2006 Jul 20.)",
            "identifier": "C126003",
            "notation": "DURIE MULTIPLE MYELOMA 2006",
            "pref_label": "Durie Multiple Myeloma 2006 Oncology Response Criteria",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C124298-C126003"
        },
        {
            "definition": "Clinical management, of hepatocellular carcinoma: conclusions of the Barcelona-2000 EASL conference-European Association for the Study of the Liver. (Bruix J, Sherman M, Llovet JM, Beaugrand M, Lencioni R, Burroughs AK, Christensen E, Pagliaro L, Colombo M, Rodes J; EASL Panel of Experts on HCC. Clinical management, of hepatocellular carcinoma: conclusions of the Barcelona-2000 EASL conference-European Association for the Study of the Liver. J Hepatol. 2001 Sep;35(3):421-30.)",
            "identifier": "C126004",
            "notation": "EASL BRUIX LIVER CANCER 2001",
            "pref_label": "EASL Bruix Liver Cancer 2001 Oncology Response Criteria",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C124298-C126004"
        },
        {
            "definition": "Criteria for evaluating disease response and progression in patients with multiple myeloma treated by high-dose therapy and haemopoietic stem cell transplantation. Myeloma Subcommittee of the EBMT. European Group for Blood and Marrow Transplant. (Blade J, Samson D, Reece D, Apperley J, Bjorkstrand B, Gahrton G, Gertz M, Giralt S, Jagannath S, Vesole D. Criteria for evaluating disease response and progression in patients with multiple myeloma treated by high-dose therapy and haemopoietic stem cell transplantation. Myeloma Subcommittee of the EBMT. European Group for Blood and Marrow Transplant. Br J Haematol. 1998 Sep;102(5):1115-23.)",
            "identifier": "C126005",
            "notation": "EBMT BLADE MYELOMA 1998",
            "pref_label": "EBMT Blade Myeloma 1998 Oncology Response Criteria",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C124298-C126005"
        },
        {
            "definition": "Diagnosis and management of AML in adults: 2017 ELN recommendations from an international expert panel. (Hartmut Dohner, Elihu Estey, David Grimwade, Sergio Amadori, Frederick R. Appelbaum, et al. Diagnosis and management of AML in adults: 2017 ELN recommendations from an international expert panel. Blood (2017) 129 (4): 424-447.)",
            "identifier": "C179779",
            "notation": "ELN DOHNER AML 2017",
            "pref_label": "ELN Dohner AML 2017 Oncology Response Criteria",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C124298-C179779"
        },
        {
            "definition": "Clinical End Points and Response Criteria in Mycosis Fungoides and Sezary Syndrome: A Consensus Statement of the International Society for Cutaneous Lymphomas, the United States Cutaneous Lymphoma Consortium, and the Cutaneous Lymphoma Task Force of the European Organisation for Research and Treatment of Cancer. (Olsen EA, Whittaker S, Kim YH, Duvic M, Prince HM, Lessin SR, Wood GS, Willemze R, Demierre MF, Pimpinelli N, Bernengo MG, Ortiz-Romero PL, Bagot M, Estrach T, Guitart J, Knobler R, Sanches JA, Iwatsuki K, Sugaya M, Dummer R, Pittelkow M, Hoppe R, Parker S, Geskin L, Pinter-Brown L, Girardi M, Burg G, Ranki A, Vermeer M, Horwitz S, Heald P, Rosen S, Cerroni L, Dreno B, Vonderheid EC; International Society for Cutaneous Lymphomas; United States Cutaneous Lymphoma Consortium; Cutaneous Lymphoma Task Force of the European Organisation for Research and Treatment of Cancer. Clinical End Points and Response Criteria in Mycosis Fungoides and Sezary Syndrome: A Consensus Statement of the International Society for Cutaneous Lymphomas, the United States Cutaneous Lymphoma Consortium, and the Cutaneous Lymphoma Task Force of the European Organisation for Research and Treatment of Cancer. J Clin Oncol. 2011 Jun 20;29(18):2598-607.)",
            "identifier": "C126006",
            "notation": "EORTC OLSEN MYCOSIS FUNGOIDES AND SEZARY SYNDROME 2011",
            "pref_label": "EORTC Olsen Mycosis Fungoides And Sezary Syndrome 2011 Oncology Response Criteria",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C124298-C126006"
        },
        {
            "definition": "Evolving concepts in the management of chronic myeloid leukemia: recommendations from an expert panel on behalf of the European LeukemiaNet. (Baccarani M, Saglio G, Goldman J, Hochhaus A, Simonsson B, Appelbaum F, Apperley J, Cervantes F, Cortes J, Deininger M, Gratwohl A, Guilhot F, Horowitz M, Hughes T, Kantarjian H, Larson R, Niederwieser D, Silver R, Hehlmann R; European LeukemiaNet. Evolving concepts in the management of chronic myeloid leukemia: recommendations from an expert panel on behalf of the European LeukemiaNet. Blood. 2006 Sep 15;108(6):1809-20. Epub 2006 May 18.)",
            "identifier": "C126007",
            "notation": "EUROPEAN LEUKEMIANET BACCARANI CML 2006",
            "pref_label": "European Leukemianet Baccarani CML 2006 Oncology Response Criteria",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C124298-C126007"
        },
        {
            "definition": "Supplement to: Farooqui MZH, Valdez J, Martyr S, et al. Ibrutinib for previously untreated and relapsed or refractory chronic lymphocytic leukaemia with TP53 aberrations: a phase 2, single-arm trial. Lancet Oncol 2014; published online Dec 31. http://dx.doi.org/10.1016/S1470-2045(14)71182-9. (Available at http://www.thelancet.com/cms/attachment/2026086364/2045255220/mmc1.pdf. Accessed April 27, 2016)",
            "identifier": "C128990",
            "notation": "FAROOQUI SUPP CLL 2014",
            "pref_label": "Supplement to Farooqui CLL 2014 Oncology Response Criteria",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C124298-C128990"
        },
        {
            "definition": "Definitions for response and progression in ovarian cancer clinical trials incorporating RECIST 1.1 and CA 125 agreed by the Gynecological Cancer Intergroup (GCIG). (Rustin GJ, Vergote I, Eisenhauer E, Pujade-Lauraine E, Quinn M, Thigpen T, du Bois A, Kristensen G, Jakobsen A, Sagae S, Greven K, Parmar M, Friedlander M, Cervantes A, Vermorken J; Gynecological Cancer Intergroup. Definitions for response and progression in ovarian cancer clinical trials incorporating RECIST 1.1 and CA 125 agreed by the Gynecological Cancer Intergroup (GCIG). Int J Gynecol Cancer. 2011 Feb;21(2):419-23.)",
            "identifier": "C126008",
            "notation": "GCIG RUSTIN OVARIAN CANCER 2011",
            "pref_label": "GCIG Rustin Ovarian Cancer 2011 Oncology Response Criteria",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C124298-C126008"
        },
        {
            "definition": "Dasatinib induces significant hematologic and cytogenetic responses in patients with imatinib-resistant or -intolerant chronic myeloid leukemia in accelerated phase. (Guilhot F, Apperley J, Kim DW, Bullorsky EO, Baccarani M, Roboz GJ, Amadori S, de Souza CA, Lipton JH, Hochhaus A, Heim D, Larson RA, Branford S, Muller MC, Agarwal P, Gollerkeri A, Talpaz M. Dasatinib induces significant hematologic and cytogenetic responses in patients with imatinib-resistant or -intolerant chronic myeloid leukemia in accelerated phase. Blood. 2007 May 15;109(10):4143-50. Epub 2007 Jan 30.)",
            "identifier": "C126009",
            "notation": "GUILHOT CML 2007",
            "pref_label": "Guilhot CML 2007 Oncology Response Criteria",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C124298-C126009"
        },
        {
            "definition": "CA125 Response: Can it Replace the Traditional Response Criteria in Ovarian Cancer? (Guppy AE, Rustin GJS. CA125 Response: Can it Replace the Traditional Response Criteria in Ovarian Cancer? Oncologist. 2002;7(5):437-43.)",
            "identifier": "C126010",
            "notation": "GUPPY OVARIAN CANCER 2002",
            "pref_label": "Guppy Ovarian Cancer 2002 Oncology Response Criteria",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C124298-C126010"
        },
        {
            "definition": "Tumour response interpretation with new tumour response criteria vs the World Health Organisation criteria in patients with bone-only metastatic breast cancer. (Hamaoka T, Costelloe CM, Madewell JE, Liu P, Berry DA, Islam R, Theriault RL, Hortobagyi GN, Ueno NT. Tumour response interpretation with new tumour response criteria vs the World Health Organisation criteria in patients with bone-only metastatic breast cancer. Br J Cancer. 2010 Feb 16;102(4):651-7.)",
            "identifier": "C126011",
            "notation": "HAMAOKA BREAST CANCER 2010",
            "pref_label": "Hamaoka Breast Cancer 2010 Oncology Response Criteria",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C124298-C126011"
        },
        {
            "definition": "Assessing treatment effect in pancreatic cancer. (Hartman DJ, Krasinskas AM. Assessing treatment effect in pancreatic cancer. Arch Pathol Lab Med. 2012 Jan;136(1):100-9.)",
            "identifier": "C126013",
            "notation": "HARTMAN PANCREATIC CANCER 2012",
            "pref_label": "Hartman Pancreatic Cancer 2012 Oncology Response Criteria",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C124298-C126013"
        },
        {
            "definition": "Prognostic variables for response and outcome in patients with extragonadal germ-cell tumors. (Hartmann JT, Nichols CR, Droz JP, Horwich A, Gerl A, Fossa SD, Beyer J, Pont J, Kanz L, Einhorn L, Bokemeyer C. Prognostic variables for response and outcome in patients with extragonadal germ-cell tumors. Ann Oncol. 2002 Jul;13(7):1017-28.)",
            "identifier": "C126012",
            "notation": "HARTMANN GERM CELL CANCER 2002",
            "pref_label": "Hartmann Germ Cell Cancer 2002 Oncology Response Criteria",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C124298-C126012"
        },
        {
            "definition": "Immunotherapy response assessment in neuro-oncology: a report of the RANO working group. (Okada H, Weller M, Huang R, Finocchiaro G, Gilbert MR, Wick W, Ellingson BM, Hashimoto N, Pollack IF, Brandes AA, Franceschi E, Herold-Mende C, Nayak L, Panigrahy A, Pope WB, Prins R, Sampson JH, Wen PY, Reardon DA. Immunotherapy response assessment in neuro-oncology: a report of the RANO working group. Lancet Oncol. 2015 Nov;16(15):e534-e542.)",
            "identifier": "C158263",
            "notation": "IRANO 2015",
            "pref_label": "IRANO Okada 2015 Oncology Response Criteria",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C124298-C158263"
        },
        {
            "definition": "iRECIST: guidelines for response criteria for use in trials testing immunotherapeutics. (Seymour L, Bogaerts J, Perrone A, Ford R, Schwartz LH, Mandrekar S, Lin NU, Litiere S, Dancey J, Chen A, Hodi FS, Therasse P, Hoekstra OS, Shankar LK, Wolchok JD, Ballinger M, Caramella C, de Vries EG; RECIST working group. iRECIST: guidelines for response criteria for use in trials testing immunotherapeutics. Lancet Oncol. 2017 Mar;18(3):e143-e152.)",
            "identifier": "C136711",
            "notation": "iRECIST",
            "pref_label": "Immune-Modified Response Evaluation Criteria in Solid Tumors",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C124298-C136711"
        },
        {
            "definition": "A practical guide from the International Thymic Malignancy Interest Group (ITMIG) regarding radiographic assessment of treatment response of thymic epithelial tumors using modified RECIST criteria. (Marcelo F Benveniste, Robert J Korst, Arun Rajan, Frank C Detterbeck, Edith M Marom, International Thymic Malignancy Interest Group. A practical guide from the International Thymic Malignancy Interest Group (ITMIG) regarding the radiographic assessment of treatment response of thymic epithelial tumors using modified RECIST criteria. J Thorac Oncol. 2014 Sep;9(9 Suppl 2):S119-24.)",
            "identifier": "C179780",
            "notation": "ITMIG MRECIST BENVENISTE THYMIC EPITHELIAL TUMORS 2014",
            "pref_label": "ITMIG MRECIST Benveniste Thymic Epithelial Tumors 2014 Oncology Response Criteria",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C124298-C179780"
        },
        {
            "alt_label": "Intratumoral RECIST",
            "definition": "Response criteria for intratumoral immunotherapy in solid tumors: itRECIST (Goldmacher GV, Khilnani AD, MD1, Andtbacka RHI, Luke JJ, Hodi FS, Marabelle A, Harrington K, Perrone A, Tse A, Madoff DC, Schwartz LH. Response criteria for intratumoral immunotherapy in solid tumors: itRECIST. J Clin Oncol. 2020 Aug 10;38(23):2667-2676.)",
            "identifier": "C179781",
            "notation": "itRECIST GOLDMACHER 2020",
            "pref_label": "itRECIST Goldmacher 2020 Oncology Response Criteria",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C124298-C179781"
        },
        {
            "definition": "Guidelines for the diagnosis and treatment of chronic lymphocytic leukemia: a report from the International Workshop on Chronic Lymphocytic Leukemia updating the National Cancer Institute-Working Group 1996 guidelines. (Hallek M, Cheson BD, Catovsky D, Caligaris-Cappio F, Dighiero G, Dohner H, Hillmen P, Keating MJ, Montserrat E, Rai KR, Kipps TJ. International Workshop on Chronic Lymphocytic Leukemia.Guidelines for the diagnosis and treatment of chronic lymphocytic leukemia: a report from the International Workshop on Chronic Lymphocytic Leukemia updating the National Cancer Institute-Working Group 1996 guidelines. Blood. 2008 Jun 15;111(12):5446-56.)",
            "identifier": "C126014",
            "notation": "IWC HALLEK CLL 2008",
            "pref_label": "IWC Hallek CLL 2008 Oncology Response Criteria",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C124298-C126014"
        },
        {
            "definition": "Guidelines for diagnosis, indications for treatment, response assessment, and supportive management of CLL: a report from the International Workshop on Chronic Lymphocytic Leukemia updating the 2008 International Workshop on Chronic Lymphocytic Leukemia (iwCLL) published consensus guidelines for the design and conduct of clinical trials for patients with CLL. (Hallek M, Cheson BD, Catovsky D, Caligaris-Cappio F, Dighiero G, Dohner H, Hillmen P, Keating MJ, Montserrat E, Chiorazzi N, Stilgenbauer S, Rai KR, Byrd JC, Eichhorst B, O'Brien S, Robak T, Seymour JF, Kipps TJ. Blood. 2018 Jun 21;131(25):2745-60.)",
            "identifier": "C178055",
            "notation": "IWC HALLEK CLL 2018",
            "pref_label": "IWC Hallek CLL 2018 Oncology Response Criteria",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C124298-C178055"
        },
        {
            "definition": "Revised Recommendations of the International Working Group for Diagnosis, Standardization of Response Criteria, Treatment Outcomes, and Reporting Standards for Therapeutic Trials in Acute Myeloid Leukemia. (Cheson BD, Bennett JM, Kopecky KJ, Buchner T, Willman CL, Estey EH, Schiffer CA, Doehner H, Tallman MS, Lister TA, Lo-Coco F, Willemze R, Biondi A, Hiddemann W, Larson RA, Lowenberg B, Sanz MA, Head DR, Ohno R, Bloomfield CD; International Working Group for Diagnosis, Standardization of Response Criteria, Treatment Outcomes, and Reporting Standards for Therapeutic Trials in Acute Myeloid Leukemia. Revised Recommendations of the International Working Group for Diagnosis, Standardization of Response Criteria, Treatment Outcomes, and Reporting Standards for Therapeutic Trials in Acute Myeloid Leukemia. J Clin Oncol. 2003 Dec 15;21(24):4642-9.)",
            "identifier": "C126015",
            "notation": "IWG CHESON AML 2003",
            "pref_label": "IWG Cheson AML 2003 Oncology Response Criteria",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C124298-C126015"
        },
        {
            "definition": "Report of an international working group to standardize response criteria for myelodysplastic syndromes. (Cheson BD, Bennett JM, Kantarjian H, Pinto A, Schiffer CA, Nimer SD, Lowenberg B, Beran M, de Witte TM, Stone RM, Mittelman M, Sanz GF, Wijermans PW, Gore S, Greenberg PL; World Health Organization(WHO) international working group. Report of an international working group to standardize response criteria for myelodysplastic syndromes. Blood. 2000 Dec 1;96(12):3671-4.)",
            "identifier": "C126016",
            "notation": "IWG CHESON MDS 2000",
            "pref_label": "IWG Cheson MDS 2000 Oncology Response Criteria",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C124298-C126016"
        },
        {
            "definition": "Clinical application and proposal for modification of the International Working Group (IWG) response criteria in myelodysplasia. (Cheson BD, Greenberg PL, Bennett JM, Lowenberg B, Wijermans PW, Nimer SD, Pinto A, Beran M, de Witte TM, Stone RM, Mittelman M, Sanz GF, Gore SD, Schiffer CA, Kantarjian H. Clinical application and proposal for modification of the International Working Group (IWG) response criteria in myelodysplasia. Blood. 2006 Jul 15;108(2):419-25. Epub 2006 Apr 11.)",
            "identifier": "C126017",
            "notation": "IWG CHESON MDS 2006",
            "pref_label": "IWG Cheson MDS 2006 Oncology Response Criteria",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C124298-C126017"
        },
        {
            "definition": "Preoperative external beam radiotherapy and reduced dose brachytherapy for carcinoma of the cervix: survival and pathological response. (Jacinto AA, Castilho MS, Novaes PE, Novick PR, Viani GA, Salvajoli JV, Ferrigno R, Pellizzon AC, Lima SS, Maia MA, Fogaroli RC. Preoperative external beam radiotherapy and reduced dose brachytherapy for carcinoma of the cervix: survival and pathological response. Radiat Oncol. 2007 Feb 22;2:9.)",
            "identifier": "C126018",
            "notation": "JACINTO CERVICAL CANCER 2007",
            "pref_label": "Jacinto Cervical Cancer 2007 Oncology Response Criteria",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C124298-C126018"
        },
        {
            "definition": "Japanese classification of gastric carcinoma: 3rd English edition. ([No authors listed]. Japanese Gastric Cancer Association. Japanese classification of gastric carcinoma: 3rd English edition. Gastric Cancer. 2011 Jun;14(2):101-12.)",
            "identifier": "C126019",
            "notation": "JAPANESE CLASSIFICATION GASTRIC CANCER 2011",
            "pref_label": "Japanese Classification Gastric Cancer 2011 Oncology Response Criteria",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C124298-C126019"
        },
        {
            "definition": "Response assessment of aggressive non-Hodgkin's lymphoma by integrated International Workshop Criteria and fluorine-18-fluorodeoxyglucose positron emission tomography. (Juweid ME, Wiseman GA, Vose JM, Ritchie JM, Menda Y, Wooldridge JE, Mottaghy FM, Rohren EM, Blumstein NM, Stolpen A, Link BK, Reske SN, Graham MM, Cheson BD. Response assessment of aggressive non-Hodgkin's lymphoma by integrated International Workshop Criteria and fluorine-18-fluorodeoxyglucose positron emission tomography.J Clin Oncol. 2005 Jul 20;23(21):4652-61.)",
            "identifier": "C126020",
            "notation": "JUWEID NON-HODGKINS LYMPHOMA 2005",
            "pref_label": "Juweid Non-Hodgkins Lymphoma 2005 Oncology Response Criteria",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C124298-C126020"
        },
        {
            "definition": "Clinical usefulness of AJCC response criteria for neoadjuvant chemotherapy in breast cancer. (Keam B, Im SA, Lim Y, Han SW, Moon HG, Oh DY, Cho N, Lee SH, Han W, Moon WK, Kim DW, Kim TY, Park IA, Noh DY. Clinical usefulness of AJCC response criteria for neoadjuvant chemotherapy in breast cancer. Ann Surg Oncol. 2013 Jul;20(7):2242-9.)",
            "identifier": "C126021",
            "notation": "KEAM BREAST CANCER 2013",
            "pref_label": "Keam Breast Cancer 2013 Oncology Response Criteria",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C124298-C126021"
        },
        {
            "definition": "Update on Recommendations for Assessing Response from the Third International Workshop on Waldenstrom's Macroglobulinemia. (Kimby E, Treon SP, Anagnostopoulos A, Dimopoulos M, Garcia-Sanz R, Gertz MA, Johnson S, LeBlond V, Fermand JP, Maloney DG, Merlini G, Morel P, Morra E, Nichols G, Ocio EM, Owen R, Stone M, Blade J. Update on Recommendations for Assessing Response from the Third International Workshop on Waldenstrom's Macroglobulinemia. Clin Lymphoma Myeloma. 2006 Mar;6(5):380-3.)",
            "identifier": "C126022",
            "notation": "KIMBY WALDENSTROMS MACROGLOBULINEMIA 2006",
            "pref_label": "Kimby Waldenstroms Macroglobulinemia 2006 Oncology Response Criteria",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C124298-C126022"
        },
        {
            "definition": "Primary central nervous system lymphomas (PCNSL): MRI response criteria revised. (Kuker W, Nagele T, Thiel E, Weller M, Herrlinger U. Primary central nervous system lymphomas (PCNSL): MRI response criteria revised. Neurology. 2005 Oct 11;65(7):1129-31.)",
            "identifier": "C126023",
            "notation": "KUKER LYMPHOMA 2005",
            "pref_label": "Kuker Lymphoma 2005 Oncology Response Criteria",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C124298-C126023"
        },
        {
            "definition": "International Myeloma Working Group consensus criteria for response and minimal residual disease assessment in multiple myeloma. (Kumar S, Paiva B, Anderson KC, Durie B, et al. International Myeloma Working Group consensus criteria for response and minimal residual disease assessment in multiple myeloma. Lancet Oncol. 2016 Aug;17(8):e328-46.)",
            "identifier": "C147478",
            "notation": "KUMAR IMWG 2016",
            "pref_label": "Kumar IMWG 2016 Oncology Response Criteria",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C124298-C147478"
        },
        {
            "definition": "New CT response criteria in non-small cell lung cancer: proposal and application in EGFR tyrosine kinase inhibitor therapy. (Lee HY, Lee KS, Ahn MJ, Hwang HS, Lee JW, Park K, Ahn JS, Kim TS, Yi CA, Chung MJ. New CT response criteria in non-small cell lung cancer: proposal and application in EGFR tyrosine kinase inhibitor therapy. Lung Cancer. 2011 Jul;73(1):63-9.)",
            "identifier": "C126024",
            "notation": "LEE LUNG CANCER 2011",
            "pref_label": "Lee Lung Cancer 2011 Oncology Response Criteria",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C124298-C126024"
        },
        {
            "definition": "Recommendations for Initial Evaluation, Staging, and Response Assessment of Hodgkin and Non-Hodgkin Lymphoma: The Lugano Classification. (Cheson BD, Fisher RI, Barrington SF, Cavalli F, Schwartz LH, Zucca E, Lister TA; Alliance, Australasian Leukaemia and Lymphoma Group; Eastern Cooperative Oncology Group; European Mantle Cell Lymphoma Consortium; Italian Lymphoma Foundation; European Organisation for Research; Treatment of Cancer/Dutch Hemato-Oncology Group; Grupo Espanol de Medula Osea; German High-Grade Lymphoma Study Group; German Hodgkin's Study Group; Japanese Lymphorra Study Group; Lymphoma Study Association; NCIC Clinical Trials Group; Nordic Lymphoma Study Group; Southwest Oncology Group; United Kingdom National Cancer Research Institute. Recommendations for Initial Evaluation, Staging, and Response Assessment of Hodgkin and Non-Hodgkin Lymphoma: The Lugano Classification. J Clin Oncol. 2014 Sep 20;32(27):3059-68.)",
            "identifier": "C126025",
            "notation": "LUGANO CLASSIFICATION",
            "pref_label": "Lugano Classification Oncology Response Criteria",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C124298-C126025"
        },
        {
            "definition": "Response criteria for phase II studies of supratentorial malignant glioma. (Macdonald DR, Cascino TL, Schold SC Jr, Cairncross JG. Response criteria for phase II studies of supratentorial malignant glioma. J Clin Oncol. 1990 Jul;8(7):1277-80.)",
            "identifier": "C126026",
            "notation": "MACDONALD GLIOMA 1990",
            "pref_label": "Macdonald Glioma 1990 Oncology Response Criteria",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C124298-C126026"
        },
        {
            "definition": "Morphology, Attenuation, Size, and Structure (MASS) criteria: assessing response and predicting clinical outcome in metastatic renal cell carcinoma on antiangiogenic targeted therapy. (Smith AD, Shah SN, Rini BI, Lieber ML, Remer EM. Morphology, Attenuation, Size, and Structure (MASS) criteria: assessing response and predicting clinical outcome in metastatic renal cell carcinoma on antiangiogenic targeted therapy. AJR Am J Roentgenol. 2010 Jun;194(6):1470-8.)",
            "identifier": "C126027",
            "notation": "MASS",
            "pref_label": "Morphology, Attenuation, Size, and Structure Criteria",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C124298-C126027"
        },
        {
            "definition": "Langerhans Cell Histiocytosis: Histiocyte Society Evaluation and Treatment Guidelines April 2009. (Minkov, M., Grois, N., McClain, K., Nanduri, V., Rodriguez-Galindo, C., Simonitsch-Klupp, I., Visser, J., Weitzman, S., Whitlock, J., Windebank, K. (April 2009). Langerhans Cell Histiocytosis: Histiocyte Society Evaluation and Treatment Guidelines April 2009 [pdf]. Retrieved from https://www.histiocytesociety.org/document.doc?id=290)",
            "identifier": "C126028",
            "notation": "MINKOV LANGERHANS CELL HISTIOCYTOSIS 2009",
            "pref_label": "Minkov Langerhans Cell Histiocytosis 2009 Oncology Response Criteria",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C124298-C126028"
        },
        {
            "definition": "Chronic lymphocytic leukemia: recommendations for diagnosis, staging, and response criteria. International Workshop on Chronic Lymphocytic Leukemia. ([No authors listed]. Chronic lymphocytic leukemia: recommendations for diagnosis, staging, and response criteria. International Workshop on Chronic Lymphocytic Leukemia. Ann Intern Med. 1989 Feb 1;110(3):236-8.)",
            "identifier": "C126029",
            "notation": "MONTSERRAT CLL 1989",
            "pref_label": "Montserrat CLL 1989 Oncology Response Criteria",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C124298-C126029"
        },
        {
            "definition": "Response assessment in neuro-oncology (a report of the RANO group): assessment of outcome in trials of diffuse low-grade gliomas. (van den Bent MJ, Wefel JS, Schiff D, Taphoorn MJ, Jaeckle K, Junck L, Armstrong T, Choucair A, Waldman AD, Gorlia T, Chamberlain M, Baumert BG, Vogelbaum MA, Macdonald DR, Reardon DA, Wen PY, Chang SM, Jacobs AH. Response assessment in neuro-oncology (a report of the RANO group): assessment of outcome in trials of diffuse low-grade gliomas. Lancet Oncol. 2011 Jun;12(6):583-93.)",
            "identifier": "C126030",
            "notation": "MRANO VAN DEN BENT GLIOMA 2011",
            "pref_label": "Modified RANO Van Den Bent Glioma 2011 Oncology Response Criteria",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C124298-C126030"
        },
        {
            "definition": "Modified RECIST criteria for assessment of response in malignant pleural mesothelioma. (Armato SG 3rd, Nowak AK. Revised modified response evaluation criteria in solid tumors for assessment of response in malignant pleural mesothelioma (Version 1.1). J. Thorac. Oncol. 2018 Apr;13(7):1012-21.)",
            "identifier": "C179782",
            "notation": "MRECIST ARMATO MESOTHELIOMA 2018",
            "pref_label": "MRECIST Armato Mesothelioma 2018 Oncology Response Criteria",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C124298-C179782"
        },
        {
            "definition": "Modified RECIST criteria for assessment of response in malignant pleural mesothelioma. (Byrne MJ, Nowak AK. Modified RECIST criteria for assessment of response in malignant pleural mesothelioma. Ann Oncol. 2004 Feb;15(2):257-60.)",
            "identifier": "C126031",
            "notation": "MRECIST BYRNE MESOTHELIOMA 2004",
            "pref_label": "Modified RECIST Byrne Mesothelioma 2004 Oncology Response Criteria",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C124298-C126031"
        },
        {
            "definition": "Modified RECIST (mRECIST) Assessment for Hepatocellular Carcinoma. (Lencioni R, Llovet JM. Modified RECIST (mRECIST) Assessment for Hepatocellular Carcinoma. Semin Liver Dis. 2010 Feb;30(1):52-60.)",
            "identifier": "C126032",
            "notation": "MRECIST LENCIONI LIVER CANCER 2010",
            "pref_label": "Modified RECIST Lencioni Liver Cancer 2010 Oncology Response Criteria",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C124298-C126032"
        },
        {
            "definition": "Response criteria for the prostate of the USA National Prostatic Cancer Project. (Murphy GP, Slack NH. Response criteria for the prostate of the USA National Prostatic Cancer Project. Prostate. 1980;1(3):375-82.)",
            "identifier": "C126033",
            "notation": "MURPHY PROSTATE CANCER 1980",
            "pref_label": "Murphy Prostate Cancer 1980 Oncology Response Criteria",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C124298-C126033"
        },
        {
            "definition": "NCCN Clinical Practice Guidelines in Oncology (NCCN Guidelines) Acute Lymphoblastic Leukemia Version 1.2014 06/06/14 (NCCN Clinical Practice Guidelines in Oncology (NCCN Guidelines) Acute Lymphoblastic Leukemia Version 1.2014 06/06/14)",
            "identifier": "C126034",
            "notation": "NCCN ALL MRD 2014",
            "pref_label": "NCCN ALL MRD 2014 Oncology Response Criteria",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C124298-C126034"
        },
        {
            "definition": "National Cancer Institute-sponsored Working Group guidelines for chronic lymphocytic leukemia: revised guidelines for diagnosis and treatment. (Cheson BD, Bennett JM, Grever M, Kay N, Keating MJ, O'Brien S, Rai KR. National Cancer Institute-sponsored Working Group guidelines for chronic lymphocytic leukemia: revised guidelines for diagnosis and treatment. Blood. 1996 Jun 15;87(12):4990-7.)",
            "identifier": "C126035",
            "notation": "NCIWG CHESON CLL 1996",
            "pref_label": "NCIWG Cheson CLL 1996 Oncology Response Criteria",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C124298-C126035"
        },
        {
            "definition": "Response assessment in Waldenstrom macroglobulinaemia: update from the VIth International Workshop. (Roger G. Owen, Robert A. Kyle, Marvin J. Stone, Andy C. Rawstron, Veronique Leblond, et al. Response assessment in Waldenstrom macroglobulinaemia: update from the VIth International Workshop. Br J Haematol. 2013 Jan;160(2):171-6.)",
            "identifier": "C179783",
            "notation": "OWEN WALDESTROMS MACROGLOBULINEMIA 2013",
            "pref_label": "Owen Waldenstroms Macroglobulinemia 2013 Oncology Response Criteria",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C124298-C179783"
        },
        {
            "alt_label": "Palumbo IMWG 2009",
            "definition": "International Myeloma Working Group guidelines for the management of multiple myeloma patients ineligible for standard high-dose chemotherapy with autologous stem cell transplantation. (Palumbo A, Sezer O, Kyle R, Miguel JS, Orlowski RZ, Moreau P, Niesvizky R, Morgan G, Comenzo R, Sonneveld P, Kumar S, Hajek R, Giralt S, Bringhen S, Anderson KC, Richardson PG, Cavo M, Davies F, Blade J, Einsele H, Dimopoulos MA, Spencer A, Dispenzieri A, Reiman T, Shimizu K, Lee JH, Attal M, Boccadoro M, Mateos M, Chen W, Ludwig H, Joshua D, Chim J, Hungria V, Turesson I, Durie BG, Lonial S; IMWG. International Myeloma Working Group guidelines for the management of multiple myeloma patients ineligible for standard high-dose chemotherapy with autologous stem cell transplantation. Leukemia. 2009 Oct;23(10):1716-30.)",
            "identifier": "C126036",
            "notation": "PALUMBO MULTIPLE MYELOMA 2009",
            "pref_label": "Palumbo Multiple Myeloma 2009 Oncology Response Criteria",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C124298-C126036"
        },
        {
            "alt_label": "PCWG1",
            "definition": "Eligibility and response guidelines for phase II clinical trials in androgen-independent prostate cancer: recommendations from the Prostate-Specific Antigen Working Group. (Bubley GJ, Carducci M, Dahut W, Dawson N, Daliani D, Eisenberger M, Figg WD, Freidlin B, Halabi S, Hudes G, Hussain M, Kaplan R, Myers C, Oh W, Petrylak DP, Reed E, Roth B, Sartor O, Scher H, Simons J, Sinibaldi V, Small EJ, Smith MR, Trump DL, Wilding G, et al. Eligibility and response guidelines for phase II clinical trials in androgen-independent prostate cancer: recommendations from the Prostate-Specific Antigen Working Group. J Clin Oncol. 1999 Nov;17(11):3461-7.)",
            "identifier": "C126037",
            "notation": "PCWG BUBLEY PROSTATE CANCER 1999",
            "pref_label": "PCWG Bubley Prostate Cancer 1999 Oncology Response Criteria",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C124298-C126037"
        },
        {
            "alt_label": "PCWG2",
            "definition": "Design and end points of clinical trials for patients with progressive prostate cancer and castrate levels of testosterone: recommendations of the Prostate Cancer Clinical Trials Working Group. (Scher HI, Halabi S, Tannock I, Morris M, Sternberg CN, Carducci MA, Eisenberger MA, Higano C, Bubley GJ, Dreicer R, Petrylak D, Kantoff P, Basch E, Kelly WK, Figg WD, Small EJ, Beer TM, Wilding G, Martin A, Hussain M; Prostate Cancer Clinical Trials Working Group. Design and end points of clinical trials for patients with progressive prostate cancer and castrate levels of testosterone: recommendations of the Prostate Cancer Clinical Trials Working Group. J Clin Oncol. 2008 Mar 1;26(7):1148-59.)",
            "identifier": "C126038",
            "notation": "PCWG SCHER PROSTATE CANCER 2008",
            "pref_label": "PCWG Scher Prostate Cancer 2008 Oncology Response Criteria",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C124298-C126038"
        },
        {
            "alt_label": "PCWG3",
            "definition": "Trial Design and Objectives for Castration-Resistant Prostate Cancer: Updated Recommendations From the Prostate Cancer Clinical Trials Working Group 3. (Scher HI, Morris MJ, Stadler WM, Higano C, Basch E, Fizazi K, Antonarakis ES, Beer TM, Carducci MA, Chi KN, Corn PG, de Bono JS, Dreicer R, George DJ, Heath EI, Hussain M, Kelly WK, Liu G, Logothetis C, Nanus D, Stein MN, Rathkopf DE, Slovin SF, Ryan CJ, Sartor O, Small EJ, Smith MR, Sternberg CN, Taplin ME, Wilding G, Nelson PS, Schwartz LH, Halabi S, Kantoff PW, Armstrong AJ. Trial Design and Objectives for Castration-Resistant Prostate Cancer: Updated Recommendations From the Prostate Cancer Clinical Trials Working Group 3. J Clin Oncol. 2016 Apr 20;34(12):1402-18.)",
            "identifier": "C132454",
            "notation": "PCWG SCHER PROSTATE CANCER 2016",
            "pref_label": "PCWG Scher Prostate Cancer 2016 Oncology Response Criteria",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C124298-C132454"
        },
        {
            "definition": "From RECIST to PERCIST: Evolving considerations for PET response criteria in solid tumors. (Wahl RL, Jacene H, Kasamon Y, Lodge MA. From RECIST to PERCIST: Evolving considerations for PET response criteria in solid tumors. J Nucl Med. 2009 May;50 Suppl 1:122S-50S.)",
            "identifier": "C126039",
            "notation": "PERCIST",
            "pref_label": "PET Response Criteria in Solid Tumors",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C124298-C126039"
        },
        {
            "definition": "Chemotherapy Response of Breast Cancer Depends on HER-2 Status and Anthracycline Dose Intensity in the Neoadjuvant Setting. (Petit T, Borel C, Ghnassia JP, Rodier JF, Escande A, Mors R, Haegele P. Chemotherapy Response of Breast Cancer Depends on HER-2 Status and Anthracycline Dose Intensity in the Neoadjuvant Setting. Clin Cancer Res. 2001 Jun;7(6):1577-81.)",
            "identifier": "C126040",
            "notation": "PETIT BREAST CANCER 2001",
            "pref_label": "Petit Breast Cancer 2001 Oncology Response Criteria",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C124298-C126040"
        },
        {
            "definition": "Phase III Placebo-Controlled Trial of Denileukin Diftitox for Patients with Cutaneous T-cell Lymphoma. (Prince HM, Duvic M, Martin A, Sterry W, Assaf C, Sun Y, Straus D, Acosta M, Negro-Vilar A. Phase III Placebo-Controlled Trial of Denileukin Diftitox for Patients with Cutaneous T-cell Lymphoma. J Clin Oncol. 2010 Apr 10;28(11):1870-7.)",
            "identifier": "C126041",
            "notation": "PRINCE TCELL LYMPHOMA 2010",
            "pref_label": "Prince T Cell Lymphoma 2010 Oncology Response Criteria",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C124298-C126041"
        },
        {
            "definition": "A description of the disease response to treatment as characterized by the clinical trial protocol.",
            "identifier": "C126042",
            "notation": "PROTOCOL DEFINED RESPONSE CRITERIA",
            "pref_label": "Protocol Defined Response Criteria",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C124298-C126042"
        },
        {
            "definition": "Consensus recommendations for the uniform reporting of clinical trials: report of the International Myeloma Workshop Consensus Panel 1. (Rajkumar SV, Harousseau JL, Durie B, Anderson KC, Dimopoulos M, Kyle R, Blade J, Richardson P, Orlowski R, Siegel D, Jagannath S, Facon T, Avet-Loiseau H, Lonial S, Palumbo A, Zonder J, Ludwig H, Vesole D, Sezer O, Munshi NC, San Miguel J; International Myeloma Workshop Consensus Panel 1. Consensus recommendations for the uniform reporting of clinical trials: report of the International Myeloma Workshop Consensus Panel 1. Blood. 2011 May 5;117(18):4691-5.)",
            "identifier": "C126043",
            "notation": "RAJKUMAR MYELOMA 2011",
            "pref_label": "Rajkumar Myeloma 2011 Oncology Response Criteria",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C124298-C126043"
        },
        {
            "definition": "Modified Criteria for Radiographic Response Assessment in Glioblastoma Clinical Trials (Benjamin M. Ellingson, Patrick Y. Wen, Timothy F. Cloughesy. Modified Criteria for Radiographic Response Assessment in Glioblastoma Clinical Trials. Neurotherapeutics (2017) 14:307-320).",
            "identifier": "C158262",
            "notation": "RANO ELLINGSON 2017",
            "pref_label": "RANO Ellingson 2017 Oncology Response Criteria",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C124298-C158262"
        },
        {
            "definition": "Updated Response Assessment Criteria for High-Grade Gliomas: Response Assessment in Neuro-Oncology Working Group. (Wen PY, Macdonald DR, Reardon DA, Cloughesy TF, Sorensen AG, Galanis E, Degroot J, Wick W, Gilbert MR, Lassman AB, Tsien C, Mikkelsen T, Wong ET, Chamberlain MC, Stupp R, Lamborn KR, Vogelbaum MA, van den Bent MJ, Chang SM. Updated Response Assessment Criteria for High-Grade Gliomas: Response Assessment in Neuro-Oncology Working Group. J Clin Oncol. 2010 Apr 10;28(11):1963-72.)",
            "identifier": "C114879",
            "notation": "RANO",
            "pref_label": "Response Assessment in Neuro-Oncology Criteria",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C124298-C114879"
        },
        {
            "definition": "Response Evaluation Criteria in Cancer of the Liver (RECICL) proposed by the Liver Cancer Study Group of Japan (2009 revised version). (Kudo M, Kubo S, Takayasu K, Sakamoto M, Tanaka M, Ikai I, Furuse J, Nakamura K, Makuuchi M; Liver Cancer Study Group of Japan (Committee for Response Evaluation Criteria in Cancer of the Liver, Liver Cancer Study Group of Japan). Response Evaluation Criteria in Cancer of the Liver (RECICL) proposed by the Liver Cancer Study Group of Japan (2009 revised version). Hepatol Res. 2010 Jul;40(7):686-92.)",
            "identifier": "C126044",
            "notation": "RECICL",
            "pref_label": "Response Evaluation Criteria in Cancer of the Liver",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C124298-C126044"
        },
        {
            "definition": "Response Evaluation Criteria in Solid Tumors (RECIST) version 1.0 (Therasse P, Arbuck SG, Eisenhauer EA, Wanders J, Kaplan RS, Rubenstein L, Verweij J, Van Glabbeke M, van Oosterom AT, Christian MC, Gwyther SG. New Guidelines to Evaluate the Response to Treatment in Solid Tumors. Journal of the National Cancer Institute 2000; 92(3):205-216).",
            "identifier": "C124414",
            "notation": "RECIST 1.0",
            "pref_label": "Response Evaluation Criteria in Solid Tumors Version 1.0",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C124298-C124414"
        },
        {
            "definition": "Response Evaluation Criteria in Solid Tumors (RECIST) version 1.1 (E.A. Eisenhauer, P. Therasse, J. Bogaerts, L.H. Schwartz, D. Sargent, R. Ford, J. Dancey, S. Arbuck, S. Gwyther, M. Mooney, L. Rubinstein, L. Shankar, L. Dodd, R. Kaplan, D. Lacombe, J. Verweij. New response evaluation criteria in solid tumours; Revised RECIST guideline (version 1.1). European Journal of Cancer 2009; 45:228-247).",
            "identifier": "C124415",
            "notation": "RECIST 1.1",
            "pref_label": "Response Evaluation Criteria in Solid Tumors Version 1.1",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C124298-C124415"
        },
        {
            "definition": "Assessing tumor response and detecting recurrence in metastatic renal cell carcinoma on targeted therapy: importance of size and attenuation on contrast-enhanced CT. (Smith AD, Lieber ML, Shah SN. Assessing tumor response and detecting recurrence in metastatic renal cell carcinoma on targeted therapy: importance of size and attenuation on contrast-enhanced CT. AJR Am J Roentgenol. 2010 Jan;194(1):157-65.)",
            "identifier": "C126045",
            "notation": "SACT",
            "pref_label": "Size and Attenuation CT Criteria",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C124298-C126045"
        },
        {
            "definition": "End Points and Outcomes in Castration-Resistant Prostate Cancer: From Clinical Trials to Clinical Practice. (Scher HI, Morris MJ, Basch E, Heller G. End Points and Outcomes in Castration-Resistant Prostate Cancer: From Clinical Trials to Clinical Practice. J Clin Oncol. 2011 Sep 20;29(27):3695-704.)",
            "identifier": "C126046",
            "notation": "SCHER PROSTATE CANCER 2011",
            "pref_label": "Scher Prostate Cancer 2011 Oncology Response Criteria",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C124298-C126046"
        },
        {
            "definition": "The Role of 18F-FDG PET in Assessing Therapy Response in Cancer of the Cervix and Ovaries. (Schwarz JK, Grigsby PW, Dehdashti F, Delbeke D. The Role of 18F-FDG PET in Assessing Therapy Response in Cancer of the Cervix and Ovaries. J Nucl Med. 2009 May;50 Suppl 1:64S-73S.)",
            "identifier": "C126047",
            "notation": "SCHWARZ CERVICAL CANCER 2009",
            "pref_label": "Schwarz Cervical Cancer 2009 Oncology Response Criteria",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C124298-C126047"
        },
        {
            "definition": "Non-Size-Based Response Criteria to Preoperative Chemotherapy in Patients With Colorectal Liver Metastases: The Morphologic Response Criteria. (Shindoh J, Chun YS, Loyer EM, Vauthey JN. Non-Size-Based Response Criteria to Preoperative Chemotherapy in Patients With Colorectal Liver Metastases: The Morphologic Response Criteria. Curr Colorectal Cancer Rep. 2013 Jun 1;9(2):198-202.)",
            "identifier": "C126048",
            "notation": "SHINDOH COLORECTAL CANCER 2013",
            "pref_label": "Shindoh Colorectal Cancer 2013 Oncology Response Criteria",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C124298-C126048"
        },
        {
            "definition": "123I-MIBG scintigraphy in neuroblastoma: development of a SIOPEN semi-quantitative reporting, method by an international panel. (Lewington V., Lambert B., Poetschger U., Bar Sever Z., Giammarile F., McEwan A.J.B., Rita Castellani R., Lynch T., Shulkin B., Drobics M., Staudenherz A., Landenstein R. 123I-MIBG scintigraphy in neuroblastoma: development of a SIOPEN semi-quantitative reporting, method by an international panel. J Nucl Med Mol Imaging. 2017 Feb;44(2):234-241.)",
            "identifier": "C179784",
            "notation": "SIOPEN LEWINGTON NEUROBLASTOMA 2017",
            "pref_label": "SIOPEN Lewington Neuroblastoma 2017 Oncology Response Criteria",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C124298-C179784"
        },
        {
            "definition": "Definition, Prognostic Factors, Treatment, and Response Criteria of Adult T-Cell Leukemia-Lymphoma: A Proposal From an International Consensus Meeting. (Tsukasaki K, Hermine O, Bazarbachi A, Ratner L, Ramos JC, Harrington W Jr, O'Mahony D, Janik JE, Bittencourt AL, Taylor GP, Yamaguchi K, Utsunomiya A, Tobinai K, Watanabe T. Definition, Prognostic Factors, Treatment, and Response Criteria of Adult T-Cell Leukemia-Lymphoma: A Proposal From an International Consensus Meeting. J Clin Oncol. 2009 Jan 20;27(3):453-9.)",
            "identifier": "C126049",
            "notation": "TSUKASAKI LEUKEMIA LYMPHOMA 2009",
            "pref_label": "Tsukasaki Leukemia Lymphoma 2009 Oncology Response Criteria",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C124298-C126049"
        },
        {
            "definition": "Not stated explicitly or in detail.",
            "identifier": "C38046",
            "notation": "UNSPECIFIED",
            "pref_label": "Unspecified",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C124298-C38046"
        },
        {
            "definition": "Guidelines for Management of Breast Cancer. (WHO (2006). Guidelines for Management of Breast Cancer. Retrieved from http://applications.emro.who.int/dsaf/dsa697.pdf)",
            "identifier": "C126050",
            "notation": "WHO BREAST CANCER 2006",
            "pref_label": "Guidelines for Management of Breast Cancer WHO 2006",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C124298-C126050"
        },
        {
            "alt_label": "irRC",
            "definition": "Guidelines for the Evaluation of Immune Therapy Activity in Solid Tumors: Immune-Related Response Criteria. (Wolchok JD, Hoos A, O'Day S, Weber JS, Hamid O, Lebbe C, Maio M, Binder M, Bohnsack O, Nichol G, Humphrey R, Hodi FS. Guidelines for the Evaluation of Immune Therapy Activity in Solid Tumors: Immune-Related Response Criteria. Clin Cancer Res. 2009 Dec 1;15(23):7412-20.)",
            "identifier": "C126051",
            "notation": "WOLCHOK SOLID TUMORS 2009",
            "pref_label": "Wolchok Solid Tumors 2009 Oncology Response Criteria",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C124298-C126051"
        }
    ]
}