{
    "SKOS_CONCEPT": [
        {
            "alt_label": "CRQ02-Feeling Emotional",
            "definition": "Chronic Respiratory Questionnaire Self-Administered Standardized Format (CRQ-SAS) Follow-up Administration Version - Feeling emotional such as angry or upset.",
            "identifier": "C121030",
            "notation": "CRQ0201",
            "pref_label": "CRQ-SAS Follow-Up Administration Version - Feeling Emotional",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C120981-C121030"
        },
        {
            "alt_label": "CRQ02-Take Care of Basic Needs",
            "definition": "Chronic Respiratory Questionnaire Self-Administered Standardized Format (CRQ-SAS) Follow-up Administration Version - Taking care of your basic needs.",
            "identifier": "C121031",
            "notation": "CRQ0202",
            "pref_label": "CRQ-SAS Follow-Up Administration Version - Take Care of Basic Needs",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C120981-C121031"
        },
        {
            "alt_label": "CRQ02-Walking",
            "definition": "Chronic Respiratory Questionnaire Self-Administered Standardized Format (CRQ-SAS) Follow-up Administration Version - Walking.",
            "identifier": "C121032",
            "notation": "CRQ0203",
            "pref_label": "CRQ-SAS Follow-Up Administration Version - Walking",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C120981-C121032"
        },
        {
            "alt_label": "CRQ02-Performing Chores",
            "definition": "Chronic Respiratory Questionnaire Self-Administered Standardized Format (CRQ-SAS) Follow-up Administration Version - Performing chores.",
            "identifier": "C121033",
            "notation": "CRQ0204",
            "pref_label": "CRQ-SAS Follow-Up Administration Version - Performing Chores",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C120981-C121033"
        },
        {
            "alt_label": "CRQ02-Participate in Social Activities",
            "definition": "Chronic Respiratory Questionnaire Self-Administered Standardized Format (CRQ-SAS) Follow-up Administration Version - Participating in social activities.",
            "identifier": "C121034",
            "notation": "CRQ0205",
            "pref_label": "CRQ-SAS Follow-Up Administration Version - Participate in Social Activities",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C120981-C121034"
        },
        {
            "alt_label": "CRQ02-Felt Frustrated or Impatient",
            "definition": "Chronic Respiratory Questionnaire Self-Administered Standardized Format (CRQ-SAS) Follow-up Administration Version - In general, how much of the time during the last 2 weeks have you felt frustrated or impatient?",
            "identifier": "C121035",
            "notation": "CRQ0206",
            "pref_label": "CRQ-SAS Follow-Up Administration Version - Felt Frustrated or Impatient",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C120981-C121035"
        },
        {
            "alt_label": "CRQ02-Feeling of Fear or Panic",
            "definition": "Chronic Respiratory Questionnaire Self-Administered Standardized Format (CRQ-SAS) Follow-up Administration Version - How often during the last 2 weeks did you have a feeling of fear or panic when you had difficulty getting your breath?",
            "identifier": "C121036",
            "notation": "CRQ0207",
            "pref_label": "CRQ-SAS Follow-Up Administration Version - Feeling of Fear or Panic",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C120981-C121036"
        },
        {
            "alt_label": "CRQ02-Fatigue",
            "definition": "Chronic Respiratory Questionnaire Self-Administered Standardized Format (CRQ-SAS) Follow-up Administration Version - How about fatigue? How tired have you felt over the last 2 weeks?",
            "identifier": "C121037",
            "notation": "CRQ0208",
            "pref_label": "CRQ-SAS Follow-Up Administration Version - Fatigue",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C120981-C121037"
        },
        {
            "alt_label": "CRQ02-Embarrassed by Coughing",
            "definition": "Chronic Respiratory Questionnaire Self-Administered Standardized Format (CRQ-SAS) Follow-up Administration Version - How often during the last 2 weeks have you felt embarrassed by your coughing or heavy breathing?",
            "identifier": "C121038",
            "notation": "CRQ0209",
            "pref_label": "CRQ-SAS Follow-Up Administration Version - Embarrassed by Coughing",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C120981-C121038"
        },
        {
            "alt_label": "CRQ02-Confident to Deal With Illness",
            "definition": "Chronic Respiratory Questionnaire Self-Administered Standardized Format (CRQ-SAS) Follow-up Administration Version - In the last 2 weeks, how much of the time did you feel very confident and sure that you could deal with your illness?",
            "identifier": "C121039",
            "notation": "CRQ0210",
            "pref_label": "CRQ-SAS Follow-Up Administration Version - Feel Confident to Deal With Illness",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C120981-C121039"
        },
        {
            "alt_label": "CRQ02-Energy",
            "definition": "Chronic Respiratory Questionnaire Self-Administered Standardized Format (CRQ-SAS) Follow-up Administration Version - How much energy have you had in the last 2 weeks?",
            "identifier": "C121040",
            "notation": "CRQ0211",
            "pref_label": "CRQ-SAS Follow-Up Administration Version - Energy",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C120981-C121040"
        },
        {
            "alt_label": "CRQ02-Feel Upset, Worried or Depressed",
            "definition": "Chronic Respiratory Questionnaire Self-Administered Standardized Format (CRQ-SAS) Follow-up Administration Version - In general, how much of the time did you feel upset, worried, or depressed during the last 2 weeks?",
            "identifier": "C121041",
            "notation": "CRQ0212",
            "pref_label": "CRQ-SAS Follow-Up Administration Version - Feel Upset, Worried or Depressed",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C120981-C121041"
        },
        {
            "alt_label": "CRQ02-Control of Breathing Problems",
            "definition": "Chronic Respiratory Questionnaire Self-Administered Standardized Format (CRQ-SAS) Follow-up Administration Version - How often during the last 2 weeks did you feel you had complete control of your breathing problems?",
            "identifier": "C121042",
            "notation": "CRQ0213",
            "pref_label": "CRQ-SAS Follow-Up Administration Version - Had Control of Breathing Problems",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C120981-C121042"
        },
        {
            "alt_label": "CRQ02-Feel Relaxed and Free of Tension",
            "definition": "Chronic Respiratory Questionnaire Self-Administered Standardized Format (CRQ-SAS) Follow-up Administration Version - How much of the time during the last 2 weeks did you feel relaxed and free of tension?",
            "identifier": "C121043",
            "notation": "CRQ0214",
            "pref_label": "CRQ-SAS Follow-Up Administration Version - Feel Relaxed and Free of Tension",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C120981-C121043"
        },
        {
            "alt_label": "CRQ02-Felt Low in Energy",
            "definition": "Chronic Respiratory Questionnaire Self-Administered Standardized Format (CRQ-SAS) Follow-up Administration Version - How often during the last 2 weeks have you felt low in energy?",
            "identifier": "C121044",
            "notation": "CRQ0215",
            "pref_label": "CRQ-SAS Follow-Up Administration Version - Felt Low in Energy",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C120981-C121044"
        },
        {
            "alt_label": "CRQ02-Felt Discouraged or Down",
            "definition": "Chronic Respiratory Questionnaire Self-Administered Standardized Format (CRQ-SAS) Follow-up Administration Version - In general, how often during the last 2 weeks have you felt discouraged or down in the dumps?",
            "identifier": "C121045",
            "notation": "CRQ0216",
            "pref_label": "CRQ-SAS Follow-Up Administration Version - Felt Discouraged or Down",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C120981-C121045"
        },
        {
            "alt_label": "CRQ02-Felt Worn Out or Sluggish",
            "definition": "Chronic Respiratory Questionnaire Self-Administered Standardized Format (CRQ-SAS) Follow-up Administration Version - How often during the last 2 weeks have you felt worn out or sluggish?",
            "identifier": "C121046",
            "notation": "CRQ0217",
            "pref_label": "CRQ-SAS Follow-Up Administration Version - Felt Worn Out or Sluggish",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C120981-C121046"
        },
        {
            "alt_label": "CRQ02-Happy, Satisfied or Pleased",
            "definition": "Chronic Respiratory Questionnaire Self-Administered Standardized Format (CRQ-SAS) Follow-up Administration Version - How happy, satisfied, or pleased have you been with your personal life during the last 2 weeks?",
            "identifier": "C121047",
            "notation": "CRQ0218",
            "pref_label": "CRQ-SAS Follow-Up Administration Version - Happy, Satisfied or Pleased With Life",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C120981-C121047"
        },
        {
            "alt_label": "CRQ02-Feel Upset Diff Getting Breath",
            "definition": "Chronic Respiratory Questionnaire Self-Administered Standardized Format (CRQ-SAS) Follow-up Administration Version - How often during the last 2 weeks did you feel upset or scared when you had difficulty getting your breath?",
            "identifier": "C121048",
            "notation": "CRQ0219",
            "pref_label": "CRQ-SAS Follow-Up Administration Version - Feel Upset When Had Difficulty Getting Breath",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C120981-C121048"
        },
        {
            "alt_label": "CRQ02-Felt Restless, Tense or Uptight",
            "definition": "Chronic Respiratory Questionnaire Self-Administered Standardized Format (CRQ-SAS) Follow-up Administration Version - In general, how often during the last 2 weeks have you felt restless, tense, or uptight?",
            "identifier": "C121049",
            "notation": "CRQ0220",
            "pref_label": "CRQ-SAS Follow-Up Administration Version - Felt Restless, Tense or Uptight",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C120981-C121049"
        }
    ]
}