{
    "SKOS_CONCEPT": [
        {
            "alt_label": "PODCI2-Ability Do Same Things Friends Do",
            "definition": "Pediatric Outcomes Data Collection Instrument, Adolescent Parent-Reported - During the last week, how happy has your child been with: His/her ability to do the same things his/her friends do?",
            "identifier": "C136046",
            "notation": "PODCI2-Ability Do Same Things Friends Do",
            "pref_label": "PODCI Adolescent Parent-Reported Version - Ability Do Same Things Friends Do",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C135695-C136046"
        },
        {
            "alt_label": "PODCI2-Able to Do Activities at Home",
            "definition": "Pediatric Outcomes Data Collection Instrument, Adolescent Parent-Reported - As a result of my child's treatment, I expect my child: To be able to do activities at home.",
            "identifier": "C136114",
            "notation": "PODCI2-Able to Do Activities at Home",
            "pref_label": "PODCI Adolescent Parent-Reported Version - Able to Do Activities at Home",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C135695-C136114"
        },
        {
            "alt_label": "PODCI2-Able to Do More at School",
            "definition": "Pediatric Outcomes Data Collection Instrument, Adolescent Parent-Reported - As a result of my child's treatment, I expect my child: To be able to do more at school.",
            "identifier": "C136115",
            "notation": "PODCI2-Able to Do More at School",
            "pref_label": "PODCI Adolescent Parent-Reported Version - Able to Do More at School",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C135695-C136115"
        },
        {
            "alt_label": "PODCI2-Able to Do More Play",
            "definition": "Pediatric Outcomes Data Collection Instrument, Adolescent Parent-Reported - As a result of my child's treatment, I expect my child: To be able to do more play or recreational activities.",
            "identifier": "C136116",
            "notation": "PODCI2-Able to Do More Play",
            "pref_label": "PODCI Adolescent Parent-Reported Version - Able to Do More Play",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C135695-C136116"
        },
        {
            "alt_label": "PODCI2-Able to Do More Sports",
            "definition": "Pediatric Outcomes Data Collection Instrument, Adolescent Parent-Reported - As a result of my child's treatment, I expect my child: To be able to do more sports.",
            "identifier": "C136117",
            "notation": "PODCI2-Able to Do More Sports",
            "pref_label": "PODCI Adolescent Parent-Reported Version - Able to Do More Sports",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C135695-C136117"
        },
        {
            "alt_label": "PODCI2-Bend Over and Pick Up Something",
            "definition": "Pediatric Outcomes Data Collection Instrument, Adolescent Parent-Reported - During the last week, has it been easy or hard for your child to: Bend over from a standing position and pick up something off the floor?",
            "identifier": "C136066",
            "notation": "PODCI2-Bend Over and Pick Up Something",
            "pref_label": "PODCI Adolescent Parent-Reported Version - Bend Over and Pick Up Something",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C135695-C136066"
        },
        {
            "alt_label": "PODCI2-Bicycle or Tricycle",
            "definition": "Pediatric Outcomes Data Collection Instrument, Adolescent Parent-Reported - During the last week, has it been easy or hard for your child to: Bicycle or tricycle?",
            "identifier": "C136052",
            "notation": "PODCI2-Bicycle or Tricycle",
            "pref_label": "PODCI Adolescent Parent-Reported Version - Bicycle or Tricycle",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C135695-C136052"
        },
        {
            "alt_label": "PODCI2-Button Buttons",
            "definition": "Pediatric Outcomes Data Collection Instrument, Adolescent Parent-Reported - During the last week, was it easy or hard for your child to: Button buttons?",
            "identifier": "C136039",
            "notation": "PODCI2-Button Buttons",
            "pref_label": "PODCI Adolescent Parent-Reported Version - Button Buttons",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C135695-C136039"
        },
        {
            "alt_label": "PODCI2-Climb One Flight of Stairs",
            "definition": "Pediatric Outcomes Data Collection Instrument, Adolescent Parent-Reported - During the last week, has it been easy or hard for your child to: Climb one flight of stairs?",
            "identifier": "C136054",
            "notation": "PODCI2-Climb One Flight of Stairs",
            "pref_label": "PODCI Adolescent Parent-Reported Version - Climb One Flight of Stairs",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C135695-C136054"
        },
        {
            "alt_label": "PODCI2-Climb Three Flights of Stairs",
            "definition": "Pediatric Outcomes Data Collection Instrument, Adolescent Parent-Reported - During the last week, has it been easy or hard for your child to: Climb three flights of stairs?",
            "identifier": "C136053",
            "notation": "PODCI2-Climb Three Flights of Stairs",
            "pref_label": "PODCI Adolescent Parent-Reported Version - Climb Three Flights of Stairs",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C135695-C136053"
        },
        {
            "alt_label": "PODCI2-Comb His/Her Hair",
            "definition": "Pediatric Outcomes Data Collection Instrument, Adolescent Parent-Reported - During the last week, was it easy or hard for your child to: Comb his/her hair?",
            "identifier": "C136038",
            "notation": "PODCI2-Comb His/Her Hair",
            "pref_label": "PODCI Adolescent Parent-Reported Version - Comb His or Her Hair",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C135695-C136038"
        },
        {
            "alt_label": "PODCI2-Comp Sports Limited by: Dislike",
            "definition": "Pediatric Outcomes Data Collection Instrument, Adolescent Parent-Reported - If you answered \"no\" to Question 52 above, was your child's activity limited by: Dislike of pickup games or sports?",
            "identifier": "C136090",
            "notation": "PODCI2-Comp Sports Limited by: Dislike",
            "pref_label": "PODCI Adolescent Parent-Reported Version - Competitive Sports Limited by: Dislike",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C135695-C136090"
        },
        {
            "alt_label": "PODCI2-Comp Sports Limited by: Fear",
            "definition": "Pediatric Outcomes Data Collection Instrument, Adolescent Parent-Reported - If you answered \"no\" to Question 52 above, was your child's activity limited by: Fear the other kids won't like him/her?",
            "identifier": "C136089",
            "notation": "PODCI2-Comp Sports Limited by: Fear",
            "pref_label": "PODCI Adolescent Parent-Reported Version - Competitive Sports Limited by: Fear",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C135695-C136089"
        },
        {
            "alt_label": "PODCI2-Comp Sports Limited by: Health",
            "definition": "Pediatric Outcomes Data Collection Instrument, Adolescent Parent-Reported - If you answered \"no\" to Question 52 above, was your child's activity limited by: General health?",
            "identifier": "C136087",
            "notation": "PODCI2-Comp Sports Limited by: Health",
            "pref_label": "PODCI Adolescent Parent-Reported Version - Competitive Sports Limited by: Health",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C135695-C136087"
        },
        {
            "alt_label": "PODCI2-Comp Sports Limited by: Instruct",
            "definition": "Pediatric Outcomes Data Collection Instrument, Adolescent Parent-Reported - If you answered \"no\" to Question 52 above, was your child's activity limited by: Doctor or parent instructions?",
            "identifier": "C136088",
            "notation": "PODCI2-Comp Sports Limited by: Instruct",
            "pref_label": "PODCI Adolescent Parent-Reported Version - Competitive Sports Limited by: Instructions",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C135695-C136088"
        },
        {
            "alt_label": "PODCI2-Comp Sports Limited by: Pain",
            "definition": "Pediatric Outcomes Data Collection Instrument, Adolescent Parent-Reported - If you answered \"no\" to Question 52 above, was your child's activity limited by: Pain?",
            "identifier": "C136086",
            "notation": "PODCI2-Comp Sports Limited by: Pain",
            "pref_label": "PODCI Adolescent Parent-Reported Version - Competitive Sports Limited by: Pain",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C135695-C136086"
        },
        {
            "alt_label": "PODCI2-Comp Sports Limited by: Season",
            "definition": "Pediatric Outcomes Data Collection Instrument, Adolescent Parent-Reported - If you answered \"no\" to Question 52 above, was your child's activity limited by: Activity not in season?",
            "identifier": "C136092",
            "notation": "PODCI2-Comp Sports Limited by: Season",
            "pref_label": "PODCI Adolescent Parent-Reported Version - Competitive Sports Limited by: Season",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C135695-C136092"
        },
        {
            "alt_label": "PODCI2-Comp Sports Limited by: Too Young",
            "definition": "Pediatric Outcomes Data Collection Instrument, Adolescent Parent-Reported - If you answered \"no\" to Question 52 above, was your child's activity limited by: Too young?",
            "identifier": "C136091",
            "notation": "PODCI2-Comp Sports Limited by: Too Young",
            "pref_label": "PODCI Adolescent Parent-Reported Version - Competitive Sports Limited by: Too Young",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C135695-C136091"
        },
        {
            "alt_label": "PODCI2-Easy to Make Friends",
            "definition": "Pediatric Outcomes Data Collection Instrument, Adolescent Parent-Reported - Is it easy or hard for your child to make friends with children his/her own age?",
            "identifier": "C136107",
            "notation": "PODCI2-Easy to Make Friends",
            "pref_label": "PODCI Adolescent Parent-Reported Version - Easy to Make Friends",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C135695-C136107"
        },
        {
            "alt_label": "PODCI2-Feel Better",
            "definition": "Pediatric Outcomes Data Collection Instrument, Adolescent Parent-Reported - As a result of my child's treatment, I expect my child: To feel better about himself/herself.",
            "identifier": "C136112",
            "notation": "PODCI2-Feel Better",
            "pref_label": "PODCI Adolescent Parent-Reported Version - Feel Better",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C135695-C136112"
        },
        {
            "alt_label": "PODCI2-Feel Sick and Tired",
            "definition": "Pediatric Outcomes Data Collection Instrument, Adolescent Parent-Reported - During the last week, how much of the time: Did your child feel sick and tired?",
            "identifier": "C136048",
            "notation": "PODCI2-Feel Sick and Tired",
            "pref_label": "PODCI Adolescent Parent-Reported Version - Feel Sick and Tired",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C135695-C136048"
        },
        {
            "alt_label": "PODCI2-Free From Pain as Adult",
            "definition": "Pediatric Outcomes Data Collection Instrument, Adolescent Parent-Reported - As a result of my child's treatment, I expect my child: To be free from pain or disability as an adult.",
            "identifier": "C136118",
            "notation": "PODCI2-Free From Pain as Adult",
            "pref_label": "PODCI Adolescent Parent-Reported Version - Free From Pain as Adult",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C135695-C136118"
        },
        {
            "alt_label": "PODCI2-Friends Limited by: Fear",
            "definition": "Pediatric Outcomes Data Collection Instrument, Adolescent Parent-Reported - If you answered \"sometimes\" or \"never or rarely\" to Question 60 above, was your child's activity limited by: Fear the other kids won't like him/her?",
            "identifier": "C136097",
            "notation": "PODCI2-Friends Limited by: Fear",
            "pref_label": "PODCI Adolescent Parent-Reported Version - Friends Limited by: Fear",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C135695-C136097"
        },
        {
            "alt_label": "PODCI2-Friends Limited by: Health",
            "definition": "Pediatric Outcomes Data Collection Instrument, Adolescent Parent-Reported - If you answered \"sometimes\" or \"never or rarely\" to Question 60 above, was your child's activity limited by: General health?",
            "identifier": "C136095",
            "notation": "PODCI2-Friends Limited by: Health",
            "pref_label": "PODCI Adolescent Parent-Reported Version - Friends Limited by: Health",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C135695-C136095"
        },
        {
            "alt_label": "PODCI2-Friends Limited by: Instructions",
            "definition": "Pediatric Outcomes Data Collection Instrument, Adolescent Parent-Reported - If you answered \"sometimes\" or \"never or rarely\" to Question 60 above, was your child's activity limited by: Doctor or parent instructions?",
            "identifier": "C136096",
            "notation": "PODCI2-Friends Limited by: Instructions",
            "pref_label": "PODCI Adolescent Parent-Reported Version - Friends Limited by: Instructions",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C135695-C136096"
        },
        {
            "alt_label": "PODCI2-Friends Limited by: Not Around",
            "definition": "Pediatric Outcomes Data Collection Instrument, Adolescent Parent-Reported - If you answered \"sometimes\" or \"never or rarely\" to Question 60 above, was your child's activity limited by: Friends not around?",
            "identifier": "C136098",
            "notation": "PODCI2-Friends Limited by: Not Around",
            "pref_label": "PODCI Adolescent Parent-Reported Version - Friends Limited by: Not Around",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C135695-C136098"
        },
        {
            "alt_label": "PODCI2-Friends Limited by: Pain",
            "definition": "Pediatric Outcomes Data Collection Instrument, Adolescent Parent-Reported - If you answered \"sometimes\" or \"never or rarely\" to Question 60 above, was your child's activity limited by: Pain?",
            "identifier": "C136094",
            "notation": "PODCI2-Friends Limited by: Pain",
            "pref_label": "PODCI Adolescent Parent-Reported Version - Friends Limited by: Pain",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C135695-C136094"
        },
        {
            "alt_label": "PODCI2-Full of Pep and Energy",
            "definition": "Pediatric Outcomes Data Collection Instrument, Adolescent Parent-Reported - During the last week, how much of the time: Were your child full of pep and energy?",
            "identifier": "C136049",
            "notation": "PODCI2-Full of Pep and Energy",
            "pref_label": "PODCI Adolescent Parent-Reported Version - Full of Pep and Energy",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C135695-C136049"
        },
        {
            "alt_label": "PODCI2-Games Limited by: Dislike",
            "definition": "Pediatric Outcomes Data Collection Instrument, Adolescent Parent-Reported - If you answered \"no\" to Question 44 above, was your child's activity limited by: Dislike of pickup games or sports?",
            "identifier": "C136082",
            "notation": "PODCI2-Games Limited by: Dislike",
            "pref_label": "PODCI Adolescent Parent-Reported Version - Games Limited by: Dislike",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C135695-C136082"
        },
        {
            "alt_label": "PODCI2-Games Limited by: Fear",
            "definition": "Pediatric Outcomes Data Collection Instrument, Adolescent Parent-Reported - If you answered \"no\" to Question 44 above, was your child's activity limited by: Fear the other kids won't like him/her?",
            "identifier": "C136081",
            "notation": "PODCI2-Games Limited by: Fear",
            "pref_label": "PODCI Adolescent Parent-Reported Version - Games Limited by: Fear",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C135695-C136081"
        },
        {
            "alt_label": "PODCI2-Games Limited by: Health",
            "definition": "Pediatric Outcomes Data Collection Instrument, Adolescent Parent-Reported - If you answered \"no\" to Question 44 above, was your child's activity limited by: General health?",
            "identifier": "C136079",
            "notation": "PODCI2-Games Limited by: Health",
            "pref_label": "PODCI Adolescent Parent-Reported Version - Games Limited by: Health",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C135695-C136079"
        },
        {
            "alt_label": "PODCI2-Games Limited by: Instructions",
            "definition": "Pediatric Outcomes Data Collection Instrument, Adolescent Parent-Reported - If you answered \"no\" to Question 44 above, was your child's activity limited by: Doctor or parent instructions?",
            "identifier": "C136080",
            "notation": "PODCI2-Games Limited by: Instructions",
            "pref_label": "PODCI Adolescent Parent-Reported Version - Games Limited by: Instructions",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C135695-C136080"
        },
        {
            "alt_label": "PODCI2-Games Limited by: Pain",
            "definition": "Pediatric Outcomes Data Collection Instrument, Adolescent Parent-Reported - If you answered \"no\" to Question 44 above, was your child's activity limited by: Pain?",
            "identifier": "C136078",
            "notation": "PODCI2-Games Limited by: Pain",
            "pref_label": "PODCI Adolescent Parent-Reported Version - Games Limited by: Pain",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C135695-C136078"
        },
        {
            "alt_label": "PODCI2-Games Limited by: Season",
            "definition": "Pediatric Outcomes Data Collection Instrument, Adolescent Parent-Reported - If you answered \"no\" to Question 44 above, was your child's activity limited by: Activity not in season?",
            "identifier": "C136084",
            "notation": "PODCI2-Games Limited by: Season",
            "pref_label": "PODCI Adolescent Parent-Reported Version - Games Limited by: Season",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C135695-C136084"
        },
        {
            "alt_label": "PODCI2-Games Limited by: Too Young",
            "definition": "Pediatric Outcomes Data Collection Instrument, Adolescent Parent-Reported - If you answered \"no\" to Question 44 above, was your child's activity limited by: Too young?",
            "identifier": "C136083",
            "notation": "PODCI2-Games Limited by: Too Young",
            "pref_label": "PODCI Adolescent Parent-Reported Version - Games Limited by: Too Young",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C135695-C136083"
        },
        {
            "alt_label": "PODCI2-Get In and Out of Bed",
            "definition": "Pediatric Outcomes Data Collection Instrument, Adolescent Parent-Reported - During the last week, has it been easy or hard for your child to: Get in and out of bed?",
            "identifier": "C136064",
            "notation": "PODCI2-Get In and Out of Bed",
            "pref_label": "PODCI Adolescent Parent-Reported Version - Get In and Out of Bed",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C135695-C136064"
        },
        {
            "alt_label": "PODCI2-Get On and Off a Bus",
            "definition": "Pediatric Outcomes Data Collection Instrument, Adolescent Parent-Reported - During the last week, has it been easy or hard for your child to: Get on and off a bus?",
            "identifier": "C136058",
            "notation": "PODCI2-Get On and Off a Bus",
            "pref_label": "PODCI Adolescent Parent-Reported Version - Get On and Off a Bus",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C135695-C136058"
        },
        {
            "alt_label": "PODCI2-Get On and Off a Toilet or Chair",
            "definition": "Pediatric Outcomes Data Collection Instrument, Adolescent Parent-Reported - During the last week, has it been easy or hard for your child to: Get on and off a toilet or chair?",
            "identifier": "C136063",
            "notation": "PODCI2-Get On and Off a Toilet or Chair",
            "pref_label": "PODCI Adolescent Parent-Reported Version - Get On and Off a Toilet or Chair",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C135695-C136063"
        },
        {
            "alt_label": "PODCI2-Get Together With Friends",
            "definition": "Pediatric Outcomes Data Collection Instrument, Adolescent Parent-Reported - How often in the last week did your child get together and do things with friends?",
            "identifier": "C136093",
            "notation": "PODCI2-Get Together With Friends",
            "pref_label": "PODCI Adolescent Parent-Reported Version - Get Together With Friends",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C135695-C136093"
        },
        {
            "alt_label": "PODCI2-Global Functioning Scale",
            "definition": "Pediatric Outcomes Data Collection Instrument, Adolescent Parent-Reported - Global functioning scale.",
            "identifier": "C136125",
            "notation": "PODCI2-Global Functioning Scale",
            "pref_label": "PODCI Adolescent Parent-Reported Version - Global Functioning Scale",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C135695-C136125"
        },
        {
            "alt_label": "PODCI2-Gym Limited by: Dislike",
            "definition": "Pediatric Outcomes Data Collection Instrument, Adolescent Parent-Reported - If you answered \"sometimes\" or \"never or rarely\" to Question 66 above, was your child's activity limited by: Dislike of gym/recess?",
            "identifier": "C136104",
            "notation": "PODCI2-Gym Limited by: Dislike",
            "pref_label": "PODCI Adolescent Parent-Reported Version - Gym Limited by: Dislike",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C135695-C136104"
        },
        {
            "alt_label": "PODCI2-Gym Limited by: Fear",
            "definition": "Pediatric Outcomes Data Collection Instrument, Adolescent Parent-Reported - If you answered \"sometimes\" or \"never or rarely\" to Question 66 above, was your child's activity limited by: Fear the other kids won't like him/her?",
            "identifier": "C136103",
            "notation": "PODCI2-Gym Limited by: Fear",
            "pref_label": "PODCI Adolescent Parent-Reported Version - Gym Limited by: Fear",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C135695-C136103"
        },
        {
            "alt_label": "PODCI2-Gym Limited by: Health",
            "definition": "Pediatric Outcomes Data Collection Instrument, Adolescent Parent-Reported - If you answered \"sometimes\" or \"never or rarely\" to Question 66 above, was your child's activity limited by: General health?",
            "identifier": "C136101",
            "notation": "PODCI2-Gym Limited by: Health",
            "pref_label": "PODCI Adolescent Parent-Reported Version - Gym Limited by: Health",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C135695-C136101"
        },
        {
            "alt_label": "PODCI2-Gym Limited by: Instructions",
            "definition": "Pediatric Outcomes Data Collection Instrument, Adolescent Parent-Reported - If you answered \"sometimes\" or \"never or rarely\" to Question 66 above, was your child's activity limited by: Doctor or parent instructions?",
            "identifier": "C136102",
            "notation": "PODCI2-Gym Limited by: Instructions",
            "pref_label": "PODCI Adolescent Parent-Reported Version - Gym Limited by: Instructions",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C135695-C136102"
        },
        {
            "alt_label": "PODCI2-Gym Limited by: Not Attend School",
            "definition": "Pediatric Outcomes Data Collection Instrument, Adolescent Parent-Reported - If you answered \"sometimes\" or \"never or rarely\" to Question 66 above, was your child's activity limited by: Does not attend school?",
            "identifier": "C136106",
            "notation": "PODCI2-Gym Limited by: Not Attend School",
            "pref_label": "PODCI Adolescent Parent-Reported Version - Gym Limited by: Not Attend School",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C135695-C136106"
        },
        {
            "alt_label": "PODCI2-Gym Limited by: Not in Session",
            "definition": "Pediatric Outcomes Data Collection Instrument, Adolescent Parent-Reported - If you answered \"sometimes\" or \"never or rarely\" to Question 66 above, was your child's activity limited by: School not in session?",
            "identifier": "C136105",
            "notation": "PODCI2-Gym Limited by: Not in Session",
            "pref_label": "PODCI Adolescent Parent-Reported Version - Gym Limited by: Not in Session",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C135695-C136105"
        },
        {
            "alt_label": "PODCI2-Gym Limited by: Pain",
            "definition": "Pediatric Outcomes Data Collection Instrument, Adolescent Parent-Reported - If you answered \"sometimes\" or \"never or rarely\" to Question 66 above, was your child's activity limited by: Pain?",
            "identifier": "C136100",
            "notation": "PODCI2-Gym Limited by: Pain",
            "pref_label": "PODCI Adolescent Parent-Reported Version - Gym Limited by: Pain",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C135695-C136100"
        },
        {
            "alt_label": "PODCI2-Happiness Scale",
            "definition": "Pediatric Outcomes Data Collection Instrument, Adolescent Parent-Reported - Happiness core scale.",
            "identifier": "C136124",
            "notation": "PODCI2-Happiness Scale",
            "pref_label": "PODCI Adolescent Parent-Reported Version - Happiness Scale",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C135695-C136124"
        },
        {
            "alt_label": "PODCI2-Have Pain Relief",
            "definition": "Pediatric Outcomes Data Collection Instrument, Adolescent Parent-Reported - As a result of my child's treatment, I expect my child: To have pain relief.",
            "identifier": "C136110",
            "notation": "PODCI2-Have Pain Relief",
            "pref_label": "PODCI Adolescent Parent-Reported Version - Have Pain Relief",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C135695-C136110"
        },
        {
            "alt_label": "PODCI2-His/Her Body",
            "definition": "Pediatric Outcomes Data Collection Instrument, Adolescent Parent-Reported - During the last week, how happy has your child been with: His/her body?",
            "identifier": "C136044",
            "notation": "PODCI2-His/Her Body",
            "pref_label": "PODCI Adolescent Parent-Reported Version - His or Her Body",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C135695-C136044"
        },
        {
            "alt_label": "PODCI2-His/Her Health in General",
            "definition": "Pediatric Outcomes Data Collection Instrument, Adolescent Parent-Reported - During the last week, how happy has your child been with: His/her health in general?",
            "identifier": "C136047",
            "notation": "PODCI2-His/Her Health in General",
            "pref_label": "PODCI Adolescent Parent-Reported Version - His or Her Health in General",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C135695-C136047"
        },
        {
            "alt_label": "PODCI2-How He/She Looks",
            "definition": "Pediatric Outcomes Data Collection Instrument, Adolescent Parent-Reported - During the last week, how happy has your child been with: How he/she looks?",
            "identifier": "C136043",
            "notation": "PODCI2-How He/She Looks",
            "pref_label": "PODCI Adolescent Parent-Reported Version - How He or She Looks",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C135695-C136043"
        },
        {
            "alt_label": "PODCI2-Lift Heavy Books",
            "definition": "Pediatric Outcomes Data Collection Instrument, Adolescent Parent-Reported - During the last week, was it easy or hard for your child to: Lift heavy books?",
            "identifier": "C136034",
            "notation": "PODCI2-Lift Heavy Books",
            "pref_label": "PODCI Adolescent Parent-Reported Version - Lift Heavy Books",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C135695-C136034"
        },
        {
            "alt_label": "PODCI2-Look Better",
            "definition": "Pediatric Outcomes Data Collection Instrument, Adolescent Parent-Reported - As a result of my child's treatment, I expect my child: To look better.",
            "identifier": "C136111",
            "notation": "PODCI2-Look Better",
            "pref_label": "PODCI Adolescent Parent-Reported Version - Look Better",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C135695-C136111"
        },
        {
            "alt_label": "PODCI2-Miss School Because of Health",
            "definition": "Pediatric Outcomes Data Collection Instrument, Adolescent Parent-Reported - On average, over the last 12 months, how often did your child miss school (camp, etc.) because of his/her health?",
            "identifier": "C136042",
            "notation": "PODCI2-Miss School Because of Health",
            "pref_label": "PODCI Adolescent Parent-Reported Version - Miss School Because of Health",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C135695-C136042"
        },
        {
            "alt_label": "PODCI2-Need Help Sitting and Standing",
            "definition": "Pediatric Outcomes Data Collection Instrument, Adolescent Parent-Reported - How often does your child need help from another person for sitting and standing?",
            "identifier": "C136067",
            "notation": "PODCI2-Need Help Sitting and Standing",
            "pref_label": "PODCI Adolescent Parent-Reported Version - Need Help Sitting and Standing",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C135695-C136067"
        },
        {
            "alt_label": "PODCI2-Need Help Walking and Climbing",
            "definition": "Pediatric Outcomes Data Collection Instrument, Adolescent Parent-Reported - How often does your child need help from another person for walking and climbing?",
            "identifier": "C136059",
            "notation": "PODCI2-Need Help Walking and Climbing",
            "pref_label": "PODCI Adolescent Parent-Reported Version - Need Help Walking and Climbing",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C135695-C136059"
        },
        {
            "alt_label": "PODCI2-Open a Jar Been Opened Before",
            "definition": "Pediatric Outcomes Data Collection Instrument, Adolescent Parent-Reported - During the last week, was it easy or hard for your child to: Open a jar that has been opened before?",
            "identifier": "C136036",
            "notation": "PODCI2-Open a Jar Been Opened Before",
            "pref_label": "PODCI Adolescent Parent-Reported Version - Open a Jar Been Opened Before",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C135695-C136036"
        },
        {
            "alt_label": "PODCI2-Outdoor Limited by: Dislike",
            "definition": "Pediatric Outcomes Data Collection Instrument, Adolescent Parent-Reported - If you answered \"no\" to Question 36 above, was your child's activity limited by: Dislike of recreational outdoor activities?",
            "identifier": "C136074",
            "notation": "PODCI2-Outdoor Limited by: Dislike",
            "pref_label": "PODCI Adolescent Parent-Reported Version - Outdoor Limited by: Dislike",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C135695-C136074"
        },
        {
            "alt_label": "PODCI2-Outdoor Limited by: Fear",
            "definition": "Pediatric Outcomes Data Collection Instrument, Adolescent Parent-Reported - If you answered \"no\" to Question 36 above, was your child's activity limited by: Fear the other kids won't like him/her?",
            "identifier": "C136073",
            "notation": "PODCI2-Outdoor Limited by: Fear",
            "pref_label": "PODCI Adolescent Parent-Reported Version - Outdoor Limited by: Fear",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C135695-C136073"
        },
        {
            "alt_label": "PODCI2-Outdoor Limited by: Health",
            "definition": "Pediatric Outcomes Data Collection Instrument, Adolescent Parent-Reported - If you answered \"no\" to Question 36 above, was your child's activity limited by: General health?",
            "identifier": "C136071",
            "notation": "PODCI2-Outdoor Limited by: Health",
            "pref_label": "PODCI Adolescent Parent-Reported Version - Outdoor Limited by: Health",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C135695-C136071"
        },
        {
            "alt_label": "PODCI2-Outdoor Limited by: Instructions",
            "definition": "Pediatric Outcomes Data Collection Instrument, Adolescent Parent-Reported - If you answered \"no\" to Question 36 above, was your child's activity limited by: Doctor or parent instructions?",
            "identifier": "C136072",
            "notation": "PODCI2-Outdoor Limited by: Instructions",
            "pref_label": "PODCI Adolescent Parent-Reported Version - Outdoor Limited by: Instructions",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C135695-C136072"
        },
        {
            "alt_label": "PODCI2-Outdoor Limited by: Pain",
            "definition": "Pediatric Outcomes Data Collection Instrument, Adolescent Parent-Reported - If you answered \"no\" to Question 36 above, was your child's activity limited by: Pain?",
            "identifier": "C136070",
            "notation": "PODCI2-Outdoor Limited by: Pain",
            "pref_label": "PODCI Adolescent Parent-Reported Version - Outdoor Limited by: Pain",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C135695-C136070"
        },
        {
            "alt_label": "PODCI2-Outdoor Limited by: Season",
            "definition": "Pediatric Outcomes Data Collection Instrument, Adolescent Parent-Reported - If you answered \"no\" to Question 36 above, was your child's activity limited by: Activity not in season?",
            "identifier": "C136076",
            "notation": "PODCI2-Outdoor Limited by: Season",
            "pref_label": "PODCI Adolescent Parent-Reported Version - Outdoor Limited by: Season",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C135695-C136076"
        },
        {
            "alt_label": "PODCI2-Outdoor Limited by: Too Young",
            "definition": "Pediatric Outcomes Data Collection Instrument, Adolescent Parent-Reported - If you answered \"no\" to Question 36 above, was your child's activity limited by: Too young?",
            "identifier": "C136075",
            "notation": "PODCI2-Outdoor Limited by: Too Young",
            "pref_label": "PODCI Adolescent Parent-Reported Version - Outdoor Limited by: Too Young",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C135695-C136075"
        },
        {
            "alt_label": "PODCI2-Pain During the Last Week",
            "definition": "Pediatric Outcomes Data Collection Instrument, Adolescent Parent-Reported - How much pain has your child had during the last week?",
            "identifier": "C136108",
            "notation": "PODCI2-Pain During the Last Week",
            "pref_label": "PODCI Adolescent Parent-Reported Version - Pain During the Last Week",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C135695-C136108"
        },
        {
            "alt_label": "PODCI2-Pain Interfere With Activities",
            "definition": "Pediatric Outcomes Data Collection Instrument, Adolescent Parent-Reported - During the last week, how much did pain interfere with your child's normal activities (including at home, outside of the home, and at school)?",
            "identifier": "C136109",
            "notation": "PODCI2-Pain Interfere With Activities",
            "pref_label": "PODCI Adolescent Parent-Reported Version - Pain Interfere With Activities",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C135695-C136109"
        },
        {
            "alt_label": "PODCI2-Pain/Comfort Scale",
            "definition": "Pediatric Outcomes Data Collection Instrument, Adolescent Parent-Reported - Pain/comfort core scale.",
            "identifier": "C136123",
            "notation": "PODCI2-Pain/Comfort Scale",
            "pref_label": "PODCI Adolescent Parent-Reported Version - Pain or Comfort Scale",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C135695-C136123"
        },
        {
            "alt_label": "PODCI2-Pain/Discom Inter With Activities",
            "definition": "Pediatric Outcomes Data Collection Instrument, Adolescent Parent-Reported - During the last week, how much of the time: Did pain or discomfort interfere with your child's activities?",
            "identifier": "C136050",
            "notation": "PODCI2-Pain/Discom Inter With Activities",
            "pref_label": "PODCI Adolescent Parent-Reported Version - Pain or Discomfort Interfere With Activities",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C135695-C136050"
        },
        {
            "alt_label": "PODCI2-Participate in Competitive Sports",
            "definition": "Pediatric Outcomes Data Collection Instrument, Adolescent Parent-Reported - Can your child participate in competitive level sports with other children the same age (For example: hockey, basketball, soccer, football, baseball, swimming, running [track or cross country], gymnastics, or dance)?",
            "identifier": "C136085",
            "notation": "PODCI2-Participate in Competitive Sports",
            "pref_label": "PODCI Adolescent Parent-Reported Version - Participate in Competitive Sports",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C135695-C136085"
        },
        {
            "alt_label": "PODCI2-Participate in Gym/Recess",
            "definition": "Pediatric Outcomes Data Collection Instrument, Adolescent Parent-Reported - How often in the last week did your child participate in gym/recess?",
            "identifier": "C136099",
            "notation": "PODCI2-Participate in Gym/Recess",
            "pref_label": "PODCI Adolescent Parent-Reported Version - Participate in Gym or Recess",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C135695-C136099"
        },
        {
            "alt_label": "PODCI2-Participate in Outdoor Activities",
            "definition": "Pediatric Outcomes Data Collection Instrument, Adolescent Parent-Reported - Can your child participate in recreational outdoor activities with other children the same age (For example: bicycling, skating, hiking, jogging)?",
            "identifier": "C136069",
            "notation": "PODCI2-Participate in Outdoor Activities",
            "pref_label": "PODCI Adolescent Parent-Reported Version - Participate in Outdoor Activities",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C135695-C136069"
        },
        {
            "alt_label": "PODCI2-Participate in Pickup Games",
            "definition": "Pediatric Outcomes Data Collection Instrument, Adolescent Parent-Reported - Can your child participate in pickup games or sports with other children the same age (For example: tag, dodge ball, basketball, softball, soccer, catch, jump rope, touch football, hop scotch)?",
            "identifier": "C136077",
            "notation": "PODCI2-Participate in Pickup Games",
            "pref_label": "PODCI Adolescent Parent-Reported Version - Participate in Pickup Games",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C135695-C136077"
        },
        {
            "alt_label": "PODCI2-Pour a Half Gallon of Milk",
            "definition": "Pediatric Outcomes Data Collection Instrument, Adolescent Parent-Reported - During the last week, was it easy or hard for your child to: Pour a half gallon of milk?",
            "identifier": "C136035",
            "notation": "PODCI2-Pour a Half Gallon of Milk",
            "pref_label": "PODCI Adolescent Parent-Reported Version - Pour a Half Gallon of Milk",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C135695-C136035"
        },
        {
            "alt_label": "PODCI2-Put on His/Her Coat",
            "definition": "Pediatric Outcomes Data Collection Instrument, Adolescent Parent-Reported - During the last week, was it easy or hard for your child to: Put on his/her coat?",
            "identifier": "C136040",
            "notation": "PODCI2-Put on His/Her Coat",
            "pref_label": "PODCI Adolescent Parent-Reported Version - Put on His or Her Coat",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C135695-C136040"
        },
        {
            "alt_label": "PODCI2-Run Short Distances",
            "definition": "Pediatric Outcomes Data Collection Instrument, Adolescent Parent-Reported - During the last week, has it been easy or hard for your child to: Run short distances?",
            "identifier": "C136051",
            "notation": "PODCI2-Run Short Distances",
            "pref_label": "PODCI Adolescent Parent-Reported Version - Run Short Distances",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C135695-C136051"
        },
        {
            "alt_label": "PODCI2-Sit in Chair Without Holding On",
            "definition": "Pediatric Outcomes Data Collection Instrument, Adolescent Parent-Reported - During the last week, has it been easy or hard for your child to: Sit in a regular chair without holding on?",
            "identifier": "C136062",
            "notation": "PODCI2-Sit in Chair Without Holding On",
            "pref_label": "PODCI Adolescent Parent-Reported Version - Sit in Chair Without Holding On",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C135695-C136062"
        },
        {
            "alt_label": "PODCI2-Sleep More Comfortably",
            "definition": "Pediatric Outcomes Data Collection Instrument, Adolescent Parent-Reported - As a result of my child's treatment, I expect my child: To sleep more comfortably.",
            "identifier": "C136113",
            "notation": "PODCI2-Sleep More Comfortably",
            "pref_label": "PODCI Adolescent Parent-Reported Version - Sleep More Comfortably",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C135695-C136113"
        },
        {
            "alt_label": "PODCI2-Spend Rest of Life With Condition",
            "definition": "Pediatric Outcomes Data Collection Instrument, Adolescent Parent-Reported - If your child had to spend the rest of his/her life with his/her bone and muscle condition as it is right now, how would you feel about it?",
            "identifier": "C136119",
            "notation": "PODCI2-Spend Rest of Life With Condition",
            "pref_label": "PODCI Adolescent Parent-Reported Version - Spend Rest of Life With Condition",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C135695-C136119"
        },
        {
            "alt_label": "PODCI2-Sports/Phys Function Scale",
            "definition": "Pediatric Outcomes Data Collection Instrument, Adolescent Parent-Reported - Sports and physical functioning core scale.",
            "identifier": "C136122",
            "notation": "PODCI2-Sports/Phys Function Scale",
            "pref_label": "PODCI Adolescent Parent-Reported Version - Sports and Physical Function Scale",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C135695-C136122"
        },
        {
            "alt_label": "PODCI2-Stand Washing Hands at a Sink",
            "definition": "Pediatric Outcomes Data Collection Instrument, Adolescent Parent-Reported - During the last week, has it been easy or hard for your child to: Stand while washing his/her hands and face at a sink?",
            "identifier": "C136061",
            "notation": "PODCI2-Stand Washing Hands at a Sink",
            "pref_label": "PODCI Adolescent Parent-Reported Version - Stand Washing Hands at a Sink",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C135695-C136061"
        },
        {
            "alt_label": "PODCI2-Transfer/Basic Mobility Scale",
            "definition": "Pediatric Outcomes Data Collection Instrument, Adolescent Parent-Reported - Transfer and basic mobility core scale.",
            "identifier": "C136121",
            "notation": "PODCI2-Transfer/Basic Mobility Scale",
            "pref_label": "PODCI Adolescent Parent-Reported Version - Transfer and Basic Mobility Scale",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C135695-C136121"
        },
        {
            "alt_label": "PODCI2-Turn Door Knobs",
            "definition": "Pediatric Outcomes Data Collection Instrument, Adolescent Parent-Reported - During the last week, has it been easy or hard for your child to: Turn door knobs?",
            "identifier": "C136065",
            "notation": "PODCI2-Turn Door Knobs",
            "pref_label": "PODCI Adolescent Parent-Reported Version - Turn Door Knobs",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C135695-C136065"
        },
        {
            "alt_label": "PODCI2-Up Extremity/Phys Function Scale",
            "definition": "Pediatric Outcomes Data Collection Instrument, Adolescent Parent-Reported - Upper extremity and physical function core scale.",
            "identifier": "C136120",
            "notation": "PODCI2-Up Extremity/Phys Function Scale",
            "pref_label": "PODCI Adolescent Parent-Reported Version - Upper Extremity and Physical Function Scale",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C135695-C136120"
        },
        {
            "alt_label": "PODCI2-Use a Fork and Spoon",
            "definition": "Pediatric Outcomes Data Collection Instrument, Adolescent Parent-Reported - During the last week, was it easy or hard for your child to: Use a fork and spoon?",
            "identifier": "C136037",
            "notation": "PODCI2-Use a Fork and Spoon",
            "pref_label": "PODCI Adolescent Parent-Reported Version - Use a Fork and Spoon",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C135695-C136037"
        },
        {
            "alt_label": "PODCI2-Use Assistive Devices for Sitting",
            "definition": "Pediatric Outcomes Data Collection Instrument, Adolescent Parent-Reported - How often does your child use assistive devices (such as braces, crutches, or wheelchair) for sitting and standing?",
            "identifier": "C136068",
            "notation": "PODCI2-Use Assistive Devices for Sitting",
            "pref_label": "PODCI Adolescent Parent-Reported Version - Use Assistive Devices for Sitting",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C135695-C136068"
        },
        {
            "alt_label": "PODCI2-Use Assistive Devices for Walking",
            "definition": "Pediatric Outcomes Data Collection Instrument, Adolescent Parent-Reported - How often does your child use assistive devices (such as braces, crutches, or wheelchair) for walking and climbing?",
            "identifier": "C136060",
            "notation": "PODCI2-Use Assistive Devices for Walking",
            "pref_label": "PODCI Adolescent Parent-Reported Version - Use Assistive Devices for Walking",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C135695-C136060"
        },
        {
            "alt_label": "PODCI2-Walk More Than a Mile",
            "definition": "Pediatric Outcomes Data Collection Instrument, Adolescent Parent-Reported - During the last week, has it been easy or hard for your child to: Walk more than a mile?",
            "identifier": "C136055",
            "notation": "PODCI2-Walk More Than a Mile",
            "pref_label": "PODCI Adolescent Parent-Reported Version - Walk More Than a Mile",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C135695-C136055"
        },
        {
            "alt_label": "PODCI2-Walk One Block",
            "definition": "Pediatric Outcomes Data Collection Instrument, Adolescent Parent-Reported - During the last week, has it been easy or hard for your child to: Walk one block?",
            "identifier": "C136057",
            "notation": "PODCI2-Walk One Block",
            "pref_label": "PODCI Adolescent Parent-Reported Version - Walk One Block",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C135695-C136057"
        },
        {
            "alt_label": "PODCI2-Walk Three Blocks",
            "definition": "Pediatric Outcomes Data Collection Instrument, Adolescent Parent-Reported - During the last week, has it been easy or hard for your child to: Walk three blocks?",
            "identifier": "C136056",
            "notation": "PODCI2-Walk Three Blocks",
            "pref_label": "PODCI Adolescent Parent-Reported Version - Walk Three Blocks",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C135695-C136056"
        },
        {
            "alt_label": "PODCI2-What Clothes/Shoes He/She Wear",
            "definition": "Pediatric Outcomes Data Collection Instrument, Adolescent Parent-Reported - During the last week, how happy has your child been with: What clothes or shoes he/she can wear?",
            "identifier": "C136045",
            "notation": "PODCI2-What Clothes/Shoes He/She Wear",
            "pref_label": "PODCI Adolescent Parent-Reported Version - What Clothes or Shoes He or She Wear",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C135695-C136045"
        },
        {
            "alt_label": "PODCI2-Write With a Pencil",
            "definition": "Pediatric Outcomes Data Collection Instrument, Adolescent Parent-Reported - During the last week, was it easy or hard for your child to: Write with a pencil?",
            "identifier": "C136041",
            "notation": "PODCI2-Write With a Pencil",
            "pref_label": "PODCI Adolescent Parent-Reported Version - Write With a Pencil",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C135695-C136041"
        }
    ]
}