{
    "SKOS_CONCEPT": [
        {
            "alt_label": "PQL10-Hard to Breathe",
            "definition": "Pediatric Quality of Life Neuromuscular Module Acute Version 3 Young Adult - In the past 7 days, how much of a problem has this been for you: It is hard to breathe.",
            "identifier": "C138640",
            "notation": "PQL1001",
            "pref_label": "PedsQL Neuromuscular Module Acute Version 3.0 Young Adult Report - Hard to Breathe",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C138241-C138640"
        },
        {
            "alt_label": "PQL10-Get Sick Easily",
            "definition": "Pediatric Quality of Life Neuromuscular Module Acute Version 3 Young Adult - In the past 7 days, how much of a problem has this been for you: I get sick easily.",
            "identifier": "C138641",
            "notation": "PQL1002",
            "pref_label": "PedsQL Neuromuscular Module Acute Version 3.0 Young Adult Report - Get Sick Easily",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C138241-C138641"
        },
        {
            "alt_label": "PQL10-Get Sores and/or Rashes",
            "definition": "Pediatric Quality of Life Neuromuscular Module Acute Version 3 Young Adult - In the past 7 days, how much of a problem has this been for you: I get sores and/or rashes.",
            "identifier": "C138642",
            "notation": "PQL1003",
            "pref_label": "PedsQL Neuromuscular Module Acute Version 3.0 Young Adult Report - Get Sores and/or Rashes",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C138241-C138642"
        },
        {
            "alt_label": "PQL10-Legs Hurt",
            "definition": "Pediatric Quality of Life Neuromuscular Module Acute Version 3 Young Adult - In the past 7 days, how much of a problem has this been for you: My legs hurt.",
            "identifier": "C138643",
            "notation": "PQL1004",
            "pref_label": "PedsQL Neuromuscular Module Acute Version 3.0 Young Adult Report - Legs Hurt",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C138241-C138643"
        },
        {
            "alt_label": "PQL10-Feel Tired",
            "definition": "Pediatric Quality of Life Neuromuscular Module Acute Version 3 Young Adult - In the past 7 days, how much of a problem has this been for you: I feel tired.",
            "identifier": "C138644",
            "notation": "PQL1005",
            "pref_label": "PedsQL Neuromuscular Module Acute Version 3.0 Young Adult Report - Feel Tired",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C138241-C138644"
        },
        {
            "alt_label": "PQL10-Back Feels Stiff",
            "definition": "Pediatric Quality of Life Neuromuscular Module Acute Version 3 Young Adult - In the past 7 days, how much of a problem has this been for you: My back feels stiff.",
            "identifier": "C138645",
            "notation": "PQL1006",
            "pref_label": "PedsQL Neuromuscular Module Acute Version 3.0 Young Adult Report - Back Feels Stiff",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C138241-C138645"
        },
        {
            "alt_label": "PQL10-Wake Up Tired",
            "definition": "Pediatric Quality of Life Neuromuscular Module Acute Version 3 Young Adult - In the past 7 days, how much of a problem has this been for you: I wake up tired.",
            "identifier": "C138646",
            "notation": "PQL1007",
            "pref_label": "PedsQL Neuromuscular Module Acute Version 3.0 Young Adult Report - Wake Up Tired",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C138241-C138646"
        },
        {
            "alt_label": "PQL10-Hands Are Weak",
            "definition": "Pediatric Quality of Life Neuromuscular Module Acute Version 3 Young Adult - In the past 7 days, how much of a problem has this been for you: My hands are weak.",
            "identifier": "C138647",
            "notation": "PQL1008",
            "pref_label": "PedsQL Neuromuscular Module Acute Version 3.0 Young Adult Report - Hands Are Weak",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C138241-C138647"
        },
        {
            "alt_label": "PQL10-Hard to Use Bathroom",
            "definition": "Pediatric Quality of Life Neuromuscular Module Acute Version 3 Young Adult - In the past 7 days, how much of a problem has this been for you: It is hard to use the bathroom.",
            "identifier": "C138648",
            "notation": "PQL1009",
            "pref_label": "PedsQL Neuromuscular Module Acute Version 3.0 Young Adult Report - Hard to Use Bathroom",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C138241-C138648"
        },
        {
            "alt_label": "PQL10-Hard to Gain/Lose Weight",
            "definition": "Pediatric Quality of Life Neuromuscular Module Acute Version 3 Young Adult - In the past 7 days, how much of a problem has this been for you: It is hard to gain or lose weight when I want to.",
            "identifier": "C138649",
            "notation": "PQL1010",
            "pref_label": "PedsQL Neuromuscular Module Acute Version 3.0 Young Adult Report - Hard to Gain or Lose Weight",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C138241-C138649"
        },
        {
            "alt_label": "PQL10-Hard to Use Hands",
            "definition": "Pediatric Quality of Life Neuromuscular Module Acute Version 3 Young Adult - In the past 7 days, how much of a problem has this been for you: It is hard to use my hands.",
            "identifier": "C138650",
            "notation": "PQL1011",
            "pref_label": "PedsQL Neuromuscular Module Acute Version 3.0 Young Adult Report - Hard to Use Hands",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C138241-C138650"
        },
        {
            "alt_label": "PQL10-Hard to Swallow Food",
            "definition": "Pediatric Quality of Life Neuromuscular Module Acute Version 3 Young Adult - In the past 7 days, how much of a problem has this been for you: It is hard to swallow food.",
            "identifier": "C138651",
            "notation": "PQL1012",
            "pref_label": "PedsQL Neuromuscular Module Acute Version 3.0 Young Adult Report - Hard to Swallow Food",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C138241-C138651"
        },
        {
            "alt_label": "PQL10-Long Time to Bathe/Shower",
            "definition": "Pediatric Quality of Life Neuromuscular Module Acute Version 3 Young Adult - In the past 7 days, how much of a problem has this been for you: It takes me a long time to bathe or shower.",
            "identifier": "C138652",
            "notation": "PQL1013",
            "pref_label": "PedsQL Neuromuscular Module Acute Version 3.0 Young Adult Report - Long Time to Bathe or Shower",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C138241-C138652"
        },
        {
            "alt_label": "PQL10-Get Hurt Accidentally",
            "definition": "Pediatric Quality of Life Neuromuscular Module Acute Version 3 Young Adult - In the past 7 days, how much of a problem has this been for you: I get hurt accidentally.",
            "identifier": "C138653",
            "notation": "PQL1014",
            "pref_label": "PedsQL Neuromuscular Module Acute Version 3.0 Young Adult Report - Get Hurt Accidentally",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C138241-C138653"
        },
        {
            "alt_label": "PQL10-Take Long Time to Eat",
            "definition": "Pediatric Quality of Life Neuromuscular Module Acute Version 3 Young Adult - In the past 7 days, how much of a problem has this been for you: I take a long time to eat.",
            "identifier": "C138654",
            "notation": "PQL1015",
            "pref_label": "PedsQL Neuromuscular Module Acute Version 3.0 Young Adult Report - Take Long Time to Eat",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C138241-C138654"
        },
        {
            "alt_label": "PQL10-Hard to Turn During Night",
            "definition": "Pediatric Quality of Life Neuromuscular Module Acute Version 3 Young Adult - In the past 7 days, how much of a problem has this been for you: It is hard to turn myself during the night.",
            "identifier": "C138655",
            "notation": "PQL1016",
            "pref_label": "PedsQL Neuromuscular Module Acute Version 3.0 Young Adult Report - Hard to Turn During Night",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C138241-C138655"
        },
        {
            "alt_label": "PQL10-Hard to Go Places With Equipment",
            "definition": "Pediatric Quality of Life Neuromuscular Module Acute Version 3 Young Adult - In the past 7 days, how much of a problem has this been for you: It is hard for me to go places with my equipment.",
            "identifier": "C138656",
            "notation": "PQL1017",
            "pref_label": "PedsQL Neuromuscular Module Acute Version 3.0 Young Adult Report - Hard to Go Places With Equipment",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C138241-C138656"
        },
        {
            "alt_label": "PQL10-Hard Tell Doctors/Nurses How Feel",
            "definition": "Pediatric Quality of Life Neuromuscular Module Acute Version 3 Young Adult - In the past 7 days, how much of a problem has this been for you: It is hard for me to tell the doctors and nurses how I feel.",
            "identifier": "C138657",
            "notation": "PQL1018",
            "pref_label": "PedsQL Neuromuscular Module Acute Version 3.0 Young Adult Report - Hard Tell Doctors and Nurses How Feel",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C138241-C138657"
        },
        {
            "alt_label": "PQL10-Hard Ask Doctors/Nurses Questions",
            "definition": "Pediatric Quality of Life Neuromuscular Module Acute Version 3 Young Adult - In the past 7 days, how much of a problem has this been for you: It is hard for me to ask the doctors and nurses questions.",
            "identifier": "C138658",
            "notation": "PQL1019",
            "pref_label": "PedsQL Neuromuscular Module Acute Version 3.0 Young Adult Report - Hard Ask Doctors and Nurses Questions",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C138241-C138658"
        },
        {
            "alt_label": "PQL10-Hard Explain Illness to People",
            "definition": "Pediatric Quality of Life Neuromuscular Module Acute Version 3 Young Adult - In the past 7 days, how much of a problem has this been for you: It is hard for me to explain my illness to other people.",
            "identifier": "C138659",
            "notation": "PQL1020",
            "pref_label": "PedsQL Neuromuscular Module Acute Version 3.0 Young Adult Report - Hard Explain Illness to People",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C138241-C138659"
        },
        {
            "alt_label": "PQL10-Hard for Family to Plan Activities",
            "definition": "Pediatric Quality of Life Neuromuscular Module Acute Version 3 Young Adult - In the past 7 days, how much of a problem has this been for you: It is hard for my family to plan activities like vacations.",
            "identifier": "C138660",
            "notation": "PQL1021",
            "pref_label": "PedsQL Neuromuscular Module Acute Version 3.0 Young Adult Report - Hard for Family to Plan Activities",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C138241-C138660"
        },
        {
            "alt_label": "PQL10-Hard for Family to Rest",
            "definition": "Pediatric Quality of Life Neuromuscular Module Acute Version 3 Young Adult - In the past 7 days, how much of a problem has this been for you: It is hard for my family to get enough rest.",
            "identifier": "C138661",
            "notation": "PQL1022",
            "pref_label": "PedsQL Neuromuscular Module Acute Version 3.0 Young Adult Report - Hard for Family to Rest",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C138241-C138661"
        },
        {
            "alt_label": "PQL10-Money Problem in Our Family",
            "definition": "Pediatric Quality of Life Neuromuscular Module Acute Version 3 Young Adult - In the past 7 days, how much of a problem has this been for you: I think money is a problem in our family.",
            "identifier": "C138662",
            "notation": "PQL1023",
            "pref_label": "PedsQL Neuromuscular Module Acute Version 3.0 Young Adult Report - Money Problem in Our Family",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C138241-C138662"
        },
        {
            "alt_label": "PQL10-Family Has Lot of Problems",
            "definition": "Pediatric Quality of Life Neuromuscular Module Acute Version 3 Young Adult - In the past 7 days, how much of a problem has this been for you: I think my family has a lot of problems.",
            "identifier": "C138663",
            "notation": "PQL1024",
            "pref_label": "PedsQL Neuromuscular Module Acute Version 3.0 Young Adult Report - Family Has Lot of Problems",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C138241-C138663"
        },
        {
            "alt_label": "PQL10-Do Not Have Equipment Need",
            "definition": "Pediatric Quality of Life Neuromuscular Module Acute Version 3 Young Adult - In the past 7 days, how much of a problem has this been for you: I do not have the equipment I need.",
            "identifier": "C138664",
            "notation": "PQL1025",
            "pref_label": "PedsQL Neuromuscular Module Acute Version 3.0 Young Adult Report - Do Not Have Equipment Need",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C138241-C138664"
        }
    ]
}