{
    "SKOS_CONCEPT": [
        {
            "alt_label": "PQL16-Back Feels Stiff",
            "definition": "Pediatric Quality of Life Neuromuscular Module Acute Version 3 Young Child - Think about how you have been doing for the past 7 days. Please listen carefully to each sentence and tell me how much of a problem this is for you: My back feels stiff.",
            "identifier": "C138670",
            "notation": "PQL16-Back Feels Stiff",
            "pref_label": "PedsQL Neuromuscular Module Acute Version 3.0 Young Child Report - Back Feels Stiff",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C138242-C138670"
        },
        {
            "alt_label": "PQL16-Feel Tired",
            "definition": "Pediatric Quality of Life Neuromuscular Module Acute Version 3 Young Child - Think about how you have been doing for the past 7 days. Please listen carefully to each sentence and tell me how much of a problem this is for you: I feel tired.",
            "identifier": "C138669",
            "notation": "PQL16-Feel Tired",
            "pref_label": "PedsQL Neuromuscular Module Acute Version 3.0 Young Child Report - Feel Tired",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C138242-C138669"
        },
        {
            "alt_label": "PQL16-Get Hurt Accidentally",
            "definition": "Pediatric Quality of Life Neuromuscular Module Acute Version 3 Young Child - Think about how you have been doing for the past 7 days. Please listen carefully to each sentence and tell me how much of a problem this is for you: I get hurt accidentally.",
            "identifier": "C138678",
            "notation": "PQL16-Get Hurt Accidentally",
            "pref_label": "PedsQL Neuromuscular Module Acute Version 3.0 Young Child Report - Get Hurt Accidentally",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C138242-C138678"
        },
        {
            "alt_label": "PQL16-Get Sick Easily",
            "definition": "Pediatric Quality of Life Neuromuscular Module Acute Version 3 Young Child - Think about how you have been doing for the past 7 days. Please listen carefully to each sentence and tell me how much of a problem this is for you: I get sick easily.",
            "identifier": "C138666",
            "notation": "PQL16-Get Sick Easily",
            "pref_label": "PedsQL Neuromuscular Module Acute Version 3.0 Young Child Report - Get Sick Easily",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C138242-C138666"
        },
        {
            "alt_label": "PQL16-Get Sores and/or Rashes",
            "definition": "Pediatric Quality of Life Neuromuscular Module Acute Version 3 Young Child - Think about how you have been doing for the past 7 days. Please listen carefully to each sentence and tell me how much of a problem this is for you: I get sores and/or rashes.",
            "identifier": "C138667",
            "notation": "PQL16-Get Sores and/or Rashes",
            "pref_label": "PedsQL Neuromuscular Module Acute Version 3.0 Young Child Report - Get Sores and/or Rashes",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C138242-C138667"
        },
        {
            "alt_label": "PQL16-Hands Are Weak",
            "definition": "Pediatric Quality of Life Neuromuscular Module Acute Version 3 Young Child - Think about how you have been doing for the past 7 days. Please listen carefully to each sentence and tell me how much of a problem this is for you: My hands are weak.",
            "identifier": "C138672",
            "notation": "PQL16-Hands Are Weak",
            "pref_label": "PedsQL Neuromuscular Module Acute Version 3.0 Young Child Report - Hands Are Weak",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C138242-C138672"
        },
        {
            "alt_label": "PQL16-Hard to Breathe",
            "definition": "Pediatric Quality of Life Neuromuscular Module Acute Version 3 Young Child - Think about how you have been doing for the past 7 days. Please listen carefully to each sentence and tell me how much of a problem this is for you: It is hard to breathe.",
            "identifier": "C138665",
            "notation": "PQL16-Hard to Breathe",
            "pref_label": "PedsQL Neuromuscular Module Acute Version 3.0 Young Child Report - Hard to Breathe",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C138242-C138665"
        },
        {
            "alt_label": "PQL16-Hard to Gain/Lose Weight",
            "definition": "Pediatric Quality of Life Neuromuscular Module Acute Version 3 Young Child - Think about how you have been doing for the past 7 days. Please listen carefully to each sentence and tell me how much of a problem this is for you: It is hard to gain or lose weight when I want to.",
            "identifier": "C138674",
            "notation": "PQL16-Hard to Gain/Lose Weight",
            "pref_label": "PedsQL Neuromuscular Module Acute Version 3.0 Young Child Report - Hard to Gain or Lose Weight",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C138242-C138674"
        },
        {
            "alt_label": "PQL16-Hard to Go Places With Equipment",
            "definition": "Pediatric Quality of Life Neuromuscular Module Acute Version 3 Young Child - Think about how you have been doing for the past 7 days. Please listen carefully to each sentence and tell me how much of a problem this is for you: It is hard for me to go places with my equipment.",
            "identifier": "C138681",
            "notation": "PQL16-Hard to Go Places With Equipment",
            "pref_label": "PedsQL Neuromuscular Module Acute Version 3.0 Young Child Report - Hard to Go Places With Equipment",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C138242-C138681"
        },
        {
            "alt_label": "PQL16-Hard to Swallow Food",
            "definition": "Pediatric Quality of Life Neuromuscular Module Acute Version 3 Young Child - Think about how you have been doing for the past 7 days. Please listen carefully to each sentence and tell me how much of a problem this is for you: It is hard to swallow food.",
            "identifier": "C138676",
            "notation": "PQL16-Hard to Swallow Food",
            "pref_label": "PedsQL Neuromuscular Module Acute Version 3.0 Young Child Report - Hard to Swallow Food",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C138242-C138676"
        },
        {
            "alt_label": "PQL16-Hard to Turn During Night",
            "definition": "Pediatric Quality of Life Neuromuscular Module Acute Version 3 Young Child - Think about how you have been doing for the past 7 days. Please listen carefully to each sentence and tell me how much of a problem this is for you: It is hard to turn myself during the night.",
            "identifier": "C138680",
            "notation": "PQL16-Hard to Turn During Night",
            "pref_label": "PedsQL Neuromuscular Module Acute Version 3.0 Young Child Report - Hard to Turn During Night",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C138242-C138680"
        },
        {
            "alt_label": "PQL16-Hard to Use Bathroom",
            "definition": "Pediatric Quality of Life Neuromuscular Module Acute Version 3 Young Child - Think about how you have been doing for the past 7 days. Please listen carefully to each sentence and tell me how much of a problem this is for you: It is hard to use the bathroom.",
            "identifier": "C138673",
            "notation": "PQL16-Hard to Use Bathroom",
            "pref_label": "PedsQL Neuromuscular Module Acute Version 3.0 Young Child Report - Hard to Use Bathroom",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C138242-C138673"
        },
        {
            "alt_label": "PQL16-Hard to Use Hands",
            "definition": "Pediatric Quality of Life Neuromuscular Module Acute Version 3 Young Child - Think about how you have been doing for the past 7 days. Please listen carefully to each sentence and tell me how much of a problem this is for you: It is hard to use my hands.",
            "identifier": "C138675",
            "notation": "PQL16-Hard to Use Hands",
            "pref_label": "PedsQL Neuromuscular Module Acute Version 3.0 Young Child Report - Hard to Use Hands",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C138242-C138675"
        },
        {
            "alt_label": "PQL16-Legs Hurt",
            "definition": "Pediatric Quality of Life Neuromuscular Module Acute Version 3 Young Child - Think about how you have been doing for the past 7 days. Please listen carefully to each sentence and tell me how much of a problem this is for you: My legs hurt.",
            "identifier": "C138668",
            "notation": "PQL16-Legs Hurt",
            "pref_label": "PedsQL Neuromuscular Module Acute Version 3.0 Young Child Report - Legs Hurt",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C138242-C138668"
        },
        {
            "alt_label": "PQL16-Long Time to Bathe/Shower",
            "definition": "Pediatric Quality of Life Neuromuscular Module Acute Version 3 Young Child - Think about how you have been doing for the past 7 days. Please listen carefully to each sentence and tell me how much of a problem this is for you: It takes me a long time to bathe or shower.",
            "identifier": "C138677",
            "notation": "PQL16-Long Time to Bathe/Shower",
            "pref_label": "PedsQL Neuromuscular Module Acute Version 3.0 Young Child Report - Long Time to Bathe or Shower",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C138242-C138677"
        },
        {
            "alt_label": "PQL16-Take Long Time to Eat",
            "definition": "Pediatric Quality of Life Neuromuscular Module Acute Version 3 Young Child - Think about how you have been doing for the past 7 days. Please listen carefully to each sentence and tell me how much of a problem this is for you: I take a long time to eat.",
            "identifier": "C138679",
            "notation": "PQL16-Take Long Time to Eat",
            "pref_label": "PedsQL Neuromuscular Module Acute Version 3.0 Young Child Report - Take Long Time to Eat",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C138242-C138679"
        },
        {
            "alt_label": "PQL16-Wake Up Tired",
            "definition": "Pediatric Quality of Life Neuromuscular Module Acute Version 3 Young Child - Think about how you have been doing for the past 7 days. Please listen carefully to each sentence and tell me how much of a problem this is for you: I wake up tired.",
            "identifier": "C138671",
            "notation": "PQL16-Wake Up Tired",
            "pref_label": "PedsQL Neuromuscular Module Acute Version 3.0 Young Child Report - Wake Up Tired",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C138242-C138671"
        }
    ]
}