{
    "SKOS_CONCEPT": [
        {
            "alt_label": "KFSS107-Dementia or chronic brain syndrome - severe or incompetent",
            "definition": "Kurtzke Functional System Scores original result for KFSS107-Dementia or chronic brain syndrome - severe or incompetent.",
            "identifier": "C182867",
            "notation": "Dementia or chronic brain syndrome - severe or incompetent",
            "pref_label": "Kurtzke Functional System Scores KFSS107 Original Result - Dementia or chronic brain syndrome - severe or incompetent",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C182482-C182867"
        },
        {
            "alt_label": "KFSS107-Marked decrease in mentation (chronic brain syndrome - moderate)",
            "definition": "Kurtzke Functional System Scores original result for KFSS107-Marked decrease in mentation (chronic brain syndrome - moderate).",
            "identifier": "C182866",
            "notation": "Marked decrease in mentation (chronic brain syndrome - moderate)",
            "pref_label": "Kurtzke Functional System Scores KFSS107 Original Result - Marked decrease in mentation (chronic brain syndrome - moderate)",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C182482-C182866"
        },
        {
            "alt_label": "KFSS107-Mild decrease in mentation",
            "definition": "Kurtzke Functional System Scores original result for KFSS107-Mild decrease in mentation.",
            "identifier": "C182864",
            "notation": "Mild decrease in mentation",
            "pref_label": "Kurtzke Functional System Scores KFSS107 Original Result - Mild decrease in mentation",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C182482-C182864"
        },
        {
            "alt_label": "KFSS107-Moderate decrease in mentation",
            "definition": "Kurtzke Functional System Scores original result for KFSS107-Moderate decrease in mentation.",
            "identifier": "C182865",
            "notation": "Moderate decrease in mentation",
            "pref_label": "Kurtzke Functional System Scores KFSS107 Original Result - Moderate decrease in mentation",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C182482-C182865"
        },
        {
            "alt_label": "KFSS107-Mood alteration only (does not affect DSS score)",
            "definition": "Kurtzke Functional System Scores original result for KFSS107-Mood alteration only (does not affect DSS score).",
            "identifier": "C182863",
            "notation": "Mood alteration only (does not affect DSS score)",
            "pref_label": "Kurtzke Functional System Scores KFSS107 Original Result - Mood alteration only (does not affect DSS score)",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C182482-C182863"
        },
        {
            "alt_label": "KFSS107-Normal",
            "definition": "Kurtzke Functional System Scores original result for KFSS107-Normal.",
            "identifier": "C182862",
            "notation": "Normal",
            "pref_label": "Kurtzke Functional System Scores KFSS107 Original Result - Normal",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C182482-C182862"
        },
        {
            "alt_label": "KFSS107-Unknown",
            "definition": "Kurtzke Functional System Scores original result for KFSS107-Unknown.",
            "identifier": "C182868",
            "notation": "Unknown",
            "pref_label": "Kurtzke Functional System Scores KFSS107 Original Result - Unknown",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C182482-C182868"
        }
    ]
}