{
    "SKOS_CONCEPT": [
        {
            "alt_label": "ED2-Can Dress/Groom Independently",
            "definition": "Expanded Disability Rating Scale - Postacute Interview Survivor Version - Can you dress and groom yourself independently and appropriately or direct someone else in these activities without help or reminders?",
            "identifier": "C125810",
            "notation": "ED2-Can Dress/Groom Independently",
            "pref_label": "Expanded DRS-PI Survivor Version - Can Dress and Groom Self Independently",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C125746-C125810"
        },
        {
            "alt_label": "ED2-Correct Date and Time",
            "definition": "Expanded Disability Rating Scale - Postacute Interview Survivor Version - Are you able to give the correct date and time within a few seconds of being asked?",
            "identifier": "C125803",
            "notation": "ED2-Correct Date and Time",
            "pref_label": "Expanded DRS-PI Survivor Version - Give Correct Date and Time When Asked",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C125746-C125803"
        },
        {
            "alt_label": "ED2-Feed Independently Without Help",
            "definition": "Expanded Disability Rating Scale - Postacute Interview Survivor Version - Can you feed yourself independently or manage tube feedings appropriately without help or reminders?",
            "identifier": "C125804",
            "notation": "ED2-Feed Independently Without Help",
            "pref_label": "Expanded DRS-PI Survivor Version - Feed Yourself Independently Without Help",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C125746-C125804"
        },
        {
            "alt_label": "ED2-Function Completely Independently",
            "definition": "Expanded Disability Rating Scale - Postacute Interview Survivor Version - Do you function completely independently? That is, you do not require any physical assistance, supervision, equipment, devices, or reminders for cognitive, social, behavioral, emotional, and physical function?",
            "identifier": "C125814",
            "notation": "ED2-Function Completely Independently",
            "pref_label": "Expanded DRS-PI Survivor Version - Function Completely Independently",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C125746-C125814"
        },
        {
            "alt_label": "ED2-Independent Work/Social Situations",
            "definition": "Expanded Disability Rating Scale - Postacute Interview Survivor Version - Can you function with complete independence in work or social situations?",
            "identifier": "C125822",
            "notation": "ED2-Independent Work/Social Situations",
            "pref_label": "Expanded DRS-PI Survivor Version - Function With Independent Work or Social Situations",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C125746-C125822"
        },
        {
            "alt_label": "ED2-Keep Track of Time/Schedules",
            "definition": "Expanded Disability Rating Scale - Postacute Interview Survivor Version - Can you keep track of time, schedules and appointments?",
            "identifier": "C125824",
            "notation": "ED2-Keep Track of Time/Schedules",
            "pref_label": "Expanded DRS-PI Survivor Version - Keep Track of Time",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C125746-C125824"
        },
        {
            "alt_label": "ED2-Know How to Bathe/Wash",
            "definition": "Expanded Disability Rating Scale - Postacute Interview Survivor Version - Do you know how to bathe and wash?",
            "identifier": "C125811",
            "notation": "ED2-Know How to Bathe/Wash",
            "pref_label": "Expanded DRS-PI Survivor Version - Know How to Bathe and Wash",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C125746-C125811"
        },
        {
            "alt_label": "ED2-Know Meal Times",
            "definition": "Expanded Disability Rating Scale - Postacute Interview Survivor Version - Do you know when meal or feeding times are?",
            "identifier": "C125806",
            "notation": "ED2-Know Meal Times",
            "pref_label": "Expanded DRS-PI Survivor Version - Know Meal Times",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C125746-C125806"
        },
        {
            "alt_label": "ED2-Know When to Use Toilet",
            "definition": "Expanded Disability Rating Scale - Postacute Interview Survivor Version - Do you know when to use the toilet or to conduct bowel and bladder management?",
            "identifier": "C125809",
            "notation": "ED2-Know When to Use Toilet",
            "pref_label": "Expanded DRS-PI Survivor Version - Know When to Use Toilet",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C125746-C125809"
        },
        {
            "alt_label": "ED2-Manage Clothing When Toileting",
            "definition": "Expanded Disability Rating Scale - Postacute Interview Survivor Version - Do you understand how to manage your clothing or special equipment when toileting or in bowel and bladder management?",
            "identifier": "C125808",
            "notation": "ED2-Manage Clothing When Toileting",
            "pref_label": "Expanded DRS-PI Survivor Version - Manage Clothing When Toileting",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C125746-C125808"
        },
        {
            "alt_label": "ED2-Need 24-Hour Care",
            "definition": "Expanded Disability Rating Scale - Postacute Interview Survivor Version - Do you need 24-hour care and are not able to help with your own care at all?",
            "identifier": "C125821",
            "notation": "ED2-Need 24-Hour Care",
            "pref_label": "Expanded DRS-PI Survivor Version - Need 24-Hour Care",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C125746-C125821"
        },
        {
            "alt_label": "ED2-Need a Helper Always Close By",
            "definition": "Expanded Disability Rating Scale - Postacute Interview Survivor Version - Do you take care of some of your needs but also need a helper who is always close by?",
            "identifier": "C125819",
            "notation": "ED2-Need a Helper Always Close By",
            "pref_label": "Expanded DRS-PI Survivor Version - Need a Helper Always Close By",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C125746-C125819"
        },
        {
            "alt_label": "ED2-Need Help With All Major Activities",
            "definition": "Expanded Disability Rating Scale - Postacute Interview Survivor Version - Do you need help with all major activities and the assistance of another person all the time?",
            "identifier": "C125820",
            "notation": "ED2-Need Help With All Major Activities",
            "pref_label": "Expanded DRS-PI Survivor Version - Need Help With All Major Activities",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C125746-C125820"
        },
        {
            "alt_label": "ED2-Perform Jobs, Manage Home/School",
            "definition": "Expanded Disability Rating Scale - Postacute Interview Survivor Version - How certain are you that you can perform in a wide variety of jobs of your choosing or manage a home independently or participate in school full-time?",
            "identifier": "C125825",
            "notation": "ED2-Perform Jobs, Manage Home/School",
            "pref_label": "Expanded DRS-PI Survivor Version - Perform Jobs or Manage a Home Independently",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C125746-C125825"
        },
        {
            "alt_label": "ED2-Require Assistance Managing Emotions",
            "definition": "Expanded Disability Rating Scale - Postacute Interview Survivor Version - Do you require assistance from another person to manage emotions and behavior?",
            "identifier": "C125818",
            "notation": "ED2-Require Assistance Managing Emotions",
            "pref_label": "Expanded DRS-PI Survivor Version - Require Assistance Managing Emotions",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C125746-C125818"
        },
        {
            "alt_label": "ED2-Require Assistance Thinking Tasks",
            "definition": "Expanded Disability Rating Scale - Postacute Interview Survivor Version - Do you require assistance from another person in tasks that require thinking abilities?",
            "identifier": "C125817",
            "notation": "ED2-Require Assistance Thinking Tasks",
            "pref_label": "Expanded DRS-PI Survivor Version - Require Assistance Thinking Tasks",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C125746-C125817"
        },
        {
            "alt_label": "ED2-Require Physical Assistance",
            "definition": "Expanded Disability Rating Scale - Postacute Interview Survivor Version - Do you require physical assistance from another person to meet daily needs?",
            "identifier": "C125816",
            "notation": "ED2-Require Physical Assistance",
            "pref_label": "Expanded DRS-PI Survivor Version - Require Physical Assistance",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C125746-C125816"
        },
        {
            "alt_label": "ED2-Require Specific Aids/Equipment",
            "definition": "Expanded Disability Rating Scale - Postacute Interview Survivor Version - Do you REQUIRE special aids or equipment, such as, a brace, walker, wheelchair, memory notebook, day planner, verbal reminders, prompts, cues, or alarm watch because of a disability?",
            "identifier": "C125815",
            "notation": "ED2-Require Specific Aids/Equipment",
            "pref_label": "Expanded DRS-PI Survivor Version - Require Special Aids or Equipment",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C125746-C125815"
        },
        {
            "alt_label": "ED2-Start/Finish Grooming Activities",
            "definition": "Expanded Disability Rating Scale - Postacute Interview Survivor Version - Can you start and finish these grooming activities without prompting?",
            "identifier": "C125813",
            "notation": "ED2-Start/Finish Grooming Activities",
            "pref_label": "Expanded DRS-PI Survivor Version - Start and Finish Grooming Activities",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C125746-C125813"
        },
        {
            "alt_label": "ED2-Successful With Accommodations",
            "definition": "Expanded Disability Rating Scale - Postacute Interview Survivor Version - How certain are you that you can be successful at work, school or in home management with some reduction in the work load or with other accommodations due to disabilities?",
            "identifier": "C125826",
            "notation": "ED2-Successful With Accommodations",
            "pref_label": "Expanded DRS-PI Survivor Version - Successful With Accommodations",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C125746-C125826"
        },
        {
            "alt_label": "ED2-Successful With Limited Choices",
            "definition": "Expanded Disability Rating Scale - Postacute Interview Survivor Version - How certain are you that you can be successful at work, school or in home management but with limited choices in jobs or school courses due to disabilities?",
            "identifier": "C125827",
            "notation": "ED2-Successful With Limited Choices",
            "pref_label": "Expanded DRS-PI Survivor Version - Successful With Limited Choices",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C125746-C125827"
        },
        {
            "alt_label": "ED2-Understand Feeding Utensils",
            "definition": "Expanded Disability Rating Scale - Postacute Interview Survivor Version - Do you understand what eating or feeding utensils or equipment are for and how they should be used?",
            "identifier": "C125805",
            "notation": "ED2-Understand Feeding Utensils",
            "pref_label": "Expanded DRS-PI Survivor Version - Understand Feeding Utensils",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C125746-C125805"
        },
        {
            "alt_label": "ED2-Understand How to Get Dressed",
            "definition": "Expanded Disability Rating Scale - Postacute Interview Survivor Version - Do you understand how to get dressed?",
            "identifier": "C125812",
            "notation": "ED2-Understand How to Get Dressed",
            "pref_label": "Expanded DRS-PI Survivor Version - Understand How to Get Dressed",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C125746-C125812"
        },
        {
            "alt_label": "ED2-Understand/Follow Directions",
            "definition": "Expanded Disability Rating Scale - Postacute Interview Survivor Version - Can you understand, remember, and follow directions?",
            "identifier": "C125823",
            "notation": "ED2-Understand/Follow Directions",
            "pref_label": "Expanded DRS-PI Survivor Version - Understand and Follow Directions",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C125746-C125823"
        },
        {
            "alt_label": "ED2-Use Toilet Independently",
            "definition": "Expanded Disability Rating Scale - Postacute Interview Survivor Version - Can you use the toilet or manage your bowel and bladder routine independently and appropriately without help or reminders?",
            "identifier": "C125807",
            "notation": "ED2-Use Toilet Independently",
            "pref_label": "Expanded DRS-PI Survivor Version - Use Toilet Independently",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C125746-C125807"
        },
        {
            "alt_label": "ED2-Work With Frequent Support",
            "definition": "Expanded Disability Rating Scale - Postacute Interview Survivor Version - How certain are you that you can be able to work at home or in a special setting like a sheltered workshop in which the work is very routine and there is very frequent supervision and support?",
            "identifier": "C125828",
            "notation": "ED2-Work With Frequent Support",
            "pref_label": "Expanded DRS-PI Survivor Version - Work With Frequent Supervision and Support",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C125746-C125828"
        }
    ]
}