{
    "SKOS_CONCEPT": [
        {
            "alt_label": "VFQ2-Accomplish Less Than You Would Like",
            "definition": "National Eye Institute Visual Functioning Questionnaire - 25 Version 2000 Self-Administered Format - Responses to Vision Problems: Do you accomplish less than you would like because of your vision?",
            "identifier": "C112791",
            "notation": "VFQ2-Accomplish Less Than You Would Like",
            "pref_label": "VFQ25-Self Administered Format - Accomplish Less Because of Vision",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C112454-C112791"
        },
        {
            "alt_label": "VFQ2-Are You Currently Driving",
            "definition": "National Eye Institute Visual Functioning Questionnaire - 25 Version 2000 Self-Administered Format - Difficulty With Activities: Are you currently driving, at least once in a while?",
            "identifier": "C112785",
            "notation": "VFQ2-Are You Currently Driving",
            "pref_label": "VFQ25-Self Administered Format - Are You Currently Driving",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C112454-C112785"
        },
        {
            "alt_label": "VFQ2-Difficulty Doing Work/Hobbies",
            "definition": "National Eye Institute Visual Functioning Questionnaire - 25 Version 2000 Self-Administered Format - Difficulty With Activities: How much difficulty do you have doing work or hobbies that require you to see well up close, such as cooking, sewing, fixing things around the house, or using hand tools? Would you say:",
            "identifier": "C112776",
            "notation": "VFQ2-Difficulty Doing Work/Hobbies",
            "pref_label": "VFQ25-Self Administered Format - Difficulty Doing Work or Hobbies",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C112454-C112776"
        },
        {
            "alt_label": "VFQ2-Difficulty Driving at Night",
            "definition": "National Eye Institute Visual Functioning Questionnaire - 25 Version 2000 Self-Administered Format - Difficulty With Activities: How much difficulty do you have driving at night? Would you say you have:",
            "identifier": "C112789",
            "notation": "VFQ2-Difficulty Driving at Night",
            "pref_label": "VFQ25-Self Administered Format - Difficulty Driving at Night",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C112454-C112789"
        },
        {
            "alt_label": "VFQ2-Difficulty Driving During Daytime",
            "definition": "National Eye Institute Visual Functioning Questionnaire - 25 Version 2000 Self-Administered Format - Difficulty With Activities: If currently driving: How much difficulty do you have driving during the daytime in familiar places? Would you say you have:",
            "identifier": "C112788",
            "notation": "VFQ2-Difficulty Driving During Daytime",
            "pref_label": "VFQ25-Self Administered Format - Difficulty Driving During Daytime",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C112454-C112788"
        },
        {
            "alt_label": "VFQ2-Difficulty Entertaining Friends",
            "definition": "National Eye Institute Visual Functioning Questionnaire - 25 Version 2000 Self-Administered Format - Social Function: Because of your eyesight, how much difficulty do you have entertaining friends and family in your home?",
            "identifier": "C112808",
            "notation": "VFQ2-Difficulty Entertaining Friends",
            "pref_label": "VFQ25-Self Administered Format - Difficulty Entertaining Friends and Family in Home",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C112454-C112808"
        },
        {
            "alt_label": "VFQ2-Difficulty Figure Out Bill Accuracy",
            "definition": "National Eye Institute Visual Functioning Questionnaire - 25 Version 2000 Self-Administered Format - Near Vision: Because of your eyesight, how much difficulty do you have figuring out whether bills you receive are accurate?",
            "identifier": "C112803",
            "notation": "VFQ2-Difficulty Figure Out Bill Accuracy",
            "pref_label": "VFQ25-Self Administered Format - Difficulty Figure Out Bill Accuracy",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C112454-C112803"
        },
        {
            "alt_label": "VFQ2-Difficulty Finding on Crowded Shelf",
            "definition": "National Eye Institute Visual Functioning Questionnaire - 25 Version 2000 Self-Administered Format - Difficulty With Activities: Because of your eyesight, how much difficulty do you have finding something on a crowded shelf?",
            "identifier": "C112777",
            "notation": "VFQ2-Difficulty Finding on Crowded Shelf",
            "pref_label": "VFQ25-Self Administered Format - Difficulty Finding Something On a Shelf",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C112454-C112777"
        },
        {
            "alt_label": "VFQ2-Difficulty Going Down Step at Night",
            "definition": "National Eye Institute Visual Functioning Questionnaire - 25 Version 2000 Self-Administered Format - Difficulty With Activities: Because of your eyesight, how much difficulty do you have going down steps, stairs, or curbs in dim light or at night?",
            "identifier": "C112779",
            "notation": "VFQ2-Difficulty Going Down Step at Night",
            "pref_label": "VFQ25-Self Administered Format - Difficulty Going Down Steps at Night",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C112454-C112779"
        },
        {
            "alt_label": "VFQ2-Difficulty Going Out to See Movies",
            "definition": "National Eye Institute Visual Functioning Questionnaire - 25 Version 2000 Self-Administered Format - Difficulty With Activities: Because of your eyesight, how much difficulty do you have going out to see movies, plays, or sports events?",
            "identifier": "C112784",
            "notation": "VFQ2-Difficulty Going Out to See Movies",
            "pref_label": "VFQ25-Self Administered Format - Difficulty Going Out to See Movies",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C112454-C112784"
        },
        {
            "alt_label": "VFQ2-Difficulty Noticing Objects to Side",
            "definition": "National Eye Institute Visual Functioning Questionnaire - 25 Version 2000 Self-Administered Format - Difficulty With Activities: Because of your eyesight, how much difficulty do you have noticing objects off to the side while you are walking along?",
            "identifier": "C112780",
            "notation": "VFQ2-Difficulty Noticing Objects to Side",
            "pref_label": "VFQ25-Self Administered Format - Difficulty Noticing Objects Off to the Side While Walking",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C112454-C112780"
        },
        {
            "alt_label": "VFQ2-Difficulty Picking Out Own Clothes",
            "definition": "National Eye Institute Visual Functioning Questionnaire - 25 Version 2000 Self-Administered Format - Difficulty With Activities: Because of your eyesight, how much difficulty do you have picking out and matching your own clothes?",
            "identifier": "C112782",
            "notation": "VFQ2-Difficulty Picking Out Own Clothes",
            "pref_label": "VFQ25-Self Administered Format - Difficulty Picking Out and Matching Own Clothes",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C112454-C112782"
        },
        {
            "alt_label": "VFQ2-Difficulty Reading Newspapers",
            "definition": "National Eye Institute Visual Functioning Questionnaire - 25 Version 2000 Self-Administered Format - Difficulty With Activities: How much difficulty do you have reading ordinary print in newspapers? Would you say you have:",
            "identifier": "C112775",
            "notation": "VFQ2-Difficulty Reading Newspapers",
            "pref_label": "VFQ25-Self Administered Format - Difficulty Reading Ordinary Print in Newspapers",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C112454-C112775"
        },
        {
            "alt_label": "VFQ2-Difficulty Reading Small Print",
            "definition": "National Eye Institute Visual Functioning Questionnaire - 25 Version 2000 Self-Administered Format - Near Vision: Wearing glasses, how much difficulty do you have reading the small print in a telephone book, on a medicine bottle, or on legal forms? Would you say:",
            "identifier": "C112802",
            "notation": "VFQ2-Difficulty Reading Small Print",
            "pref_label": "VFQ25-Self Administered Format - Difficulty Reading Small Print",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C112454-C112802"
        },
        {
            "alt_label": "VFQ2-Difficulty Reading Street Signs",
            "definition": "National Eye Institute Visual Functioning Questionnaire - 25 Version 2000 Self-Administered Format - Difficulty With Activities: How much difficulty do you have reading street signs or the names of stores?",
            "identifier": "C112778",
            "notation": "VFQ2-Difficulty Reading Street Signs",
            "pref_label": "VFQ25-Self Administered Format - Difficulty Reading Street Signs",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C112454-C112778"
        },
        {
            "alt_label": "VFQ2-Difficulty Recognizing People",
            "definition": "National Eye Institute Visual Functioning Questionnaire - 25 Version 2000 Self-Administered Format - Distance Vision: Because of your eyesight, how much difficulty do you have recognizing people you know from across a room?",
            "identifier": "C112805",
            "notation": "VFQ2-Difficulty Recognizing People",
            "pref_label": "VFQ25-Self Administered Format - Difficulty Recognizing People You Know",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C112454-C112805"
        },
        {
            "alt_label": "VFQ2-Difficulty Seeing How People React",
            "definition": "National Eye Institute Visual Functioning Questionnaire - 25 Version 2000 Self-Administered Format - Difficulty With Activities: Because of your eyesight, how much difficulty do you have seeing how people react to things you say?",
            "identifier": "C112781",
            "notation": "VFQ2-Difficulty Seeing How People React",
            "pref_label": "VFQ25-Self Administered Format - Difficulty Seeing How People React",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C112454-C112781"
        },
        {
            "alt_label": "VFQ2-Difficulty Seeing Programs on TV",
            "definition": "National Eye Institute Visual Functioning Questionnaire - 25 Version 2000 Self-Administered Format - Distance Vision: Because of your eyesight, how much difficulty do you have seeing and enjoying programs on TV?",
            "identifier": "C112807",
            "notation": "VFQ2-Difficulty Seeing Programs on TV",
            "pref_label": "VFQ25-Self Administered Format - Difficulty Seeing and Enjoying Programs on TV",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C112454-C112807"
        },
        {
            "alt_label": "VFQ2-Difficulty Shaving or Styling Hair",
            "definition": "National Eye Institute Visual Functioning Questionnaire - 25 Version 2000 Self-Administered Format - Near Vision: Because of your eyesight, how much difficulty do you have doing things like shaving, styling your hair, or putting on makeup?",
            "identifier": "C112804",
            "notation": "VFQ2-Difficulty Shaving or Styling Hair",
            "pref_label": "VFQ25-Self Administered Format - Difficulty Shaving or Styling Hair or Putting On Makeup",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C112454-C112804"
        },
        {
            "alt_label": "VFQ2-Difficulty Taking Part in Sports",
            "definition": "National Eye Institute Visual Functioning Questionnaire - 25 Version 2000 Self-Administered Format - Distance Vision: Because of your eyesight, how much difficulty do you have taking part in active sports or other outdoor activities that you enjoy (like golf, bowling, jogging, or walking)?",
            "identifier": "C112806",
            "notation": "VFQ2-Difficulty Taking Part in Sports",
            "pref_label": "VFQ25-Self Administered Format - Difficulty Taking Part in Sports or Outdoor Activities",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C112454-C112806"
        },
        {
            "alt_label": "VFQ2-Difficulty Visiting With People",
            "definition": "National Eye Institute Visual Functioning Questionnaire - 25 Version 2000 Self-Administered Format - Difficulty With Activities: Because of your eyesight, how much difficulty do you have visiting with people in their homes, at parties, or in restaurants?",
            "identifier": "C112783",
            "notation": "VFQ2-Difficulty Visiting With People",
            "pref_label": "VFQ25-Self Administered Format - Difficulty Visiting People",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C112454-C112783"
        },
        {
            "alt_label": "VFQ2-Do You Have More Help From Others",
            "definition": "National Eye Institute Visual Functioning Questionnaire - 25 Version 2000 Self-Administered Format - Role Limitations: Do you have more help from others because of your vision?",
            "identifier": "C112809",
            "notation": "VFQ2-Do You Have More Help From Others",
            "pref_label": "VFQ25-Self Administered Format - Do You Have More Help From Others",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C112454-C112809"
        },
        {
            "alt_label": "VFQ2-Driving in Difficult Conditions",
            "definition": "National Eye Institute Visual Functioning Questionnaire - 25 Version 2000 Self-Administered Format - Difficulty With Activities: How much difficulty do you have driving in difficult conditions, such as in bad weather, during rush hour, on the freeway, or in city traffic? Would you say you have:",
            "identifier": "C112790",
            "notation": "VFQ2-Driving in Difficult Conditions",
            "pref_label": "VFQ25-Self Administered Format - Driving in Difficult Condition",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C112454-C112790"
        },
        {
            "alt_label": "VFQ2-Eye Pain Keep From Doing What Like",
            "definition": "National Eye Institute Visual Functioning Questionnaire - 25 Version 2000 Self-Administered Format - Responses to Vision Problems: How much does pain or discomfort in or around your eyes, for example, burning, itching, or aching, keep you from doing what you'd like to be doing? Would you say:",
            "identifier": "C112793",
            "notation": "VFQ2-Eye Pain Keep From Doing What Like",
            "pref_label": "VFQ25-Self Administered Format - Pain in Eyes Keep You From Doing What You Like",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C112454-C112793"
        },
        {
            "alt_label": "VFQ2-Eyesight Using Both Eyes Is",
            "definition": "National Eye Institute Visual Functioning Questionnaire - 25 Version 2000 Self-Administered Format - General Health and Vision: At the present time, would you say your eyesight using both eyes (with glasses or contact lenses, if you wear them) is excellent, good, fair, poor, or very poor or are you completely blind?",
            "identifier": "C112772",
            "notation": "VFQ2-Eyesight Using Both Eyes Is",
            "pref_label": "VFQ25-Self Administered Format - Eyesight Using Both Eyes",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C112454-C112772"
        },
        {
            "alt_label": "VFQ2-How Much Pain in and Around Eyes",
            "definition": "National Eye Institute Visual Functioning Questionnaire - 25 Version 2000 Self-Administered Format - General Health and Vision: How much pain or discomfort have you had in and around your eyes (for example, burning, itching, or aching)? Would you say it is:",
            "identifier": "C112774",
            "notation": "VFQ2-How Much Pain in and Around Eyes",
            "pref_label": "VFQ25-Self Administered Format - Pain or Discomfort You Had in and Around Eyes",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C112454-C112774"
        },
        {
            "alt_label": "VFQ2-How Often You Worry About Eyesight",
            "definition": "National Eye Institute Visual Functioning Questionnaire - 25 Version 2000 Self-Administered Format - General Health and Vision: How much of the time do you worry about your eyesight?",
            "identifier": "C112773",
            "notation": "VFQ2-How Often You Worry About Eyesight",
            "pref_label": "VFQ25-Self Administered Format - Time Spent Worry About Eyesight",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C112454-C112773"
        },
        {
            "alt_label": "VFQ2-I Don't Go Out of My Home Alone",
            "definition": "National Eye Institute Visual Functioning Questionnaire - 25 Version 2000 Self-Administered Format - Dependency: I don't go out of my home alone, because of my eyesight.",
            "identifier": "C112812",
            "notation": "VFQ2-I Don't Go Out of My Home Alone",
            "pref_label": "VFQ25-Self Administered Format - Don't Go Out of Home Alone Because of Eyesight",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C112454-C112812"
        },
        {
            "alt_label": "VFQ2-I Feel Frustrated a Lot of the Time",
            "definition": "National Eye Institute Visual Functioning Questionnaire - 25 Version 2000 Self-Administered Format - Responses to Vision Problems: I feel frustrated a lot of the time because of my eyesight.",
            "identifier": "C112795",
            "notation": "VFQ2-I Feel Frustrated a Lot of the Time",
            "pref_label": "VFQ25-Self Administered Format - Feel Frustrated Because of Eyesight",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C112454-C112795"
        },
        {
            "alt_label": "VFQ2-I Need a Lot of Help From Others",
            "definition": "National Eye Institute Visual Functioning Questionnaire - 25 Version 2000 Self-Administered Format - Responses to Vision Problems: I need a lot of help from others because of my eyesight.",
            "identifier": "C112798",
            "notation": "VFQ2-I Need a Lot of Help From Others",
            "pref_label": "VFQ25-Self Administered Format - Need Help From Others Because of Eyesight",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C112454-C112798"
        },
        {
            "alt_label": "VFQ2-I Stay Home Most of the Time",
            "definition": "National Eye Institute Visual Functioning Questionnaire - 25 Version 2000 Self-Administered Format - Responses to Vision Problems: I stay home most of the time because of my eyesight.",
            "identifier": "C112794",
            "notation": "VFQ2-I Stay Home Most of the Time",
            "pref_label": "VFQ25-Self Administered Format - Stay Home Because of Eyesight",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C112454-C112794"
        },
        {
            "alt_label": "VFQ2-Limited in How Long You Can Work",
            "definition": "National Eye Institute Visual Functioning Questionnaire - 25 Version 2000 Self-Administered Format - Responses to Vision Problems: Are you limited in how long you can work or do other activities because of your vision?",
            "identifier": "C112792",
            "notation": "VFQ2-Limited in How Long You Can Work",
            "pref_label": "VFQ25-Self Administered Format - Limited in How Long You Can Work Because of Vision",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C112454-C112792"
        },
        {
            "alt_label": "VFQ2-Limited in Kinds of Things Can Do",
            "definition": "National Eye Institute Visual Functioning Questionnaire - 25 Version 2000 Self-Administered Format - Role Limitations: Are you limited in the kinds of things you can do because of your vision?",
            "identifier": "C112810",
            "notation": "VFQ2-Limited in Kinds of Things Can Do",
            "pref_label": "VFQ25-Self Administered Format - Limited in Kinds of Things Can Do",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C112454-C112810"
        },
        {
            "alt_label": "VFQ2-Main Reason You Gave Up Driving",
            "definition": "National Eye Institute Visual Functioning Questionnaire - 25 Version 2000 Self-Administered Format - Difficulty With Activities: If you gave up driving: Was that mainly because of your eyesight, mainly for some other reason, or because of both your eyesight and other reasons?",
            "identifier": "C112787",
            "notation": "VFQ2-Main Reason You Gave Up Driving",
            "pref_label": "VFQ25-Self Administered Format - Main Reason You Gave Up Driving",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C112454-C112787"
        },
        {
            "alt_label": "VFQ2-Much Less Control Over What I Do",
            "definition": "National Eye Institute Visual Functioning Questionnaire - 25 Version 2000 Self-Administered Format - Responses to Vision Problems: I have much less control over what I do, because of my eyesight.",
            "identifier": "C112796",
            "notation": "VFQ2-Much Less Control Over What I Do",
            "pref_label": "VFQ25-Self Administered Format - Have Less Control Because of Eyesight",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C112454-C112796"
        },
        {
            "alt_label": "VFQ2-Never Driven or Given Up Driving",
            "definition": "National Eye Institute Visual Functioning Questionnaire - 25 Version 2000 Self-Administered Format - Difficulty With Activities: If no: Have you never driven a car or have you given up driving?",
            "identifier": "C112786",
            "notation": "VFQ2-Never Driven or Given Up Driving",
            "pref_label": "VFQ25-Self Administered Format - Never Driven or Given Up Driving",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C112454-C112786"
        },
        {
            "alt_label": "VFQ2-Often Irritable Because Eyesight",
            "definition": "National Eye Institute Visual Functioning Questionnaire - 25 Version 2000 Self-Administered Format - Well-Being/Distress: I am often irritable because of my eyesight.",
            "identifier": "C112811",
            "notation": "VFQ2-Often Irritable Because Eyesight",
            "pref_label": "VFQ25-Self Administered Format - Often Irritable Because of Eyesight",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C112454-C112811"
        },
        {
            "alt_label": "VFQ2-Rate Your Eyesight Now",
            "definition": "National Eye Institute Visual Functioning Questionnaire - 25 Version 2000 Self-Administered Format - General Vision: How would you rate your eyesight now (with glasses or contact lens on, if you wear them), on a scale of from 0 to 10, where zero means the worst possible eyesight, as bad or worse than being blind, and 10 means the best possible eyesight?",
            "identifier": "C112801",
            "notation": "VFQ2-Rate Your Eyesight Now",
            "pref_label": "VFQ25-Self Administered Format - Rate Your Eyesight Now",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C112454-C112801"
        },
        {
            "alt_label": "VFQ2-Rate Your Overall Health",
            "definition": "National Eye Institute Visual Functioning Questionnaire - 25 Version 2000 Self-Administered Format - General Health: How would you rate your overall health, on a scale where zero is as bad as death and 10 is best possible health?",
            "identifier": "C112800",
            "notation": "VFQ2-Rate Your Overall Health",
            "pref_label": "VFQ25-Self Administered Format - Rate Your Overall Health",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C112454-C112800"
        },
        {
            "alt_label": "VFQ2-Rely Too Much on What Others Tell",
            "definition": "National Eye Institute Visual Functioning Questionnaire - 25 Version 2000 Self-Administered Format - Responses to Vision Problems: Because of my eyesight, I have to rely too much on what other people tell me.",
            "identifier": "C112797",
            "notation": "VFQ2-Rely Too Much on What Others Tell",
            "pref_label": "VFQ25-Self Administered Format - Have to Rely On Other People Because of Eyesight",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C112454-C112797"
        },
        {
            "alt_label": "VFQ2-Worry I'll Do Embarrassing Things",
            "definition": "National Eye Institute Visual Functioning Questionnaire - 25 Version 2000 Self-Administered Format - Responses to Vision Problems: I worry about doing things that will embarrass myself or others, because of my eyesight.",
            "identifier": "C112799",
            "notation": "VFQ2-Worry I'll Do Embarrassing Things",
            "pref_label": "VFQ25-Self Administered Format - Worry About Embarrass Myself or Others Because of Eyesight",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C112454-C112799"
        },
        {
            "alt_label": "VFQ2-Your Overall Health Is",
            "definition": "National Eye Institute Visual Functioning Questionnaire - 25 Version 2000 Self-Administered Format - General Health and Vision: In general, would you say your overall health is:",
            "identifier": "C112771",
            "notation": "VFQ2-Your Overall Health Is",
            "pref_label": "VFQ25-Self Administered Format - Overall Health",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C112454-C112771"
        }
    ]
}