{
    "SKOS_CONCEPT": [
        {
            "alt_label": "SGRQ01-Afraid When Cannot Catch Breath",
            "definition": "St. George's Respiratory Questionnaire Past 3 Months Version - These are questions about other effects that your respiratory problems may have on you these days: I get afraid or panic when I cannot catch my breath.",
            "identifier": "C112653",
            "notation": "SGRQ01-Afraid When Cannot Catch Breath",
            "pref_label": "SGRQ Past 3 Months Version - Get Afraid When Cannot Catch My Breath",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C112448-C112653"
        },
        {
            "alt_label": "SGRQ01-Cannot Go Out for Entertainment",
            "definition": "St. George's Respiratory Questionnaire Past 3 Months Version - We would like to know how your respiratory problems usually affect your daily life: I cannot go out for entertainment or recreation.",
            "identifier": "C112673",
            "notation": "SGRQ01-Cannot Go Out for Entertainment",
            "pref_label": "SGRQ Past 3 Months Version - Cannot Go Out for Entertainment",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C112448-C112673"
        },
        {
            "alt_label": "SGRQ01-Cannot Go Out to Do Shopping",
            "definition": "St. George's Respiratory Questionnaire Past 3 Months Version - We would like to know how your respiratory problems usually affect your daily life: I cannot go out of the house to do the shopping.",
            "identifier": "C112674",
            "notation": "SGRQ01-Cannot Go Out to Do Shopping",
            "pref_label": "SGRQ Past 3 Months Version - Cannot Go Out to Do Shopping",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C112448-C112674"
        },
        {
            "alt_label": "SGRQ01-Cough Is Embarrassing in Public",
            "definition": "St. George's Respiratory Questionnaire Past 3 Months Version - These are questions about other effects that your respiratory problems may have on you these days: My cough or breathing is embarrassing in public.",
            "identifier": "C112651",
            "notation": "SGRQ01-Cough Is Embarrassing in Public",
            "pref_label": "SGRQ Past 3 Months Version - My Cough is Embarrassing in Public",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C112448-C112651"
        },
        {
            "alt_label": "SGRQ01-Coughing Disturbs My Sleep",
            "definition": "St. George's Respiratory Questionnaire Past 3 Months Version - These are more questions about your cough and shortness of breath these days: My coughing or breathing disturbs my sleep.",
            "identifier": "C112649",
            "notation": "SGRQ01-Coughing Disturbs My Sleep",
            "pref_label": "SGRQ Past 3 Months Version - Coughing Disturbs My Sleep",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C112448-C112649"
        },
        {
            "alt_label": "SGRQ01-Coughing Hurts",
            "definition": "St. George's Respiratory Questionnaire Past 3 Months Version - These are more questions about your cough and shortness of breath these days: Coughing hurts.",
            "identifier": "C112645",
            "notation": "SGRQ01-Coughing Hurts",
            "pref_label": "SGRQ Past 3 Months Version - Coughing Hurts",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C112448-C112645"
        },
        {
            "alt_label": "SGRQ01-Coughing Makes Me Tired",
            "definition": "St. George's Respiratory Questionnaire Past 3 Months Version - These are more questions about your cough and shortness of breath these days: Coughing makes me tired.",
            "identifier": "C112646",
            "notation": "SGRQ01-Coughing Makes Me Tired",
            "pref_label": "SGRQ Past 3 Months Version - Coughing Makes Me Tired",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C112448-C112646"
        },
        {
            "alt_label": "SGRQ01-Describe Your Current Health",
            "definition": "St. George's Respiratory Questionnaire Past 3 Months Version - Please check one box to show how you describe your current health.",
            "identifier": "C112627",
            "notation": "SGRQ01-Describe Your Current Health",
            "pref_label": "SGRQ Past 3 Months Version - Describe Your Current Health",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C112448-C112627"
        },
        {
            "alt_label": "SGRQ01-Describe Your Resp Condition",
            "definition": "St. George's Respiratory Questionnaire Past 3 Months Version - How would you describe your respiratory condition?",
            "identifier": "C112636",
            "notation": "SGRQ01-Describe Your Resp Condition",
            "pref_label": "SGRQ Past 3 Months Version - Describe Your Respiratory Condition",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C112448-C112636"
        },
        {
            "alt_label": "SGRQ01-Difficult to Carry Heavy Loads",
            "definition": "St. George's Respiratory Questionnaire Past 3 Months Version - These are questions about how your activities might be affected by your respiratory problems: My breathing makes it difficult to do things such as carry heavy loads, dig in the garden or shovel snow, jog or walk briskly (5 miles per hour), play tennis or swim.",
            "identifier": "C112670",
            "notation": "SGRQ01-Difficult to Carry Heavy Loads",
            "pref_label": "SGRQ Past 3 Months Version - Breathing Makes Difficult to Carry Heavy Loads",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C112448-C112670"
        },
        {
            "alt_label": "SGRQ01-Difficult to Do Very Heavy Work",
            "definition": "St. George's Respiratory Questionnaire Past 3 Months Version - These are questions about how your activities might be affected by your respiratory problems: My breathing makes it difficult to do things such as very heavy manual work, ride a bike, run, swim fast, or play competitive sports.",
            "identifier": "C112671",
            "notation": "SGRQ01-Difficult to Do Very Heavy Work",
            "pref_label": "SGRQ Past 3 Months Version - Breathing Makes Difficult to Do Heavy Manual Work",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C112448-C112671"
        },
        {
            "alt_label": "SGRQ01-Difficult to Walk Up Hills",
            "definition": "St. George's Respiratory Questionnaire Past 3 Months Version - These are questions about how your activities might be affected by your respiratory problems: My breathing makes it difficult to do things such as walk up hills, carry things up stairs, light gardening such as weeding, dance, bowl or play golf.",
            "identifier": "C112669",
            "notation": "SGRQ01-Difficult to Walk Up Hills",
            "pref_label": "SGRQ Past 3 Months Version - Breathing Makes Difficult to Walk Up Hills",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C112448-C112669"
        },
        {
            "alt_label": "SGRQ01-Embarrassed Using Med in Public",
            "definition": "St. George's Respiratory Questionnaire Past 3 Months Version - These are questions about your respiratory treatment: I get embarrassed using my medication in public.",
            "identifier": "C112660",
            "notation": "SGRQ01-Embarrassed Using Med in Public",
            "pref_label": "SGRQ Past 3 Months Version - Embarrassed Using Medication in Public",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C112448-C112660"
        },
        {
            "alt_label": "SGRQ01-Everything Too Much Effort",
            "definition": "St. George's Respiratory Questionnaire Past 3 Months Version - These are questions about other effects that your respiratory problems may have on you these days: Everything seems too much of an effort.",
            "identifier": "C112658",
            "notation": "SGRQ01-Everything Too Much Effort",
            "pref_label": "SGRQ Past 3 Months Version - Everything Too Much Effort",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C112448-C112658"
        },
        {
            "alt_label": "SGRQ01-Exercise Is Not Safe for Me",
            "definition": "St. George's Respiratory Questionnaire Past 3 Months Version - These are questions about other effects that your respiratory problems may have on you these days: Exercise is not safe for me.",
            "identifier": "C112657",
            "notation": "SGRQ01-Exercise Is Not Safe for Me",
            "pref_label": "SGRQ Past 3 Months Version - Exercise Is Not Safe for Me",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C112448-C112657"
        },
        {
            "alt_label": "SGRQ01-How Long Worst Resp Attack Last",
            "definition": "St. George's Respiratory Questionnaire Past 3 Months Version - How long did the worst respiratory attack last?",
            "identifier": "C112633",
            "notation": "SGRQ01-How Long Worst Resp Attack Last",
            "pref_label": "SGRQ Past 3 Months Version - How Long Did Worst Respiratory Attack Last",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C112448-C112633"
        },
        {
            "alt_label": "SGRQ01-How Many Good Days Have You Had",
            "definition": "St. George's Respiratory Questionnaire Past 3 Months Version - Over the past 3 months, in a typical week, how many good days (with few respiratory problems) have you had?",
            "identifier": "C112634",
            "notation": "SGRQ01-How Many Good Days Have You Had",
            "pref_label": "SGRQ Past 3 Months Version - How Many Good Days You Had",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C112448-C112634"
        },
        {
            "alt_label": "SGRQ01-How Resp Problems Affect You",
            "definition": "St. George's Respiratory Questionnaire Past 3 Months Version - Best describe how your respiratory problems affect you.",
            "identifier": "C112677",
            "notation": "SGRQ01-How Resp Problems Affect You",
            "pref_label": "SGRQ Past 3 Months Version - How Respiratory Problems Affect You",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C112448-C112677"
        },
        {
            "alt_label": "SGRQ01-I Cannot Do Household Chores",
            "definition": "St. George's Respiratory Questionnaire Past 3 Months Version - We would like to know how your respiratory problems usually affect your daily life: I cannot do household chores.",
            "identifier": "C112675",
            "notation": "SGRQ01-I Cannot Do Household Chores",
            "pref_label": "SGRQ Past 3 Months Version - Cannot Do Household Chores",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C112448-C112675"
        },
        {
            "alt_label": "SGRQ01-I Cannot Move Far From My Bed",
            "definition": "St. George's Respiratory Questionnaire Past 3 Months Version - We would like to know how your respiratory problems usually affect your daily life: I cannot move far from my bed or chair.",
            "identifier": "C112676",
            "notation": "SGRQ01-I Cannot Move Far From My Bed",
            "pref_label": "SGRQ Past 3 Months Version - Cannot Move Far From Bed or Chair",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C112448-C112676"
        },
        {
            "alt_label": "SGRQ01-I Cannot Play Sports",
            "definition": "St. George's Respiratory Questionnaire Past 3 Months Version - We would like to know how your respiratory problems usually affect your daily life: I cannot play sports or do other physical activities.",
            "identifier": "C112672",
            "notation": "SGRQ01-I Cannot Play Sports",
            "pref_label": "SGRQ Past 3 Months Version - Cannot Play Sports or Do Physical Activities",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C112448-C112672"
        },
        {
            "alt_label": "SGRQ01-I Cannot Take a Bath or Shower",
            "definition": "St. George's Respiratory Questionnaire Past 3 Months Version - These are questions about how your activities might be affected by your respiratory problems: I cannot take a bath or shower, or I take a long time to do it.",
            "identifier": "C112664",
            "notation": "SGRQ01-I Cannot Take a Bath or Shower",
            "pref_label": "SGRQ Past 3 Months Version - Cannot Take a Bath or Shower",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C112448-C112664"
        },
        {
            "alt_label": "SGRQ01-I Get Exhausted Easily",
            "definition": "St. George's Respiratory Questionnaire Past 3 Months Version - These are more questions about your cough and shortness of breath these days: I get exhausted easily.",
            "identifier": "C112650",
            "notation": "SGRQ01-I Get Exhausted Easily",
            "pref_label": "SGRQ Past 3 Months Version - I Get Exhausted Easily",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C112448-C112650"
        },
        {
            "alt_label": "SGRQ01-I Have Become Frail",
            "definition": "St. George's Respiratory Questionnaire Past 3 Months Version - These are questions about other effects that your respiratory problems may have on you these days: I have become frail or an invalid because of my respiratory problems.",
            "identifier": "C112656",
            "notation": "SGRQ01-I Have Become Frail",
            "pref_label": "SGRQ Past 3 Months Version - Become Frail or Invalid Because of My Respiratory Problems",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C112448-C112656"
        },
        {
            "alt_label": "SGRQ01-I Have Brought Up Phlegm",
            "definition": "St. George's Respiratory Questionnaire Past 3 Months Version - Over the past 3 months, I have brought up phlegm (sputum).",
            "identifier": "C112629",
            "notation": "SGRQ01-I Have Brought Up Phlegm",
            "pref_label": "SGRQ Past 3 Months Version - I Have Brought Up Phlegm",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C112448-C112629"
        },
        {
            "alt_label": "SGRQ01-I Have Coughed",
            "definition": "St. George's Respiratory Questionnaire Past 3 Months Version - Over the past 3 months, I have coughed.",
            "identifier": "C112628",
            "notation": "SGRQ01-I Have Coughed",
            "pref_label": "SGRQ Past 3 Months Version - I Have Coughed",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C112448-C112628"
        },
        {
            "alt_label": "SGRQ01-I Have Had Shortness of Breath",
            "definition": "St. George's Respiratory Questionnaire Past 3 Months Version - Over the past 3 months, I have had shortness of breath.",
            "identifier": "C112630",
            "notation": "SGRQ01-I Have Had Shortness of Breath",
            "pref_label": "SGRQ Past 3 Months Version - I Have Had Shortness of Breath",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C112448-C112630"
        },
        {
            "alt_label": "SGRQ01-I Have Had Wheezing Attacks",
            "definition": "St. George's Respiratory Questionnaire Past 3 Months Version - Over the past 3 months, I have had wheezing attacks.",
            "identifier": "C112631",
            "notation": "SGRQ01-I Have Had Wheezing Attacks",
            "pref_label": "SGRQ Past 3 Months Version - I Have Had Wheezing Attacks",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C112448-C112631"
        },
        {
            "alt_label": "SGRQ01-I Walk Slower Than Other People",
            "definition": "St. George's Respiratory Questionnaire Past 3 Months Version - These are questions about how your activities might be affected by your respiratory problems: I walk slower than other people my age, or I stop to rest.",
            "identifier": "C112665",
            "notation": "SGRQ01-I Walk Slower Than Other People",
            "pref_label": "SGRQ Past 3 Months Version - Walk Slower Than Other People My Age",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C112448-C112665"
        },
        {
            "alt_label": "SGRQ01-If I Hurry, I Have to Stop",
            "definition": "St. George's Respiratory Questionnaire Past 3 Months Version - These are questions about how your activities might be affected by your respiratory problems: If I hurry or walk fast, I have to stop or slow down.",
            "identifier": "C112668",
            "notation": "SGRQ01-If I Hurry, I Have to Stop",
            "pref_label": "SGRQ Past 3 Months Version - If Walk Fast I Have to Stop or Slow Down",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C112448-C112668"
        },
        {
            "alt_label": "SGRQ01-If You Have Ever Held a Job",
            "definition": "St. George's Respiratory Questionnaire Past 3 Months Version - If you have ever held a job.",
            "identifier": "C112637",
            "notation": "SGRQ01-If You Have Ever Held a Job",
            "pref_label": "SGRQ Past 3 Months Version - Held a Job",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C112448-C112637"
        },
        {
            "alt_label": "SGRQ01-Jobs Take a Long Time",
            "definition": "St. George's Respiratory Questionnaire Past 3 Months Version - These are questions about how your activities might be affected by your respiratory problems: Jobs such as household chores take a long time, or I have to stop to rest.",
            "identifier": "C112666",
            "notation": "SGRQ01-Jobs Take a Long Time",
            "pref_label": "SGRQ Past 3 Months Version - Jobs Take Long Time or I Have to Stop",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C112448-C112666"
        },
        {
            "alt_label": "SGRQ01-Not Expect Probs to Get Better",
            "definition": "St. George's Respiratory Questionnaire Past 3 Months Version - These are questions about other effects that your respiratory problems may have on you these days: I do not expect my respiratory problems to get any better.",
            "identifier": "C112655",
            "notation": "SGRQ01-Not Expect Probs to Get Better",
            "pref_label": "SGRQ Past 3 Months Version - Not Expect Respiratory Problems Get Better",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C112448-C112655"
        },
        {
            "alt_label": "SGRQ01-Not in Control of Resp Problems",
            "definition": "St. George's Respiratory Questionnaire Past 3 Months Version - These are questions about other effects that your respiratory problems may have on you these days: I feel that I am not in control of my respiratory problems.",
            "identifier": "C112654",
            "notation": "SGRQ01-Not in Control of Resp Problems",
            "pref_label": "SGRQ Past 3 Months Version - Not in Control of My Respiratory Problems",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C112448-C112654"
        },
        {
            "alt_label": "SGRQ01-Playing Sports",
            "definition": "St. George's Respiratory Questionnaire Past 3 Months Version - These are questions about what activities usually make you feel short of breath these days: Playing sports or other physical activities.",
            "identifier": "C112644",
            "notation": "SGRQ01-Playing Sports",
            "pref_label": "SGRQ Past 3 Months Version - Playing Sports or Other Physical Activities",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C112448-C112644"
        },
        {
            "alt_label": "SGRQ01-Respiratory Problems a Nuisance",
            "definition": "St. George's Respiratory Questionnaire Past 3 Months Version - These are questions about other effects that your respiratory problems may have on you these days: My respiratory problems are a nuisance to my family, friends or neighbors.",
            "identifier": "C112652",
            "notation": "SGRQ01-Respiratory Problems a Nuisance",
            "pref_label": "SGRQ Past 3 Months Version - Respiratory Problems a Nuisance to Family",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C112448-C112652"
        },
        {
            "alt_label": "SGRQ01-Short of Breath When Bend Over",
            "definition": "St. George's Respiratory Questionnaire Past 3 Months Version - These are more questions about your cough and shortness of breath these days: I am short of breath when I bend over.",
            "identifier": "C112648",
            "notation": "SGRQ01-Short of Breath When Bend Over",
            "pref_label": "SGRQ Past 3 Months Version - Short of Breath When Bend Over",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C112448-C112648"
        },
        {
            "alt_label": "SGRQ01-Short of Breath When I Talk",
            "definition": "St. George's Respiratory Questionnaire Past 3 Months Version - These are more questions about your cough and shortness of breath these days: I am short of breath when I talk.",
            "identifier": "C112647",
            "notation": "SGRQ01-Short of Breath When I Talk",
            "pref_label": "SGRQ Past 3 Months Version - Short of Breath When I Talk",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C112448-C112647"
        },
        {
            "alt_label": "SGRQ01-Sitting or Lying Still",
            "definition": "St. George's Respiratory Questionnaire Past 3 Months Version - These are questions about what activities usually make you feel short of breath these days: Sitting or lying still.",
            "identifier": "C112638",
            "notation": "SGRQ01-Sitting or Lying Still",
            "pref_label": "SGRQ Past 3 Months Version - Sitting or Lying Still",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C112448-C112638"
        },
        {
            "alt_label": "SGRQ01-Take a Long Time to Get Washed",
            "definition": "St. George's Respiratory Questionnaire Past 3 Months Version - These are questions about how your activities might be affected by your respiratory problems: I take a long time to get washed or dressed.",
            "identifier": "C112663",
            "notation": "SGRQ01-Take a Long Time to Get Washed",
            "pref_label": "SGRQ Past 3 Months Version - Take Long Time to Get Washed or Dressed",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C112448-C112663"
        },
        {
            "alt_label": "SGRQ01-Times Suffered Sev Resp Attacks",
            "definition": "St. George's Respiratory Questionnaire Past 3 Months Version - How many times during the past 3 months have you suffered from severe or very unpleasant respiratory attacks?",
            "identifier": "C112632",
            "notation": "SGRQ01-Times Suffered Sev Resp Attacks",
            "pref_label": "SGRQ Past 3 Months Version - Times Suffered From Severe Respiratory Attacks",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C112448-C112632"
        },
        {
            "alt_label": "SGRQ01-Treatment Does Not Help Me Much",
            "definition": "St. George's Respiratory Questionnaire Past 3 Months Version - These are questions about your respiratory treatment: My treatment does not help me very much.",
            "identifier": "C112659",
            "notation": "SGRQ01-Treatment Does Not Help Me Much",
            "pref_label": "SGRQ Past 3 Months Version - Treatment Does Not Help Me Much",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C112448-C112659"
        },
        {
            "alt_label": "SGRQ01-Treatment Interferes With Life",
            "definition": "St. George's Respiratory Questionnaire Past 3 Months Version - These are questions about your respiratory treatment: My treatment interferes with my life a lot.",
            "identifier": "C112662",
            "notation": "SGRQ01-Treatment Interferes With Life",
            "pref_label": "SGRQ Past 3 Months Version - Treatment Interferes With My Life",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C112448-C112662"
        },
        {
            "alt_label": "SGRQ01-Unpleasant Side Effect From Med",
            "definition": "St. George's Respiratory Questionnaire Past 3 Months Version - These are questions about your respiratory treatment: I have unpleasant side effects from my medication.",
            "identifier": "C112661",
            "notation": "SGRQ01-Unpleasant Side Effect From Med",
            "pref_label": "SGRQ Past 3 Months Version - Unpleasant Side Effects From Medication",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C112448-C112661"
        },
        {
            "alt_label": "SGRQ01-Walk Up Flight of Stairs Slowly",
            "definition": "St. George's Respiratory Questionnaire Past 3 Months Version - These are questions about how your activities might be affected by your respiratory problems: If I walk up one flight of stairs, I have to go slowly or stop.",
            "identifier": "C112667",
            "notation": "SGRQ01-Walk Up Flight of Stairs Slowly",
            "pref_label": "SGRQ Past 3 Months Version - If Walk Up One Flight of Stairs I Have to Go Slow",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C112448-C112667"
        },
        {
            "alt_label": "SGRQ01-Walking Around the House",
            "definition": "St. George's Respiratory Questionnaire Past 3 Months Version - These are questions about what activities usually make you feel short of breath these days: Walking around the house.",
            "identifier": "C112640",
            "notation": "SGRQ01-Walking Around the House",
            "pref_label": "SGRQ Past 3 Months Version - Walking Around the House",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C112448-C112640"
        },
        {
            "alt_label": "SGRQ01-Walking Outside on Level Ground",
            "definition": "St. George's Respiratory Questionnaire Past 3 Months Version - These are questions about what activities usually make you feel short of breath these days: Walking outside on level ground.",
            "identifier": "C112641",
            "notation": "SGRQ01-Walking Outside on Level Ground",
            "pref_label": "SGRQ Past 3 Months Version - Walking Outside on Level Ground",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C112448-C112641"
        },
        {
            "alt_label": "SGRQ01-Walking Up a Flight of Stairs",
            "definition": "St. George's Respiratory Questionnaire Past 3 Months Version - These are questions about what activities usually make you feel short of breath these days: Walking up a flight of stairs.",
            "identifier": "C112642",
            "notation": "SGRQ01-Walking Up a Flight of Stairs",
            "pref_label": "SGRQ Past 3 Months Version - Walking Up a Flight of Stairs",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C112448-C112642"
        },
        {
            "alt_label": "SGRQ01-Walking Up Hills",
            "definition": "St. George's Respiratory Questionnaire Past 3 Months Version - These are questions about what activities usually make you feel short of breath these days: Walking up hills.",
            "identifier": "C112643",
            "notation": "SGRQ01-Walking Up Hills",
            "pref_label": "SGRQ Past 3 Months Version - Walking Up Hills",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C112448-C112643"
        },
        {
            "alt_label": "SGRQ01-Washing or Dressing Yourself",
            "definition": "St. George's Respiratory Questionnaire Past 3 Months Version - These are questions about what activities usually make you feel short of breath these days: Washing or dressing yourself.",
            "identifier": "C112639",
            "notation": "SGRQ01-Washing or Dressing Yourself",
            "pref_label": "SGRQ Past 3 Months Version - Washing or Dressing Yourself",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C112448-C112639"
        },
        {
            "alt_label": "SGRQ01-Wheeze Worse in the Morning",
            "definition": "St. George's Respiratory Questionnaire Past 3 Months Version - If you wheeze, is it worse when you get up in the morning?",
            "identifier": "C112635",
            "notation": "SGRQ01-Wheeze Worse in the Morning",
            "pref_label": "SGRQ Past 3 Months Version - Wheeze Worse When Get Up in the Morning",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C112448-C112635"
        }
    ]
}