{
    "SKOS_CONCEPT": [
        {
            "alt_label": "Canadian Cardiovascular Society Classification 1",
            "definition": "Ordinary physical activity, such as walking or climbing stairs, does not cause angina. Angina occurs with strenuous, rapid, or prolonged exertion at work or recreation.",
            "identifier": "C77265",
            "notation": "CCS CLASS 1",
            "pref_label": "Canadian Cardiovascular Society Grading Scale Class I",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C101842-C77265"
        },
        {
            "alt_label": "Canadian Cardiovascular Society Classification 2",
            "definition": "Slight limitation of ordinary activity. Angina occurs on walking or climbing stairs rapidly, walking uphill, walking or climbing stairs after meals, or in cold, in wind, or under emotional stress, or only during the few hours after awakening. Angina occurs on walking more than 2 blocks on the level and climbing more than 1 flight of ordinary stairs at a normal pace and in normal conditions.",
            "identifier": "C77266",
            "notation": "CCS CLASS 2",
            "pref_label": "Canadian Cardiovascular Society Grading Scale Class II",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C101842-C77266"
        },
        {
            "alt_label": "Canadian Cardiovascular Society Classification 3",
            "definition": "Marked limitations of ordinary physical activity. Angina occurs on walking 1 to 2 blocks on the level and climbing 1 flight of stairs in normal conditions and at a normal pace.",
            "identifier": "C77267",
            "notation": "CCS CLASS 3",
            "pref_label": "Canadian Cardiovascular Society Grading Scale Class III",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C101842-C77267"
        },
        {
            "alt_label": "Canadian Cardiovascular Society Classification 4",
            "definition": "Inability to perform any physical activity without discomfort - anginal symptoms may be present at rest.",
            "identifier": "C77268",
            "notation": "CCS CLASS 4",
            "pref_label": "Canadian Cardiovascular Society Grading Scale Class IV",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C101842-C77268"
        }
    ]
}