{
    "SKOS_CONCEPT": [
        {
            "alt_label": "CSS08-Wish to be Dead",
            "definition": "Columbia-Suicide Severity Rating Scale Children's Since Last Visit - Have you thought about being dead or what it would be like to be dead? Have you wished you were dead or wished you could go to sleep and never wake up? Do you ever wish you weren't alive anymore?",
            "identifier": "C111428",
            "notation": "CSS0801",
            "pref_label": "C-SSRS Children's Since Last Visit - Wish to be Dead",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C111340-C111428"
        },
        {
            "alt_label": "CSS08-Wish to be Dead, Describe",
            "definition": "Columbia-Suicide Severity Rating Scale Children's Since Last Visit - Description of wishing to be dead.",
            "identifier": "C111429",
            "notation": "CSS0801A",
            "pref_label": "C-SSRS Children's Since Last Visit - Description of Wish to be Dead",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C111340-C111429"
        },
        {
            "alt_label": "CSS08-Non-Specific Suicidal Thought",
            "definition": "Columbia-Suicide Severity Rating Scale Children's Since Last Visit - Have you thought about doing something to make yourself not alive anymore? Have you had any thoughts about killing yourself?",
            "identifier": "C111430",
            "notation": "CSS0802",
            "pref_label": "C-SSRS Children's Since Last Visit - Non-Specific Active Suicidal Thoughts",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C111340-C111430"
        },
        {
            "alt_label": "CSS08-Non-Specific Suicid Thought, Descr",
            "definition": "Columbia-Suicide Severity Rating Scale Children's Since Last Visit - Description of non-specific active suicidal thoughts.",
            "identifier": "C111431",
            "notation": "CSS0802A",
            "pref_label": "C-SSRS Children's Since Last Visit - Description of Non-Specific Active Suicidal Thoughts",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C111340-C111431"
        },
        {
            "alt_label": "CSS08-Idea, No Intent, No Plan",
            "definition": "Columbia-Suicide Severity Rating Scale Children's Since Last Visit - Have you thought about how you would do that or how you would make yourself not alive anymore (kill yourself)? What did you think about?",
            "identifier": "C111432",
            "notation": "CSS0803",
            "pref_label": "C-SSRS Children's Since Last Visit - Active Suicidal Ideation with Any Methods (Not Plan) without Intent to Act",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C111340-C111432"
        },
        {
            "alt_label": "CSS08-Idea, No Intent, No Plan, Describe",
            "definition": "Columbia-Suicide Severity Rating Scale Children's Since Last Visit - Description of active suicidal ideation with any methods (not plan) without intent to act.",
            "identifier": "C111433",
            "notation": "CSS0803A",
            "pref_label": "C-SSRS Children's Since Last Visit - Description of Active Suicidal Ideation with Any Methods (Not Plan) without Intent to Act",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C111340-C111433"
        },
        {
            "alt_label": "CSS08-Ideation With Intent, No Plan",
            "definition": "Columbia-Suicide Severity Rating Scale Children's Since Last Visit - When you thought about making yourself not alive anymore (or killing yourself), did you think that this was something you might actually do? This is different from (as opposed to) having the thoughts but knowing you wouldn't do anything about it.",
            "identifier": "C111434",
            "notation": "CSS0804",
            "pref_label": "C-SSRS Children's Since Last Visit - Active Suicidal Ideation with Some Intent to Act, without Specific Plan",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C111340-C111434"
        },
        {
            "alt_label": "CSS08-Ideation With Intent No Plan Descr",
            "definition": "Columbia-Suicide Severity Rating Scale Children's Since Last Visit - Description of active suicidal ideation with some intent to act, without specific plan.",
            "identifier": "C111435",
            "notation": "CSS0804A",
            "pref_label": "C-SSRS Children's Since Last Visit - Description of Active Suicidal Ideation with Some Intent to Act, without Specific Plan",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C111340-C111435"
        },
        {
            "alt_label": "CSS08-Ideation With Plan/Intent",
            "definition": "Columbia-Suicide Severity Rating Scale Children's Since Last Visit - Have you decided how or when you would make yourself not alive anymore/kill yourself? Have you planned out (worked out the details of) how you would do it? What was your plan? When you made this plan (or worked out these details), was any part of you thinking about actually doing it?",
            "identifier": "C111436",
            "notation": "CSS0805",
            "pref_label": "C-SSRS Children's Since Last Visit - Active Suicidal Ideation with Specific Plan and Intent",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C111340-C111436"
        },
        {
            "alt_label": "CSS08-Ideation With Plan/Intent, Descr",
            "definition": "Columbia-Suicide Severity Rating Scale Children's Since Last Visit - Description of active suicidal ideation with specific plan and intent.",
            "identifier": "C111437",
            "notation": "CSS0805A",
            "pref_label": "C-SSRS Children's Since Last Visit - Description of Active Suicidal Ideation with Specific Plan and Intent",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C111340-C111437"
        },
        {
            "alt_label": "CSS08-Most Severe Ideation",
            "definition": "Columbia-Suicide Severity Rating Scale Children's Since Last Visit - Most severe ideation.",
            "identifier": "C111438",
            "notation": "CSS0806",
            "pref_label": "C-SSRS Children's Since Last Visit - Most Severe Ideation",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C111340-C111438"
        },
        {
            "alt_label": "CSS08-Most Severe Ideation, Description",
            "definition": "Columbia-Suicide Severity Rating Scale Children's Since Last Visit - Description of most severe ideation.",
            "identifier": "C111439",
            "notation": "CSS0806A",
            "pref_label": "C-SSRS Children's Since Last Visit - Describe Most Severe Ideation",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C111340-C111439"
        },
        {
            "alt_label": "CSS08-Most Severe Ideation, Frequency",
            "definition": "Columbia-Suicide Severity Rating Scale Children's Since Last Visit - How many times have you had these thoughts?",
            "identifier": "C111440",
            "notation": "CSS0807",
            "pref_label": "C-SSRS Children's Since Last Visit - Frequency of Most Severe Ideation",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C111340-C111440"
        },
        {
            "alt_label": "CSS08-Frequency, Write Response",
            "definition": "Columbia-Suicide Severity Rating Scale Children's Since Last Visit - Frequency, write response.",
            "identifier": "C111441",
            "notation": "CSS0807A",
            "pref_label": "C-SSRS Children's Since Last Visit - Frequency, Write Response",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C111340-C111441"
        },
        {
            "alt_label": "CSS08-Actual Attempt",
            "definition": "Columbia-Suicide Severity Rating Scale Children's Since Last Visit - Did you do anything to try to kill yourself or make yourself not alive anymore? What did you do? Did you hurt yourself on purpose? Why did you do that?",
            "identifier": "C111442",
            "notation": "CSS0808",
            "pref_label": "C-SSRS Children's Since Last Visit - Actual Suicide Attempt",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C111340-C111442"
        },
        {
            "alt_label": "CSS08-Number of Actual Attempts",
            "definition": "Columbia-Suicide Severity Rating Scale Children's Since Last Visit - Total number of actual attempts.",
            "identifier": "C111443",
            "notation": "CSS0809",
            "pref_label": "C-SSRS Children's Since Last Visit - Number of Actual Suicide Attempts",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C111340-C111443"
        },
        {
            "alt_label": "CSS08-Actual Attempt, Describe",
            "definition": "Columbia-Suicide Severity Rating Scale Children's Since Last Visit - Description of actual attempt.",
            "identifier": "C111444",
            "notation": "CSS0809A",
            "pref_label": "C-SSRS Children's Since Last Visit - Description of Actual Suicide Attempt",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C111340-C111444"
        },
        {
            "alt_label": "CSS08-Non-suicidal Self-injurious Behav",
            "definition": "Columbia-Suicide Severity Rating Scale Children's Since Last Visit - Has subject engaged in non-suicidal self-injurious behavior?",
            "identifier": "C111445",
            "notation": "CSS0810",
            "pref_label": "C-SSRS Children's Since Last Visit - Non-suicidal Self-injurious Behavior",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C111340-C111445"
        },
        {
            "alt_label": "CSS08-Self-injur Behav, Intent Unknown",
            "definition": "Columbia-Suicide Severity Rating Scale Children's Since Last Visit - Has subject engaged in self-injurious behavior, intent unknown?",
            "identifier": "C111446",
            "notation": "CSS0811",
            "pref_label": "C-SSRS Children's Since Last Visit - Self-injurious Behavior, Intent Unknown",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C111340-C111446"
        },
        {
            "alt_label": "CSS08-Interrupted Attempt",
            "definition": "Columbia-Suicide Severity Rating Scale Children's Since Last Visit - Has there been a time when you started to do something to make yourself not alive anymore (end your life or kill yourself) but someone or something stopped you before you actually did anything? What did you do?",
            "identifier": "C111447",
            "notation": "CSS0812",
            "pref_label": "C-SSRS Children's Since Last Visit - Interrupted Suicide Attempt",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C111340-C111447"
        },
        {
            "alt_label": "CSS08-Number of Interrupt Attempts",
            "definition": "Columbia-Suicide Severity Rating Scale Children's Since Last Visit - Total number of interrupted attempts.",
            "identifier": "C111448",
            "notation": "CSS0813",
            "pref_label": "C-SSRS Children's Since Last Visit - Number of Interrupted Suicide Attempts",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C111340-C111448"
        },
        {
            "alt_label": "CSS08-Interrupted Attempt, Describe",
            "definition": "Columbia-Suicide Severity Rating Scale Children's Since Last Visit - Description of interrupted attempt.",
            "identifier": "C111449",
            "notation": "CSS0813A",
            "pref_label": "C-SSRS Children's Since Last Visit - Description of Interrupted Suicide Attempt",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C111340-C111449"
        },
        {
            "alt_label": "CSS08-Aborted/Self-Interrupted Attempt",
            "definition": "Columbia-Suicide Severity Rating Scale Children's Since Last Visit - Has there been a time when you started to do something to make yourself not alive anymore (end your life or kill yourself) but you changed your mind (stopped yourself) before you actually did anything? What did you do?",
            "identifier": "C111450",
            "notation": "CSS0814",
            "pref_label": "C-SSRS Children's Since Last Visit - Aborted or Self-interrupted Suicide Attempt",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C111340-C111450"
        },
        {
            "alt_label": "CSS08-Number of Aborted Attempts",
            "definition": "Columbia-Suicide Severity Rating Scale Children's Since Last Visit - Total number of aborted or self-interrupted attempts.",
            "identifier": "C111451",
            "notation": "CSS0815",
            "pref_label": "C-SSRS Children's Since Last Visit - Number of Aborted or Self-interrupted Suicide Attempts",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C111340-C111451"
        },
        {
            "alt_label": "CSS08-Aborted Attempt, Describe",
            "definition": "Columbia-Suicide Severity Rating Scale Children's Since Last Visit - Description of aborted attempt or self-interrupted attempt.",
            "identifier": "C111452",
            "notation": "CSS0815A",
            "pref_label": "C-SSRS Children's Since Last Visit - Description of Aborted or Self-interrupted Suicide Attempt",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C111340-C111452"
        },
        {
            "alt_label": "CSS08-Preparatory Acts/Behavior",
            "definition": "Columbia-Suicide Severity Rating Scale Children's Since Last Visit - Have you done anything to get ready to make yourself not alive anymore (to end your life or kill yourself) - like giving things away, writing a goodbye note, getting things you need to kill yourself?",
            "identifier": "C111453",
            "notation": "CSS0816",
            "pref_label": "C-SSRS Children's Since Last Visit - Preparatory Acts or Behaviors Toward Suicide Attempt",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C111340-C111453"
        },
        {
            "alt_label": "CSS08-Preparatory Acts/Behavior, Descr",
            "definition": "Columbia-Suicide Severity Rating Scale Children's Since Last Visit - Description of preparatory acts or behavior.",
            "identifier": "C111454",
            "notation": "CSS0816A",
            "pref_label": "C-SSRS Children's Since Last Visit - Description of Preparatory Acts or Behaviors Toward Suicide Attempt",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C111340-C111454"
        },
        {
            "alt_label": "CSS08-Suicidal Behavior",
            "definition": "Columbia-Suicide Severity Rating Scale Children's Since Last Visit - Suicidal behavior was present during the assessment period?",
            "identifier": "C111455",
            "notation": "CSS0817",
            "pref_label": "C-SSRS Children's Since Last Visit - Suicidal Behavior",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C111340-C111455"
        },
        {
            "alt_label": "CSS08-Suicide",
            "definition": "Columbia-Suicide Severity Rating Scale Children's Since Last Visit - Suicide.",
            "identifier": "C111456",
            "notation": "CSS0818",
            "pref_label": "C-SSRS Children's Since Last Visit - Suicide",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C111340-C111456"
        },
        {
            "alt_label": "CSS08-Most Lethal Attempt Date",
            "definition": "Columbia-Suicide Severity Rating Scale Children's Since Last Visit - Most lethal attempt date.",
            "identifier": "C111457",
            "notation": "CSS0819A",
            "pref_label": "C-SSRS Children's Since Last Visit - Most Lethal Suicide Attempt Date",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C111340-C111457"
        },
        {
            "alt_label": "CSS08-Most Lethal Attempt Damage",
            "definition": "Columbia-Suicide Severity Rating Scale Children's Since Last Visit - Most lethal attempt actual lethality/medical damage.",
            "identifier": "C111458",
            "notation": "CSS0819B",
            "pref_label": "C-SSRS Children's Since Last Visit - Most Lethal Suicide Attempt Actual Lethality/Medical Damage",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C111340-C111458"
        },
        {
            "alt_label": "CSS08-Most Lethal Attempt Potential",
            "definition": "Columbia-Suicide Severity Rating Scale Children's Since Last Visit - Most lethal attempt potential lethality.",
            "identifier": "C111459",
            "notation": "CSS0819C",
            "pref_label": "C-SSRS Children's Since Last Visit - Most Lethal Suicide Attempt Potential Lethality",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C111340-C111459"
        }
    ]
}