{
    "SKOS_CONCEPT": [
        {
            "alt_label": "PQL11-Back Feels Stiff",
            "definition": "Pediatric Quality of Life Neuromuscular Module Acute Version 3 Young Adult Parent Report - In the past 7 days, how much of a problem has this been for your child: My child's back feels stiff.",
            "identifier": "C138570",
            "notation": "PQL11-Back Feels Stiff",
            "pref_label": "PedsQL Neuromuscular Module Acute Version 3.0 Parent Report for Young Adults - Back Feels Stiff",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C138234-C138570"
        },
        {
            "alt_label": "PQL11-Do Not Have Equipment Need",
            "definition": "Pediatric Quality of Life Neuromuscular Module Acute Version 3 Young Adult Parent Report - In the past 7 days, how much of a problem has this been for your child: My child does not have the equipment he or she needs.",
            "identifier": "C138589",
            "notation": "PQL11-Do Not Have Equipment Need",
            "pref_label": "PedsQL Neuromuscular Module Acute Version 3.0 Parent Report for Young Adults - Do Not Have Equipment Need",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C138234-C138589"
        },
        {
            "alt_label": "PQL11-Family Has Lot of Problems",
            "definition": "Pediatric Quality of Life Neuromuscular Module Acute Version 3 Young Adult Parent Report - In the past 7 days, how much of a problem has this been for your child: I think our family has a lot of problems.",
            "identifier": "C138588",
            "notation": "PQL11-Family Has Lot of Problems",
            "pref_label": "PedsQL Neuromuscular Module Acute Version 3.0 Parent Report for Young Adults - Family Has Lot of Problems",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C138234-C138588"
        },
        {
            "alt_label": "PQL11-Feel Tired",
            "definition": "Pediatric Quality of Life Neuromuscular Module Acute Version 3 Young Adult Parent Report - In the past 7 days, how much of a problem has this been for your child: My child feels tired.",
            "identifier": "C138569",
            "notation": "PQL11-Feel Tired",
            "pref_label": "PedsQL Neuromuscular Module Acute Version 3.0 Parent Report for Young Adults - Feel Tired",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C138234-C138569"
        },
        {
            "alt_label": "PQL11-Get Hurt Accidentally",
            "definition": "Pediatric Quality of Life Neuromuscular Module Acute Version 3 Young Adult Parent Report - In the past 7 days, how much of a problem has this been for your child: My child gets hurt accidentally.",
            "identifier": "C138578",
            "notation": "PQL11-Get Hurt Accidentally",
            "pref_label": "PedsQL Neuromuscular Module Acute Version 3.0 Parent Report for Young Adults - Get Hurt Accidentally",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C138234-C138578"
        },
        {
            "alt_label": "PQL11-Get Sick Easily",
            "definition": "Pediatric Quality of Life Neuromuscular Module Acute Version 3 Young Adult Parent Report - In the past 7 days, how much of a problem has this been for your child: My child gets sick easily.",
            "identifier": "C138566",
            "notation": "PQL11-Get Sick Easily",
            "pref_label": "PedsQL Neuromuscular Module Acute Version 3.0 Parent Report for Young Adults - Get Sick Easily",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C138234-C138566"
        },
        {
            "alt_label": "PQL11-Get Sores and/or Rashes",
            "definition": "Pediatric Quality of Life Neuromuscular Module Acute Version 3 Young Adult Parent Report - In the past 7 days, how much of a problem has this been for your child: My child gets sores and/or rashes.",
            "identifier": "C138567",
            "notation": "PQL11-Get Sores and/or Rashes",
            "pref_label": "PedsQL Neuromuscular Module Acute Version 3.0 Parent Report for Young Adults - Get Sores and/or Rashes",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C138234-C138567"
        },
        {
            "alt_label": "PQL11-Hands Are Weak",
            "definition": "Pediatric Quality of Life Neuromuscular Module Acute Version 3 Young Adult Parent Report - In the past 7 days, how much of a problem has this been for your child: My child's hands are weak.",
            "identifier": "C138572",
            "notation": "PQL11-Hands Are Weak",
            "pref_label": "PedsQL Neuromuscular Module Acute Version 3.0 Parent Report for Young Adults - Hands Are Weak",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C138234-C138572"
        },
        {
            "alt_label": "PQL11-Hard Ask Doctors/Nurses Questions",
            "definition": "Pediatric Quality of Life Neuromuscular Module Acute Version 3 Young Adult Parent Report - In the past 7 days, how much of a problem has this been for your child: It is hard for my child to ask the doctors and nurses questions.",
            "identifier": "C138583",
            "notation": "PQL11-Hard Ask Doctors/Nurses Questions",
            "pref_label": "PedsQL Neuromuscular Module Acute Version 3.0 Parent Report for Young Adults - Hard Ask Doctors and Nurses Questions",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C138234-C138583"
        },
        {
            "alt_label": "PQL11-Hard Explain Illness to People",
            "definition": "Pediatric Quality of Life Neuromuscular Module Acute Version 3 Young Adult Parent Report - In the past 7 days, how much of a problem has this been for your child: It is hard for my child to explain his or her illness to other people.",
            "identifier": "C138584",
            "notation": "PQL11-Hard Explain Illness to People",
            "pref_label": "PedsQL Neuromuscular Module Acute Version 3.0 Parent Report for Young Adults - Hard Explain Illness to People",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C138234-C138584"
        },
        {
            "alt_label": "PQL11-Hard for Family to Plan Activities",
            "definition": "Pediatric Quality of Life Neuromuscular Module Acute Version 3 Young Adult Parent Report - In the past 7 days, how much of a problem has this been for your child: It is hard for our family to plan activities like vacations.",
            "identifier": "C138585",
            "notation": "PQL11-Hard for Family to Plan Activities",
            "pref_label": "PedsQL Neuromuscular Module Acute Version 3.0 Parent Report for Young Adults - Hard for Family to Plan Activities",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C138234-C138585"
        },
        {
            "alt_label": "PQL11-Hard for Family to Rest",
            "definition": "Pediatric Quality of Life Neuromuscular Module Acute Version 3 Young Adult Parent Report - In the past 7 days, how much of a problem has this been for your child: It is hard for our family to get enough rest.",
            "identifier": "C138586",
            "notation": "PQL11-Hard for Family to Rest",
            "pref_label": "PedsQL Neuromuscular Module Acute Version 3.0 Parent Report for Young Adults - Hard for Family to Rest",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C138234-C138586"
        },
        {
            "alt_label": "PQL11-Hard Tell Doctors/Nurses How Feel",
            "definition": "Pediatric Quality of Life Neuromuscular Module Acute Version 3 Young Adult Parent Report - In the past 7 days, how much of a problem has this been for your child: It is hard for my child to tell the doctors and nurses how he or she feels.",
            "identifier": "C138582",
            "notation": "PQL11-Hard Tell Doctors/Nurses How Feel",
            "pref_label": "PedsQL Neuromuscular Module Acute Version 3.0 Parent Report for Young Adults - Hard Tell Doctors and Nurses How Feel",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C138234-C138582"
        },
        {
            "alt_label": "PQL11-Hard to Breathe",
            "definition": "Pediatric Quality of Life Neuromuscular Module Acute Version 3 Young Adult Parent Report - In the past 7 days, how much of a problem has this been for your child: It is hard for my child to breathe.",
            "identifier": "C138565",
            "notation": "PQL11-Hard to Breathe",
            "pref_label": "PedsQL Neuromuscular Module Acute Version 3.0 Parent Report for Young Adults - Hard to Breathe",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C138234-C138565"
        },
        {
            "alt_label": "PQL11-Hard to Gain/Lose Weight",
            "definition": "Pediatric Quality of Life Neuromuscular Module Acute Version 3 Young Adult Parent Report - In the past 7 days, how much of a problem has this been for your child: It is hard for my child to gain or lose weight when he or she wants to.",
            "identifier": "C138574",
            "notation": "PQL11-Hard to Gain/Lose Weight",
            "pref_label": "PedsQL Neuromuscular Module Acute Version 3.0 Parent Report for Young Adults - Hard to Gain or Lose Weight",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C138234-C138574"
        },
        {
            "alt_label": "PQL11-Hard to Go Places With Equipment",
            "definition": "Pediatric Quality of Life Neuromuscular Module Acute Version 3 Young Adult Parent Report - In the past 7 days, how much of a problem has this been for your child: It is hard for my child to go places with his or her equipment.",
            "identifier": "C138581",
            "notation": "PQL11-Hard to Go Places With Equipment",
            "pref_label": "PedsQL Neuromuscular Module Acute Version 3.0 Parent Report for Young Adults - Hard to Go Places With Equipment",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C138234-C138581"
        },
        {
            "alt_label": "PQL11-Hard to Swallow Food",
            "definition": "Pediatric Quality of Life Neuromuscular Module Acute Version 3 Young Adult Parent Report - In the past 7 days, how much of a problem has this been for your child: It is hard for my child to swallow food.",
            "identifier": "C138576",
            "notation": "PQL11-Hard to Swallow Food",
            "pref_label": "PedsQL Neuromuscular Module Acute Version 3.0 Parent Report for Young Adults - Hard to Swallow Food",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C138234-C138576"
        },
        {
            "alt_label": "PQL11-Hard to Turn During Night",
            "definition": "Pediatric Quality of Life Neuromuscular Module Acute Version 3 Young Adult Parent Report - In the past 7 days, how much of a problem has this been for your child: It is hard for my child to turn him or herself during the night.",
            "identifier": "C138580",
            "notation": "PQL11-Hard to Turn During Night",
            "pref_label": "PedsQL Neuromuscular Module Acute Version 3.0 Parent Report for Young Adults - Hard to Turn During Night",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C138234-C138580"
        },
        {
            "alt_label": "PQL11-Hard to Use Bathroom",
            "definition": "Pediatric Quality of Life Neuromuscular Module Acute Version 3 Young Adult Parent Report - In the past 7 days, how much of a problem has this been for your child: It is hard for my child to use the bathroom.",
            "identifier": "C138573",
            "notation": "PQL11-Hard to Use Bathroom",
            "pref_label": "PedsQL Neuromuscular Module Acute Version 3.0 Parent Report for Young Adults - Hard to Use Bathroom",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C138234-C138573"
        },
        {
            "alt_label": "PQL11-Hard to Use Hands",
            "definition": "Pediatric Quality of Life Neuromuscular Module Acute Version 3 Young Adult Parent Report - In the past 7 days, how much of a problem has this been for your child: It is hard for my child to use his or her hands.",
            "identifier": "C138575",
            "notation": "PQL11-Hard to Use Hands",
            "pref_label": "PedsQL Neuromuscular Module Acute Version 3.0 Parent Report for Young Adults - Hard to Use Hands",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C138234-C138575"
        },
        {
            "alt_label": "PQL11-Legs Hurt",
            "definition": "Pediatric Quality of Life Neuromuscular Module Acute Version 3 Young Adult Parent Report - In the past 7 days, how much of a problem has this been for your child: My child's legs hurt.",
            "identifier": "C138568",
            "notation": "PQL11-Legs Hurt",
            "pref_label": "PedsQL Neuromuscular Module Acute Version 3.0 Parent Report for Young Adults - Legs Hurt",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C138234-C138568"
        },
        {
            "alt_label": "PQL11-Long Time to Bathe/Shower",
            "definition": "Pediatric Quality of Life Neuromuscular Module Acute Version 3 Young Adult Parent Report - In the past 7 days, how much of a problem has this been for your child: It takes my child a long time to bathe or shower.",
            "identifier": "C138577",
            "notation": "PQL11-Long Time to Bathe/Shower",
            "pref_label": "PedsQL Neuromuscular Module Acute Version 3.0 Parent Report for Young Adults - Long Time to Bathe or Shower",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C138234-C138577"
        },
        {
            "alt_label": "PQL11-Money Problem in Our Family",
            "definition": "Pediatric Quality of Life Neuromuscular Module Acute Version 3 Young Adult Parent Report - In the past 7 days, how much of a problem has this been for your child: I think money is a problem in our family.",
            "identifier": "C138587",
            "notation": "PQL11-Money Problem in Our Family",
            "pref_label": "PedsQL Neuromuscular Module Acute Version 3.0 Parent Report for Young Adults - Money Problem in Our Family",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C138234-C138587"
        },
        {
            "alt_label": "PQL11-Take Long Time to Eat",
            "definition": "Pediatric Quality of Life Neuromuscular Module Acute Version 3 Young Adult Parent Report - In the past 7 days, how much of a problem has this been for your child: My child takes a long time to eat.",
            "identifier": "C138579",
            "notation": "PQL11-Take Long Time to Eat",
            "pref_label": "PedsQL Neuromuscular Module Acute Version 3.0 Parent Report for Young Adults - Take Long Time to Eat",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C138234-C138579"
        },
        {
            "alt_label": "PQL11-Wake Up Tired",
            "definition": "Pediatric Quality of Life Neuromuscular Module Acute Version 3 Young Adult Parent Report - In the past 7 days, how much of a problem has this been for your child: My child wakes up tired.",
            "identifier": "C138571",
            "notation": "PQL11-Wake Up Tired",
            "pref_label": "PedsQL Neuromuscular Module Acute Version 3.0 Parent Report for Young Adults - Wake Up Tired",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C138234-C138571"
        }
    ]
}