{
    "SKOS_CONCEPT": [
        {
            "alt_label": "KPSS0101-Able to carry on normal activity;minor signs or symptoms of disease",
            "definition": "Karnofsky Performance Status Scale original result for KPSS0101-Able to carry on normal activity; minor signs or symptoms of disease.",
            "identifier": "C182717",
            "notation": "Able to carry on normal activity; minor signs or symptoms of disease.",
            "pref_label": "Karnofsky Performance Status Scale KPSS0101 Original Result - Able to carry on normal activity; minor signs or symptoms of disease",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C182469-C182717"
        },
        {
            "alt_label": "KPSS0101-Cares for self;unable to carry on normal activity or to do active work",
            "definition": "Karnofsky Performance Status Scale original result for KPSS0101-Cares for self; unable to carry on normal activity or to do active work.",
            "identifier": "C182719",
            "notation": "Cares for self; unable to carry on normal activity or to do active work.",
            "pref_label": "Karnofsky Performance Status Scale KPSS0101 Original Result - Cares for self; unable to carry on normal activity or to do active work",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C182469-C182719"
        },
        {
            "alt_label": "KPSS0101-Dead",
            "definition": "Karnofsky Performance Status Scale original result for KPSS0101-Dead.",
            "identifier": "C182726",
            "notation": "Dead",
            "pref_label": "Karnofsky Performance Status Scale KPSS0101 Original Result - Dead",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C182469-C182726"
        },
        {
            "alt_label": "KPSS0101-Disabled;requires special care and assistance",
            "definition": "Karnofsky Performance Status Scale original result for KPSS0101-Disabled; requires special care and assistance.",
            "identifier": "C182722",
            "notation": "Disabled; requires special care and assistance.",
            "pref_label": "Karnofsky Performance Status Scale KPSS0101 Original Result - Disabled; requires special care and assistance",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C182469-C182722"
        },
        {
            "alt_label": "KPSS0101-Moribund;fatal processes progressing rapidly",
            "definition": "Karnofsky Performance Status Scale original result for KPSS0101-Moribund; fatal processes progressing rapidly.",
            "identifier": "C182725",
            "notation": "Moribund; fatal processes progressing rapidly.",
            "pref_label": "Karnofsky Performance Status Scale KPSS0101 Original Result - Moribund; fatal processes progressing rapidly",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C182469-C182725"
        },
        {
            "alt_label": "KPSS0101-Normal activity with effort;some signs or symptoms of disease",
            "definition": "Karnofsky Performance Status Scale original result for KPSS0101-Normal activity with effort; some signs or symptoms of disease.",
            "identifier": "C182718",
            "notation": "Normal activity with effort; some signs or symptoms of disease.",
            "pref_label": "Karnofsky Performance Status Scale KPSS0101 Original Result - Normal activity with effort; some signs or symptoms of disease",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C182469-C182718"
        },
        {
            "alt_label": "KPSS0101-Normal no complaints;no evidence of disease",
            "definition": "Karnofsky Performance Status Scale original result for KPSS0101-Normal no complaints; no evidence of disease.",
            "identifier": "C182716",
            "notation": "Normal no complaints; no evidence of disease.",
            "pref_label": "Karnofsky Performance Status Scale KPSS0101 Original Result - Normal no complaints; no evidence of disease",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C182469-C182716"
        },
        {
            "alt_label": "KPSS0101-Requires considerable assistance and frequent medical care",
            "definition": "Karnofsky Performance Status Scale original result for KPSS0101-Requires considerable assistance and frequent medical care.",
            "identifier": "C182721",
            "notation": "Requires considerable assistance and frequent medical care.",
            "pref_label": "Karnofsky Performance Status Scale KPSS0101 Original Result - Requires considerable assistance and frequent medical care",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C182469-C182721"
        },
        {
            "alt_label": "KPSS0101-Requires occasional assistance, but is able to care for most of his personal needs",
            "definition": "Karnofsky Performance Status Scale original result for KPSS0101-Requires occasional assistance, but is able to care for most of his personal needs.",
            "identifier": "C182720",
            "notation": "Requires occasional assistance, but is able to care for most of his personal needs.",
            "pref_label": "Karnofsky Performance Status Scale KPSS0101 Original Result - Requires occasional assistance, but is able to care for most of his personal needs",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C182469-C182720"
        },
        {
            "alt_label": "KPSS0101-Severely disabled;hospital admission is indicated although death not imminent",
            "definition": "Karnofsky Performance Status Scale original result for KPSS0101-Severely disabled; hospital admission is indicated although death not imminent.",
            "identifier": "C182723",
            "notation": "Severely disabled; hospital admission is indicated although death not imminent.",
            "pref_label": "Karnofsky Performance Status Scale KPSS0101 Original Result - Severely disabled; hospital admission is indicated although death not imminent",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C182469-C182723"
        },
        {
            "alt_label": "KPSS0101-Very sick;hospital admission necessary;active supportive treatment necessary",
            "definition": "Karnofsky Performance Status Scale original result for KPSS0101-Very sick; hospital admission necessary; active supportive treatment necessary.",
            "identifier": "C182724",
            "notation": "Very sick; hospital admission necessary; active supportive treatment necessary.",
            "pref_label": "Karnofsky Performance Status Scale KPSS0101 Original Result - Very sick; hospital admission necessary; active supportive treatment necessary",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C182469-C182724"
        }
    ]
}