{
    "SKOS_CONCEPT": [
        {
            "alt_label": "CHSF2-Paid Personal Care per Day",
            "definition": "Craig Handicap Assessment and Reporting Technique-Short Form Paper Version - How many hours in a typical 24-hour day do you have someone with you to provide physical assistance for personal care activities such as eating, bathing, dressing, toileting and mobility? (hours paid assistance).",
            "identifier": "C119142",
            "notation": "CHSF201A",
            "pref_label": "CHART-SF Paper Version - Paid Personal Care per Day",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C119068-C119142"
        },
        {
            "alt_label": "CHSF2-Unpaid Personal Care per Day",
            "definition": "Craig Handicap Assessment and Reporting Technique-Short Form Paper Version - How many hours in a typical 24-hour day do you have someone with you to provide physical assistance for personal care activities such as eating, bathing, dressing, toileting and mobility? hours unpaid (family, others).",
            "identifier": "C119143",
            "notation": "CHSF201B",
            "pref_label": "CHART-SF Paper Version - Unpaid Personal Care per Day",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C119068-C119143"
        },
        {
            "alt_label": "CHSF2-Home Cognitive Assistance per Day",
            "definition": "Craig Handicap Assessment and Reporting Technique-Short Form Paper Version - How much time is someone with you in your home to assist you with activities that require remembering, decision making, or judgment?",
            "identifier": "C119144",
            "notation": "CHSF202",
            "pref_label": "CHART-SF Paper Version - Cognitive Assistance at Home per Day",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C119068-C119144"
        },
        {
            "alt_label": "CHSF2-Away Cognitive Assistance per Day",
            "definition": "Craig Handicap Assessment and Reporting Technique-Short Form Paper Version - How much of the time is someone with you to help you with remembering, decision making, or judgment when you go away from your home?",
            "identifier": "C119145",
            "notation": "CHSF203",
            "pref_label": "CHART-SF Paper Version - Cognitive Assistance Away From Home per Day",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C119068-C119145"
        },
        {
            "alt_label": "CHSF2-Hours Out of Bed per Day",
            "definition": "Craig Handicap Assessment and Reporting Technique-Short Form Paper Version - On a typical day, how many hours are you out of bed?",
            "identifier": "C119146",
            "notation": "CHSF204",
            "pref_label": "CHART-SF Paper Version - Hours Out of Bed per Day",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C119068-C119146"
        },
        {
            "alt_label": "CHSF2-Days Out of the House per Week",
            "definition": "Craig Handicap Assessment and Reporting Technique-Short Form Paper Version - In a typical week, how many days do you get out of your house and go somewhere?",
            "identifier": "C119147",
            "notation": "CHSF205",
            "pref_label": "CHART-SF Paper Version - Days Out of the House per Week",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C119068-C119147"
        },
        {
            "alt_label": "CHSF2-Nights Away From Home Last Year",
            "definition": "Craig Handicap Assessment and Reporting Technique-Short Form Paper Version - In the last year, how many nights have you spent away from your home?",
            "identifier": "C119148",
            "notation": "CHSF206",
            "pref_label": "CHART-SF Paper Version - Nights Away From Home Last Year",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C119068-C119148"
        },
        {
            "alt_label": "CHSF2-Hours of Paid Work per Week",
            "definition": "Craig Handicap Assessment and Reporting Technique-Short Form Paper Version - How many hours per week do you spend working in a job for which you get paid?",
            "identifier": "C119149",
            "notation": "CHSF207A",
            "pref_label": "CHART-SF Paper Version - Hours of Paid Work per Week",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C119068-C119149"
        },
        {
            "alt_label": "CHSF2-Occupation of Paid Work",
            "definition": "Craig Handicap Assessment and Reporting Technique-Short Form Paper Version - How many hours per week do you spend working in a job for which you get paid? (occupation).",
            "identifier": "C119150",
            "notation": "CHSF207B",
            "pref_label": "CHART-SF Paper Version - Occupation of Paid Work",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C119068-C119150"
        },
        {
            "alt_label": "CHSF2-Hours of Schoolwork per Week",
            "definition": "Craig Handicap Assessment and Reporting Technique-Short Form Paper Version - How many hours per week do you spend in school working toward a degree or in an accredited technical training program?",
            "identifier": "C119151",
            "notation": "CHSF208",
            "pref_label": "CHART-SF Paper Version - Hours of Schoolwork per Week",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C119068-C119151"
        },
        {
            "alt_label": "CHSF2-Hours of Homemaking per Week",
            "definition": "Craig Handicap Assessment and Reporting Technique-Short Form Paper Version - How many hours per week do you spend in active homemaking including parenting, housekeeping, and food preparation?",
            "identifier": "C119152",
            "notation": "CHSF209",
            "pref_label": "CHART-SF Paper Version - Hours of Homemaking per Week",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C119068-C119152"
        },
        {
            "alt_label": "CHSF2-Hours of Home Maintenance per Week",
            "definition": "Craig Handicap Assessment and Reporting Technique-Short Form Paper Version - How many hours per week do you spend in home maintenance activities such as gardening, house repairs or home improvement?",
            "identifier": "C119153",
            "notation": "CHSF210",
            "pref_label": "CHART-SF Paper Version - Hours of Home Maintenance per Week",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C119068-C119153"
        },
        {
            "alt_label": "CHSF2-Hours of Recreation per Week",
            "definition": "Craig Handicap Assessment and Reporting Technique-Short Form Paper Version - How many hours per week do you spend in recreational activities such as sports, exercise, playing cards, or going to movies?",
            "identifier": "C119154",
            "notation": "CHSF211",
            "pref_label": "CHART-SF Paper Version - Hours of Recreational Activities per Week",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C119068-C119154"
        },
        {
            "alt_label": "CHSF2-Number of People You Live With",
            "definition": "Craig Handicap Assessment and Reporting Technique-Short Form Paper Version - How many people do you live with?",
            "identifier": "C119155",
            "notation": "CHSF212",
            "pref_label": "CHART-SF Paper Version - Number of People You Live With",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C119068-C119155"
        },
        {
            "alt_label": "CHSF2-Live With Spouse or Signif Other",
            "definition": "Craig Handicap Assessment and Reporting Technique-Short Form Paper Version - Is one of them your spouse or significant other?",
            "identifier": "C119156",
            "notation": "CHSF213",
            "pref_label": "CHART-SF Paper Version - Live With Spouse or Significant Other",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C119068-C119156"
        },
        {
            "alt_label": "CHSF2-Number of Relatives You Live With",
            "definition": "Craig Handicap Assessment and Reporting Technique-Short Form Paper Version - Of the people you live with how many are relatives?",
            "identifier": "C119157",
            "notation": "CHSF214",
            "pref_label": "CHART-SF Paper Version - Number of Relatives You Live With",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C119068-C119157"
        },
        {
            "alt_label": "CHSF2-Associates Contacted per Month",
            "definition": "Craig Handicap Assessment and Reporting Technique-Short Form Paper Version - How many business or organizational associates do you visit, phone, or write to at least once a month?",
            "identifier": "C119158",
            "notation": "CHSF215",
            "pref_label": "CHART-SF Paper Version - Associates Contacted per Month",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C119068-C119158"
        },
        {
            "alt_label": "CHSF2-Friends Contacted per Month",
            "definition": "Craig Handicap Assessment and Reporting Technique-Short Form Paper Version - How many friends do you visit, phone, or write to at least once a month?",
            "identifier": "C119159",
            "notation": "CHSF216",
            "pref_label": "CHART-SF Paper Version - Friends Contacted per Month",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C119068-C119159"
        },
        {
            "alt_label": "CHSF2-Strangers Spoke with Last Month",
            "definition": "Craig Handicap Assessment and Reporting Technique-Short Form Paper Version - With how many strangers have you initiated a conversation in the last month?",
            "identifier": "C119160",
            "notation": "CHSF217",
            "pref_label": "CHART-SF Paper Version - Initiated Conversation With Strangers Last Month",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C119068-C119160"
        },
        {
            "alt_label": "CHSF2-Combined Household Income Last Yr",
            "definition": "Craig Handicap Assessment and Reporting Technique-Short Form Paper Version - Approximately what was the combined annual income, in the last year, of all family members in your household?",
            "identifier": "C119161",
            "notation": "CHSF218",
            "pref_label": "CHART-SF Paper Version - Combined Annual Household Income Last Year",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C119068-C119161"
        },
        {
            "alt_label": "CHSF2-Medical Care Expenses Last Year",
            "definition": "Craig Handicap Assessment and Reporting Technique-Short Form Paper Version - Approximately how much did you pay last year for medical care expenses?",
            "identifier": "C119162",
            "notation": "CHSF219",
            "pref_label": "CHART-SF Paper Version - Medical Care Expense Last Year",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C119068-C119162"
        }
    ]
}