{
    "SKOS_CONCEPT": [
        {
            "alt_label": "KFSS104-Loss (essentially) of sensation in one or two limbs;or moderate decrease in touch or pain and/or loss of proprioception for most of the body below the head",
            "definition": "Kurtzke Functional System Scores original result for KFSS104-Loss (essentially) of sensation in one or two limbs; or moderate decrease in touch or pain and/or loss of proprioception for most of the body below the head.",
            "identifier": "C182819",
            "notation": "Loss (essentially) of sensation in one or two limbs; or moderate decrease in touch or pain and/or loss of proprioception for most of the body below the head",
            "pref_label": "Kurtzke Functional System Scores KFSS104 Original Result - Loss (essentially) of sensation in one or two limbs; or moderate decrease in touch or pain and/or loss of proprioception for most of the body below the head",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C182479-C182819"
        },
        {
            "alt_label": "KFSS104-Marked decrease in touch or pain or loss of proprioception, alone or combined, in one or two limbs;or moderate decrease in touch or pain and/or severe proprioceptive decrease in more than two limbs",
            "definition": "Kurtzke Functional System Scores original result for KFSS104-Marked decrease in touch or pain or loss of proprioception, alone or combined, in one or two limbs; or moderate decrease in touch or pain and/or severe proprioceptive decrease in more than two limbs.",
            "identifier": "C182818",
            "notation": "Marked decrease in touch or pain or loss of proprioception, alone or combined, in one or two limbs; or moderate decrease in touch or pain and/or severe proprioceptive decrease in more than two limbs",
            "pref_label": "Kurtzke Functional System Scores KFSS104 Original Result - Marked decrease in touch or pain or loss of proprioception, alone or combined, in one or two limbs; or moderate decrease in touch or pain and/or severe proprioceptive decrease in more than two limbs",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C182479-C182818"
        },
        {
            "alt_label": "KFSS104-Mild decrease in touch or pain or position sense, and/or moderate decrease in vibration in one or two limbs;or vibratory (c/s figure writing) decrease alone in three or four limbs",
            "definition": "Kurtzke Functional System Scores original result for KFSS104-Mild decrease in touch or pain or position sense, and/or moderate decrease in vibration in one or two limbs; or vibratory (c/s figure writing) decrease alone in three or four limbs.",
            "identifier": "C182816",
            "notation": "Mild decrease in touch or pain or position sense, and/or moderate decrease in vibration in one or two limbs; or vibratory (c/s figure writing) decrease alone in three or four limbs",
            "pref_label": "Kurtzke Functional System Scores KFSS104 Original Result - Mild decrease in touch or pain or position sense, and/or moderate decrease in vibration in one or two limbs; or vibratory (c/s figure writing) decrease alone in three or four limbs",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C182479-C182816"
        },
        {
            "alt_label": "KFSS104-Moderate decrease in touch or pain or position sense, and/or lost vibration in 1 or 2 limbs;or mild decrease in touch or pain and/or moderate decrease in all proprioceptive tests in 3 or 4 limbs",
            "definition": "Kurtzke Functional System Scores original result for KFSS104-Moderate decrease in touch or pain or position sense, and/or lost vibration in 1 or 2 limbs; or mild decrease in touch or pain and/or moderate decrease in all proprioceptive tests in 3 or 4 limbs.",
            "identifier": "C182817",
            "notation": "Moderate decrease in touch or pain or position sense, and/or lost vibration in 1 or 2 limbs; or mild decrease in touch or pain and/or moderate decrease in all proprioceptive tests in 3 or 4 limbs",
            "pref_label": "Kurtzke Functional System Scores KFSS104 Original Result - Moderate decrease in touch or pain or position sense, and/or lost vibration in 1 or 2 limbs; or mild decrease in touch or pain and/or moderate decrease in all proprioceptive tests in 3 or 4 limbs",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C182479-C182817"
        },
        {
            "alt_label": "KFSS104-Normal",
            "definition": "Kurtzke Functional System Scores original result for KFSS104-Normal.",
            "identifier": "C182814",
            "notation": "Normal",
            "pref_label": "Kurtzke Functional System Scores KFSS104 Original Result - Normal",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C182479-C182814"
        },
        {
            "alt_label": "KFSS104-Sensation essentially lost below the head",
            "definition": "Kurtzke Functional System Scores original result for KFSS104-Sensation essentially lost below the head.",
            "identifier": "C182820",
            "notation": "Sensation essentially lost below the head",
            "pref_label": "Kurtzke Functional System Scores KFSS104 Original Result - Sensation essentially lost below the head",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C182479-C182820"
        },
        {
            "alt_label": "KFSS104-Unknown",
            "definition": "Kurtzke Functional System Scores original result for KFSS104-Unknown.",
            "identifier": "C182821",
            "notation": "Unknown",
            "pref_label": "Kurtzke Functional System Scores KFSS104 Original Result - Unknown",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C182479-C182821"
        },
        {
            "alt_label": "KFSS104-Vibration or figure-writing decrease only, in one or two limbs",
            "definition": "Kurtzke Functional System Scores original result for KFSS104-Vibration or figure-writing decrease only, in one or two limbs.",
            "identifier": "C182815",
            "notation": "Vibration or figure-writing decrease only, in one or two limbs",
            "pref_label": "Kurtzke Functional System Scores KFSS104 Original Result - Vibration or figure-writing decrease only, in one or two limbs",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C182479-C182815"
        }
    ]
}