{
    "SKOS_CONCEPT": [
        {
            "alt_label": "TYPE1",
            "definition": "Individuals who never tan and always sunburn if exposed to any appreciable amount of sunlight, primarily red headed individuals and lightly complected blondes. (Reference: Fitzpatrick TB: The validity and practicality of sun-reactive skin types I through VI. Arch. Dermatol. 1998 124: 869-871)",
            "identifier": "C74569",
            "notation": "TYPEI",
            "pref_label": "Fitzpatrick Skin Type I",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C76351-C74569"
        },
        {
            "alt_label": "TYPE2",
            "definition": "Individuals who frequently burn but are able to tan to a small degree after extended sun exposure. (Reference: Fitzpatrick TB: The validity and practicality of sun-reactive skin types I through VI. Arch. Dermatol. 1998 124: 869-871)",
            "identifier": "C74570",
            "notation": "TYPEII",
            "pref_label": "Fitzpatrick Skin Type II",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C76351-C74570"
        },
        {
            "alt_label": "TYPE3",
            "definition": "Individuals who burn infrequently and tan readily. (Reference: Fitzpatrick TB: The validity and practicality of sun-reactive skin types I through VI. Arch. Dermatol. 1998 124: 869-871)",
            "identifier": "C74571",
            "notation": "TYPEIII",
            "pref_label": "Fitzpatrick Skin Type III",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C76351-C74571"
        },
        {
            "alt_label": "TYPE4",
            "definition": "Individuals who rarely burn and tan heavily with moderate sun exposures, especially individuals of Asian, American Indian, Mediterranean and Latin American descent. (Reference: Fitzpatrick TB: The validity and practicality of sun-reactive skin types I through VI. Arch. Dermatol. 1998 124: 869-871)",
            "identifier": "C74572",
            "notation": "TYPEIV",
            "pref_label": "Fitzpatrick Skin Type IV",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C76351-C74572"
        },
        {
            "alt_label": "TYPE5",
            "definition": "Individuals who have dark constitutive pigmentation but become noticeably darker with sun exposure, especially light complected black individuals, those of Indian descent. (Reference: Fitzpatrick TB: The validity and practicality of sun-reactive skin types I through VI. Arch. Dermatol. 1998 124: 869-871)",
            "identifier": "C74573",
            "notation": "TYPEV",
            "pref_label": "Fitzpatrick Skin Type V",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C76351-C74573"
        },
        {
            "alt_label": "TYPE6",
            "definition": "Individuals who have the heaviest constitutive pigmentation, especially dark skinned black individuals. (Reference: Fitzpatrick TB: The validity and practicality of sun-reactive skin types I through VI. Arch. Dermatol. 1998 124: 869-871)",
            "identifier": "C74574",
            "notation": "TYPEVI",
            "pref_label": "Fitzpatrick Skin Type VI",
            "uri": "http://id.d4k.dk/dataset/cdisc/ct/v48/sdtm/C76351-C74574"
        }
    ]
}